[
    {
        "id": "rec6fvzSPulK21ANL",
        "createdTime": "2025-02-28T01:58:12.000Z",
        "Company": "Expedia",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Travel",
        "Date": "2025-02-26T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2025/expedia-confirms-layoffs-at-seattle-travel-giant/",
        "$ Raised (mm)": 3300,
        "Stage": "Post-IPO",
        "Date Added": "2025-02-28T01:58:12.000Z",
        "Country": "United States",
        "Extracted Article": "Expedia Group confirmed that it laid off more workers as the Seattle-based travel giant looks to cut costs. “To ensure the best traveler experience, we must continually adapt to the evolving needs of our industry and travelers,” a company spokesperson said in a statement to GeekWire. “This requires difficult but necessary decisions such as refining our marketing strategies, improving efficiencies, and reallocating resources to areas with the greatest business impact to drive customer engagement.” The company declined to provide details on number of employees affected, or types of roles impacted. Update: Marketing and creative teams were impacted by the layoffs, according to posts on LinkedIn. Expedia had 16,500 employees across nearly 50 countries, as of Dec. 31, according to Expedia’s annual 10-K filing. That’s slightly down from its total employment of 17,100 at the end of 2023. About half of its workforce are in tech-related roles. Last year Expedia cut about 1,500 roles, primarily in its Product &amp; Technology division, as part of an operational review. Expedia reported revenue growth of 10% to $3.1 billion in the fourth quarter, while adjusted net income grew 30% year-over-year. Both beat analyst expectations. SEND US A TIP Do you have information about this story? Email tips@geekwire.com, or use this form to contact the GeekWire news team. “We were disciplined in our cost management in 2024, and that allowed us to expand profit margins while reinvesting in strategic areas,” Expedia CEO Ariane Gorin said on the company’s earnings call earlier this month. “We believe we still have room to deliver further efficiencies across our variable costs and fixed cost base to expand our margins even further.” The company’s stock is up nearly 50% over the past 12 months. Its market capitalization is more than $25 billion. Expedia Group includes brands such as vrbo, Orbitz, Hotwire, Trivago, and Hotels.com in addition to the flagship Expedia.com. Expedia recently hired eBay veteran Scott Schenkel as its chief financial officer."
    },
    {
        "id": "recP2f0Zg1zMPBmpf",
        "createdTime": "2025-01-17T21:19:57.000Z",
        "Company": "Textio",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Recruiting",
        "# Laid Off": 15,
        "Date": "2025-01-15T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2025/augmented-writing-startup-textio-lays-off-more-employees-will-invest-in-different-mix-of-roles/",
        "$ Raised (mm)": 42,
        "Stage": "Unknown",
        "Date Added": "2025-01-17T21:19:57.000Z",
        "Country": "United States",
        "Extracted Article": "Textio laid off 15 employees on Wednesday, the company confirmed, citing a restructuring at the Seattle augmented writing startup. The company did not specify how many people it still employs. There were more than 70 workers remaining after cuts last year. Founded in 2014, Textio uses artificial intelligence and machine learning to help remove bias from workplace language for hiring and performance feedback. Customers include Bloomberg, Cisco, Hulu, Oracle, Spotify, and Warner Music Group. The company laid off 14 employees in March 2024, and cut another 15 in 2023. “The side of our business that supports our Feedback product is growing, and we needed to invest in a different mix of roles and skills to continue building and selling,” a Textio spokesperson said in a statement to GeekWire. The company said workplaces are ramping up coaching and performance management support for managers, and Textio is investing in its ability to build and deliver on those customer needs. It will be opening up some new roles, including in sales and product marketing. Textio has raised $42.5 million from investors including Industry Ventures; Operator Collective; Emergence Capital; Scale Venture Partners; Cowboy Ventures; Bloomberg Beta; and Upside Partnership. Textio co-founder Kieran Snyder stepped down as CEO in January 2024. Jensen Harris, co-founder and previously chief experience officer — and Snyder’s husband — is now CEO."
    },
    {
        "id": "recc3hmlmB2QcyjFp",
        "createdTime": "2025-01-12T04:51:09.000Z",
        "Company": "Pandion",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 63,
        "%": 1,
        "Date": "2025-01-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2025/heavily-funded-pandion-delivery-startup-closes-abruptly-in-latest-logistics-industry-fallout/",
        "$ Raised (mm)": 76,
        "Stage": "Series B",
        "Date Added": "2025-01-12T04:51:09.000Z",
        "Country": "United States",
        "Extracted Article": "Pandion, a Bellevue, Wash.-based delivery startup that launched during the pandemic-fueled e-commerce boom, has become the latest company to fall victim to the subsequent venture capital crunch and a return to normalcy in online retail. The company informed employees Friday afternoon that it’s shutting down immediately, after talks with potential acquirers proved unsuccessful. Employees will be paid through Jan. 15, without severance. Pandion employed 63 people. As a result of discontinuing operations, the company’s headquarters in Bellevue will close, as will its five sortation centers, in Los Angeles, Dallas, Atlanta, Chicago and Philadelphia. The company was started in 2020 by former Amazon and Walmart executive Scott Ruffin, the founder and former leader of Amazon Air. It came out of stealth mode in February 2021. Pandion most recently raised a $41.5 million Series B round in March 2024, led by Revolution Growth, a Washington, D.C., venture capital firm. Bloomberg reported at the time that sales were on track to reach $220 million in 2024. In a memo Friday afternoon to Pandion employees, obtained by GeekWire, Ruffin apologized and took personal responsibility for the sudden shutdown, saying they deserved more notice and a better outcome. The company had enough cash for operations through the end of 2024, he wrote. After spending the last month in discussions with potential acquirers, including ongoing talks through the holidays, the company was close to a deal several times, but ultimately concluded that a sale wasn’t possible. “This is not how any of us were hoping or planning for this to end,” Ruffin wrote. He added later that the company “entered the market at a challenging time, and we needed more runway to scale, but the shift in funding availability and the US small parcel market has limited our chance to continue to grow.” A Pandion-branded delivery van, in an image distributed by the company in 2021. (Pandion Photo) The closure is part of a broader wave of challenges across the logistics and delivery industry, including the collapse of Convoy in October 2023, and cutbacks at companies including Flexe, Uber Freight, Flexport, and others. Pandion picked up packages at fulfillment centers operated by retailers, routed packages through its sortation centers, then used a network of more than 1 million delivery drivers to deliver items to their final destination. Those drivers were employed by staffing agencies, and many of them are expected to be assigned to different clients. The company’s competitors included UPS, FedEx, Amazon and others. It was #75 in the most recent ranking of the GeekWire 200 list of the Pacific Northwest’s fastest-growing startups. Pandion raised about $125 million in equity over the last five years. With the shutdown, investors are not expected to receive a return. Other investors in the company included Playground Global, Prologis Ventures, Bow Capital, Telstra Ventures, AME Cloud Ventures, Schematic Ventures, Proof, and Sentinel Global. Although the company wasn’t able to make an M&amp;A deal, its technology represents an asset that could still be interesting to a potential acquirer. That includes a universal label technology for flexible deliveries, and machine leaning technology that optimizes logistics for better on-time delivery rates at lower prices. Here is the text of the memo from Ruffin to employees: As we discussed in our last All Hands, we had runway through 2024 Q4 based on our last funding rounds. As many of you know, the leadership team and I have been speaking with many investors and several potential acquirers. We have spent the last month in daily discussions with these parties, including through the holidays. We have been very close to a deal several times. However, it has become clear to me and the board that those conversations have run their course without a favorable outcome. Due to our legal obligations to our lenders, our Board of Directors and I have decided that we must immediately shut down the company. Today is Pandion’s last day as an operating business. We’ve already cancelled inbound packages and will have no further pickups. For the minimal packages remaining at our facilities, we’ll have one last simplified dispatch to the postal service. As part of this process, Pandion will complete an assignment for the benefit of creditors. As a result, Wednesday, January 15, is everyone’s final day as an employee of Pandion. Your last paycheck through January 15 will arrive that day. Because we owe more than we have in the bank, we cannot provide a severance payment, even though you deserve more notice and a better outcome. I’m sorry. I take full responsibility for the series of decisions that led to this situation. I care about you, and [I] apologize this is the outcome. This is not how any of us were hoping or planning for this to end. What each of you have built is unquestionably amazing and will leave its mark on the industry well beyond our years. I believe in my heart of hearts that the power of markets and timing can serve as either a massive tailwind propelling the business forward or a massive headwind preventing a talented team like each of you from reaching ultimate success. In our case, we entered the market at a challenging time, and we needed more runway to scale, but the shift in funding availability and the US small parcel market has limited our chance to continue to grow. Effective Wednesday, I am no longer an employee of Pandion. My mission has now changed from Founder and CEO to a personal coach and mentor to any of you who desire help in your professional transition. I, and many others on the leadership team, are available to personally assist each and every one of you in finding your next roles. The People team will be reaching out to each of you on next steps. I wish this final All Hands could have been under much different circumstances, but I will always retain the pride and admiration for all that we built together."
    },
    {
        "id": "rec20lmqNkSeFCclq",
        "createdTime": "2025-01-15T01:17:09.000Z",
        "Company": "Zillow",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "Date": "2025-01-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2025/zillow-makes-job-cuts-after-reorganizing-agent-software-and-advertising-teams/",
        "$ Raised (mm)": 97,
        "Stage": "Post-IPO",
        "Date Added": "2025-01-15T01:17:09.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based real estate company Zillow Group laid off an unspecified number of employees, the company confirmed Friday. According to a statement from Zillow to GeekWire, the cuts impacted roles on reorganized agent software and advertising teams: “As part of our ongoing commitment to working with our agent customers to offer a digitized and integrated experience to more movers in more markets, we are focused on the long-term growth of the products and business solutions we offer to agents. We feel as confident as ever about this strategy, and we continue to prioritize investment in the areas that will most benefit our agent customers. “This week we’ve made some changes to the organizational structure of several agent software and advertising teams, resulting in the elimination of certain roles. We are grateful to the impacted employees for their contributions to Zillow and are ensuring their transition is as smooth as possible. While decisions like these are never easy and never our first choice, we believe responsibly managing our resources has positioned our teams well to deliver for consumers, agent customers and the broader real estate industry in 2025.” The move comes at the same time that Seattle-based real estate competitor Redfin made another round of job cuts, laying off 46 employees. A Redfin spokesperson said those reductions affected primarily managers in headquarters, program, and field leadership roles. Amid a tough real estate market, mortgage rates reached 6.93% this week, the highest level since July. Home listings are up, but partly due to unsold homes sitting on the market, Redfin reported. In one bright spot for buyers, affordability didn’t get worse in 2024. Zillow reported revenue of $581 million and adjusted earnings of $127 million during third quarter earnings in November. In August, Zillow named longtime executive Jeremy Wacksman as new CEO, taking over from co-founder Rich Barton."
    },
    {
        "id": "recVv9KEAqEu0xJri",
        "createdTime": "2025-01-15T01:18:53.000Z",
        "Company": "Redfin",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "# Laid Off": 46,
        "Date": "2025-01-09T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2025/redfin-lays-off-46-employees-in-latest-cuts-at-seattle-real-estate-company/",
        "$ Raised (mm)": 320,
        "Stage": "Post-IPO",
        "Date Added": "2025-01-15T01:18:53.000Z",
        "Country": "United States",
        "Extracted Article": "Redfin laid off 46 employees on Thursday, in another round of job cuts at the Seattle-based real estate company. A spokesperson confirmed the layoffs, which affected “primarily managers in our headquarters, program, and field leadership roles,” according to the company’s statement to GeekWire. No agents were impacted and the company said it is “continuing to aggressively hire agents.” Redfin employs more than 4,000 people. The company has had multiple rounds of cuts over the past two years as it navigates a tough real estate market. Mortgage rates reached 6.93% this week, the highest level since July. Home listings are up, but partly due to unsold homes sitting on the market, Redfin reported. In one bright spot for buyers, affordability didn’t get worse in 2024. In 2022, responding to a housing market slowdown, Redfin laid off staff and ditched its iBuying program. It also laid off 4% of its workforce, or 201 employees, in April 2023, and did another layoff in August 2024. Redfin reported revenue growth of 3% to $270 million in its most recent quarter. Net loss came in at $33 million, up from $19 million in the year-ago period. Real estate industry changes from the National Association of Realtors settlement, including a substantial shift in the agent commission structure, went into effect last year. Redfin last year rolled out Redfin Next, a new compensation model for its agents that eliminated salaries and has expanded to more cities."
    },
    {
        "id": "recmxI7NumCTBxEec",
        "createdTime": "2025-01-15T01:18:06.000Z",
        "Company": "RealSelf",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "Date": "2024-12-19T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/realself-layoffs-cosmetic-procedure-review-company-cuts-staff/",
        "$ Raised (mm)": 42,
        "Stage": "Series B",
        "Date Added": "2025-01-15T01:18:06.000Z",
        "Country": "United States",
        "Extracted Article": "RealSelf, a Seattle-based cosmetic treatment review and resource platform, laid off part of its workforce last week. The layoffs affected longtime employees and senior sales leaders, according to posts about the cuts on LinkedIn. The company did not respond to multiple requests for comment. We’ll update this story if we hear back. The layoffs came as a surprise and were conducted over a short video call last week, according to sources familiar with the matter. In an email sent to affected employees, obtained independently by GeekWire, the company wrote: “As discussed in our meeting this morning, in an effort to right-size and optimize RealSelf for the future, the company has made the difficult decision to restructure our team, effectively immediately.” RealSelf has less than 100 employees, according to LinkedIn. The company, founded in 2006, operates a Yelp-like marketplace that helps people learn more about cosmetic procedures including botox, facelift, liposuction and more. There are patient reviews and photos, treatment costs and ratings, and thousands of verified doctors on its platform. RealSelf previously cut staff in 2022, 2020, and 2019. The company named Minou Clark as its new CEO in July. Clark was previously a senior vice president at 11:11 Media, a media company founded by Paris Hilton, and held leadership roles at Yahoo, Dotdash Meredith, and Popsugar. In a LinkedIn post announcing her new role, Clark referenced an “upcoming brand refresh” that “represents the best parts of our legacy and will carry us into this next chapter as we grow.” “Think thumb-stopping social content, personalized newsletters, a dynamic website, doctor recommendations you can trust, honest af user reviews, booking on-site (I know, I know, this should already be a thing), transformation videos, brand activations, loyalty programs and more,” Clark wrote. “We have so many tricks up our sleeves.” Clark recently posted about an open role at RealSelf. The company has four open positions. RealSelf last month hired former Peachy exec Ende Li as its new chief financial officer. Clark and Li are based in New York City, according to LinkedIn. The company’s former CFO, Jim Nida, served as interim CEO from December 2023 to July, according to LinkedIn. RealSelf founder and former CEO Tom Seery remains executive chairman of the company. We reached out to Seery for comment. In 2021, RealSelf acquired Tajmeeli.com and the YNS group. The company said it transitioned to remote-first in 2020."
    },
    {
        "id": "rec6OC1uwPBEPsSAg",
        "createdTime": "2024-12-13T00:41:49.000Z",
        "Company": "OfferUp",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "%": 0.22,
        "Date": "2024-12-11T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/offerup-cuts-22-of-staff-amid-expansion-beyond-used-goods-read-ceos-memo-to-staff/",
        "$ Raised (mm)": 381,
        "Stage": "Unknown",
        "Date Added": "2024-12-13T00:41:49.000Z",
        "Country": "United States",
        "Extracted Article": "OfferUp, the Seattle-area company behind a popular used goods marketplace, is cutting 22% of its headcount in a bid to remain profitable as it looks to expand into new product lines. In a memo to staff, which you can read in full below, OfferUp CEO Todd Dunlap cited macroeconomic trends such as programmatic ad rates that affected some of the company’s revenue lines. “While we still have plenty of cash on our balance sheet, it’s important in these times to remain profitable,” he wrote. The company did not disclose the number of employees affected by the layoffs. OfferUp has nearly 500 employees, according to LinkedIn. Affected employees will receive severance and health benefits through the end of February. The company is providing career transition and job placement services. Founded in 2011, OfferUp competes against Craigslist, eBay, Facebook and other marketplaces where users buy and sell goods. The company says it facilitates 30 million transactions on its platform annually and is currently ranked No. 3 on the GeekWire 200, our index of Pacific Northwest startups. It generates revenue in part by charging sellers for premium features and broader reach. OfferUp has been planting seeds to expand beyond used goods and into “local commerce” areas such as job postings, events, home services, and more. “To be clear, finding great deals on goods and autos in your local community will remain the core of OfferUp,” Dunlap wrote in the memo. “But we have clear signal that the simple, trusted, and safe approach that has made us successful in goods and autos can be extended into additional local offerings, and that those extensions will create a better experience and better value for our users.” Layoffs hit the tech industry hard during 2022 and 2023 amid higher interest rates and more cautious spending. More than 260,000 tech employees were laid off last year, and nearly 150,000 were cut this year so far, according to Layoffs.fyi. Dunlap, a former exec at Xbox and Booking.com, took over for OfferUp founder and former CEO Nick Huzar in 2021. Huzar is now leading a secretive new EV charging startup, Juicer Energy. Read Dunlap’s memo to staff below. ——————— OfferUp Team, I’m reaching out today with some difficult news. After careful consideration, we have made the decision to reorganize our team to better align with our goals and strategy for 2025 and beyond. Unfortunately, as part of that reorganization, we will be reducing the size of our team. OfferUp managers and our People team just finished meeting with our colleagues who will be leaving, so I wanted to touch base with the rest of you to provide some context for the changes. First and foremost, I want to thank our departing colleagues. Many of them are strong contributors who made a big impact on OfferUp and its users. In most cases, they were in roles that we determined weren’t necessary for our future plans, and while I wish our growth was sufficient to create new roles for them, that is not currently the case. We know they will have a similarly positive impact in their next roles and wish them the best. It is important that we treat those leaving fairly and in accordance with our values. We are providing our departing colleagues with the following: Severance – The holidays are a difficult time for this transition, so we will be providing severance in an amount equivalent to their salary through the end of February. They will also be receiving the same holiday bonus as our remaining employees. Healthcare – We will cover the full cost of COBRA coverage through February 2025. Outplacement Services – Our departing colleagues will have access to career services through a company that provides career transition and job placement services. Laptops – We are allowing everyone to keep their OfferUp-issued computers at no cost. For most of those impacted, today is their last day at OfferUp. A few selected employees have agreed to stay on to help transition over the next few months. In all cases, I personally appreciate the dedication and professionalism demonstrated by our departing colleagues, and I ask you all to join me in thanking them. With respect to the reorganization and strategy, we’ll discuss the specifics in more detail in the all-team meeting tomorrow. I don’t want to go into too much detail today because today is a day of adjustment, and I want to provide you all with a bit of time before we start focusing on the future. That said, I will provide some high-level insight into the go-forward plan so that you’re not left wondering. We’ve talked over the last several months about our ongoing transition from a C2C local items marketplace to a comprehensive mobile platform for classifieds and local connection. We’ve tested a few steps into this evolved concept for OfferUp, and the results are very encouraging. To be clear, finding great deals on goods and autos in your local community will remain the core of OfferUp. But we have clear signal that the simple, trusted, and safe approach that has made us successful in goods and autos can be extended into additional local offerings, and that those extensions will create a better experience and better value for our users. With the launch of Jobs, Services, Real Estate Rentals, Local Events, Community, and the other local connections experiences, we’re showing there is demand for the OfferUp approach to “local” in many areas. I’ve also been blown away by the response of local merchants to the OfferUp Business offering that we added last year. The numerous positive testimonials from our local merchant customers about the success they see on OfferUp demonstrates the huge impact we can have on the people and organizations that help our communities thrive. I really want to lean in on these opportunities to evolve OfferUp. To do so, we need to ensure (1) that we will have sufficient resources for the investment, and (2) that we can do so responsibly and profitably. While 2023 was a great year for OfferUp and we saw revenue growth and our first year of EBITDA profitability, in 2024, the macroeconomic impact on some of our legacy revenue lines, particularly the impact of programmatic ad rates, has caused us to slip slightly back into the red. While we still have plenty of cash on our balance sheet, it’s important in these times to remain profitable. It’s also important to invest in spreading our story to more users, and I want to put more resources toward user growth and brand awareness. However, I want to invest prudently and profitably, and the restructured organization will allow us to do so. In short, we want to provide more reasons for our users to come back to OfferUp more often, we want to be a force that strengthens and connects our local communities, and we want to invest in making sure more users know how OfferUp can help them in their everyday lives. I look forward to sharing more with you tomorrow about how our new structure will allow us to achieve those goals. Todd"
    },
    {
        "id": "recgIDHinydyyFAtQ",
        "createdTime": "2024-11-07T15:41:08.000Z",
        "Company": "Outreach",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "# Laid Off": 67,
        "%": 0.09,
        "Date": "2024-11-06T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/outreach-cuts-9-of-workforce-in-latest-layoffs-at-seattle-sales-automation-startup/",
        "$ Raised (mm)": 489,
        "Stage": "Series G",
        "Date Added": "2024-11-07T15:41:08.000Z",
        "Country": "United States",
        "Extracted Article": "Outreach is trimming its headcount, laying off 9% of staff in another cost-cutting move. A company spokesperson confirmed the latest layoffs, which impacted more than 65 employees globally, mainly in go-to-market roles. Outreach is offering impacted employees severance, benefits, and career counseling. The company is not closing any offices. It now has 680 employees. Outreach has gone through multiple rounds of layoffs over the past few years, including a 12% cut in September 2023. Layoffs hit the tech industry hard during 2022 and 2023 amid higher interest rates and more cautious spending. More than 260,000 tech employees were laid off last year, and more than 143,000 were cut this year so far, according to Layoffs.fyi. Founded in 2014, Outreach has more than 6,000 customers including Zoom, Twilio, and McKesson. It aims to help companies improve their seller workflows and win more deals. Outreach competes with other sales engagement companies including Salesloft, Apollo, and Clari. Tech giants such as Microsoft and Salesforce offer their own products aimed at streamlining and automating sales processes. The impact of the generative AI boom is a big topic in the sales automation sector. Outreach has raised nearly $500 million and reached a $4.4 billion valuation after raising $200 million in 2021. It is ranked No. 1 on the the GeekWire 200 list of privately-held tech companies in the Pacific Northwest. Outreach co-founder and former CEO Manny Medina stepped down in September. Abhijit Mitra, who joined the company last year as its president of product and technology, replaced Medina as Outreach’s new CEO."
    },
    {
        "id": "recZ2fqCRbZlWAjv8",
        "createdTime": "2024-10-30T02:05:46.000Z",
        "Company": "F5",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Security",
        "# Laid Off": 100,
        "%": 0.02,
        "Date": "2024-10-29T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/f5-confirms-new-round-of-job-cuts-continuing-annual-pattern-of-workforce-reductions/",
        "Stage": "Post-IPO",
        "Date Added": "2024-10-30T02:05:46.000Z",
        "Country": "United States",
        "Extracted Article": "F5 continued its practice of trimming its workforce after the completion of its fiscal year, confirming Tuesday that it has made job cuts impacting roles across several teams inside the company. The workforce reduction amounts to less than 2% of the company’s global workforce, a spokesperson for the Seattle-based application security and delivery company told GeekWire via email. F5 employs about 6,500 people, according to previous SEC filings, which means that the cuts impacted more than 100 positions. “These changes are a part of a broader effort to align resources to our highest priority areas and ensure we are best positioned to meet the continually evolving needs of our customers and our business,” the spokesperson said. F5’s fiscal year ended Sept. 30. The company on Monday reported quarterly revenue of $747 million, up 6% year-over-year, and GAAP net income of $165 million, up more than 8% year-over-year. While generally growing its headcount overall, the company has made similar layoffs in the past, following its annual review of its business and operations. Previous examples include layoffs November 2023, October 2022, fall 2021 and fall 2019, according to previous GeekWire reporting and the company’s regulatory filings. The company’s CEO, François Locoh-Donou, paused layoffs in 2020 at the height of the pandemic. SEND US A TIP Do you have information about this story? Email tips@geekwire.com, or use this form to contact the GeekWire news team. More recently, F5 laid off a smaller number of employees working on marketing-related content production, saying it was shifting marketing resources to rely more heavily on agencies for creative and content needs. The difficult tech job market means many people across the industry are spending months looking for work. F5 did not provide further details about the latest round of layoffs this week. Employee posts on LinkedIn and messages to GeekWire indicate that teams were impacted in areas including technology services, sales, customer support, and process management. Reporting its financial results this week, the company said its board authorized an additional $1 billion for its common stock repurchase program. The company’s stock is up more than 20% this year. F5 also appointed Cooper Werner as its new chief financial officer and executive vice president. Werner, who joined F5 in 2001 and was previously senior vice president of finance, will replace Frank Pelzer, who is retiring."
    },
    {
        "id": "recVe4flkvNhqwhzF",
        "createdTime": "2024-09-26T13:20:45.000Z",
        "Company": "F5",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Security",
        "Date": "2024-09-24T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/f5-layoffs-impact-in-house-content-creation-employees/",
        "Stage": "Post-IPO",
        "Date Added": "2024-09-26T13:20:45.000Z",
        "Country": "United States",
        "Extracted Article": "F5 is laying off employees working for the company’s marketing-related content production team, GeekWire has learned. The Seattle-based company confirmed the cuts, and said they impacted less than 0.25% of its workforce. F5 has about 6,500 employees worldwide. F5 is shifting marketing resources and will rely more heavily on agencies for creative and content needs. The application delivery company has made a recent push to use generative AI tools for content production, according to one worker we spoke with who was impacted by the layoffs. Marketing and sales is seeing the most adoption of generative AI tools across all company functions, according to a recent McKinsey survey. Large companies such as Microsoft and smaller startups are rolling out new generative AI tools designed for marketing tasks such as content creation. Layoffs hit the tech industry hard during 2022 and 2023 amid higher interest rates and more cautious spending. More than 260,000 tech employees were laid off last year, and more than 137,000 were cut this year so far, according to Layoffs.fyi."
    },
    {
        "id": "recECiO7Gt5VLN4j2",
        "createdTime": "2024-09-13T15:16:10.000Z",
        "Company": "Amperity",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Marketing",
        "%": 0.13,
        "Date": "2024-09-12T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/amperity-lays-off-13-of-staff-in-latest-cuts-for-customer-data-startup/",
        "$ Raised (mm)": 187,
        "Stage": "Series D",
        "Date Added": "2024-09-13T15:16:10.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle startup Amperity is laying off 13% of its workforce, the company confirmed Thursday. “We are streamlining our operational and corporate functions while better prioritizing our investments on our go-to-market strategy,” Amperity interim CEO Chris Jones said in a statement. “A key aspect of this shift involves directing more resources towards delivering on our vision.” Amperity previously laid off staff in January. It also cut 10% of its workforce in a separate round of layoffs last year. Amperity had around 400 employees at the beginning of this year. Jones cited the latest cuts to broader industry headwinds. “These challenges are not unique to Amperity,” he said. “The current economic climate is affecting the entire enterprise software industry. Both software vendors and their customers are facing similar economic pressures and having to make the necessary adjustments to navigate these market conditions.” Layoffs hit the tech industry hard during 2022 and 2023 as venture capital dollars dried up and customers became more cautious of spending. More than 260,000 tech employees were laid off last year, and more than 136,000 were cut this year so far, according to Layoffs.fyi. Founded in 2016, Amperity’s software lets companies fine-tune their targeted marketing campaigns by connecting fragmented data sources about individual customer habits via emails, purchase history, mobile app usage, website traffic, physical store visits, and more. The startup earned “unicorn” status in July 2021, reaching a $1 billion valuation after raising $100 million. Jones took over from former CEO Barry Padgett earlier this year. Padgett became CEO in 2022, following the sudden departure of co-founder Kabir Shahani, who said he left voluntarily for personal reasons. Shahani also resigned from the company’s board. Last month the company hired Chris Polishuk as its chief revenue officer."
    },
    {
        "id": "recAo1bm1VrXNCjNp",
        "createdTime": "2024-10-01T16:11:25.000Z",
        "Company": "Center",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Finance",
        "# Laid Off": 8,
        "%": 0.04,
        "Date": "2024-09-07T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/corporate-expense-software-startup-center-lays-off-workers/",
        "$ Raised (mm)": 102,
        "Stage": "Series C",
        "Date Added": "2024-10-01T16:11:25.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "reci8T84aNtDbpejc",
        "createdTime": "2024-10-17T02:10:14.000Z",
        "Company": "Submittable",
        "Location HQ": [
            "Missoula"
        ],
        "Industry": "Other",
        "# Laid Off": 40,
        "Date": "2024-08-08T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/social-impact-software-platform-submittable-acquires-wizehive-cuts-staff/",
        "$ Raised (mm)": 115,
        "Stage": "Unknown",
        "Date Added": "2024-10-17T02:10:14.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "rec8Rn0IYpkAAnJ75",
        "createdTime": "2024-07-08T01:51:36.000Z",
        "Company": "Microsoft",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Other",
        "Date": "2024-07-03T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/microsoft-lays-off-employees-in-new-round-of-cuts/",
        "$ Raised (mm)": 1,
        "Stage": "Post-IPO",
        "Date Added": "2024-07-08T01:51:36.000Z",
        "Country": "United States",
        "Extracted Article": "Microsoft conducted another round of layoffs this week in the latest workforce reduction implemented by the Redmond tech giant this year. The cuts impacted multiple teams and geographies. Microsoft declined to provide details about the number of employees laid off. Posts on LinkedIn from impacted employees show the cuts affecting employees in product and program management roles. “Organizational and workforce adjustments are a necessary and regular part of managing our business,” a spokesperson said in a statement. “We will continue to prioritize and invest in strategic growth areas for our future and in support of our customers and partners.” Microsoft’s fiscal year 2024 ended June 30. It’s not uncommon for Microsoft to restructure parts of its business as it begins a new fiscal year. SEND US A TIP Do you have information about this story? Email tips@geekwire.com, or use this form to contact the GeekWire news team. Last month Microsoft cut around 1,000 jobs across the company, in areas including its Azure cloud unit and HoloLens mixed-reality organization. Microsoft laid off nearly 2,000 employees in January in its gaming unit, three months after the tech giant completed its $69 billion acquisition of Activision Blizzard, the company’s largest acquisition ever. The cutbacks come as Microsoft tries to maintain its profit margins amid heavier capital spending, which is designed to provide the cloud infrastructure needed to train and deploy the models that power AI applications. Microsoft’s headcount surged during the pandemic but has leveled off in the past two years. The company employed about 227,000 people worldwide at the end of the 2023 calendar year, down from 232,000 a year earlier, according to numbers tracked by GeekWire based on regulatory filings and earnings calls. More than 100,000 tech workers have been laid off so far this year, according to Layoffs.fyi. Last year, companies laid off more than 260,000 employees. Email address Subscribe GeekWire Daily — Top headlines daily GeekWire Weekly — Most-read stories of the week, delivered Sunday Breaking News Alerts — Important news as it happens GeekWire Startups — News, analysis, insights from the Pacific Northwest startup ecosystem, delivered Friday GeekWire Mid-week Update — Most-read stories so far this week, delivered Wednesday GeekWire Partner Content — Special offers and sponsored content from GeekWire partners"
    },
    {
        "id": "recDEKFnqYaEgYtk4",
        "createdTime": "2024-05-02T18:28:10.000Z",
        "Company": "Assurance",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Finance",
        "# Laid Off": 112,
        "%": 1,
        "Date": "2024-05-01T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/prudential-to-shut-down-assurance-the-insurance-tech-startup-it-acquired-for-2-35b-in-2019/",
        "Stage": "Acquired",
        "Date Added": "2024-05-02T18:28:10.000Z",
        "Country": "United States",
        "Extracted Article": "Insurance giant Prudential is shutting down Assurance IQ, five years after spending $2.35 billion to acquire the under-the-radar tech startup based in the Seattle region. “As we look to the future, we believe that directly investing in our core businesses and capabilities will help us become a higher growth, more capital efficient company,” Caroline Feeney, head of Prudential’s U.S. businesses, wrote in an email to employees obtained by GeekWire. “After a careful review of our businesses and strategic initiatives, we have made the difficult decision to wind down our Assurance business.” Prudential noted in its first quarter earnings report on Tuesday that it “decided to exit” the Assurance business. The company confirmed the shutdown in a statement to GeekWire. Assurance uses technology to match consumers with insurance plans that are purchased online or through an agent. Its acquisition to Prudential was one of the largest in Seattle tech history, and the largest insurance tech exit in history, according to Financial Technology Partners. The startup, founded in 2016 by Michael Rowell and Michael Paulus, never raised any outside capital and quietly reached unicorn status as a $1 billion company. At the time of the deal, Prudential said Assurance’s “rapid-growth model offers compelling economic advantages with low fixed costs and low capital requirements that produce high margins and high degree of scalability.” “Assurance accelerates the strategy and growth potential of Prudential’s financial wellness businesses, bringing us closer to more people across the entire socio-economic spectrum to better serve the full picture of their needs,” Prudential CEO Charles Lowrey said in 2019. But just a few years later there were signs of trouble. A story by The Wall Street Journal in 2022, “How Prudential’s Big Tech Bet Went Sour,” cited missed financial targets and government inquiries over regulatory matters. Many insurance technology companies struggled amid the broader tech downturn that started in 2022. Prudential stopped reporting Assurance financial data in January 2023, in part because “its financial results and operations are not considered significant,” the company said at the time. Assurance reported adjusted operating income of $29 million in the fourth quarter of 2022, compared to a net operating loss of $10 million a year prior. Prudential took goodwill impairment charges, used when a company’s value decreases following an acquisition, of $177 million, $903 million and $1.06 billion in the fourth quarters of 2023, 2022 and 2021, respectively. Assurance had around 1,700 employees as of December 2022 and now has 1,000 employees, in addition to contract workers who help customers find insurance plans. Update: A filing with the Washington state Employment Security Department shows 112 workers in Seattle being laid off, starting July 3. In an email to employees on Tuesday, Assurance CEO Allison Arzeno wrote that “I realize this news comes as a shock and creates uncertainty.” She said a majority of the company’s employees will be laid off. “Together, we built something special here,” wrote Arzeno, who took over as CEO in 2020. “Our work made a difference. We helped hundreds of thousands of people navigate complex insurance tradeoffs and secure coverage that improved and protected their personal and financial well-being.” Prudential reported first quarter net income of $1.1 billion, down from $1.46 billion in the year-ago period. Asked about M&amp;A deals on the company’s earnings call with analysts Wednesday, Lowrey said Prudential “anticipated a different outcome when we purchased Assurance.” “As we look forward we will focus on acquisitions of more established businesses that present opportunities to expand our capabilities and scale in our existing market-leading businesses,” he said. The company’s stock is up nearly 30% in the past 12 months. It has a market capitalization above $39 billion. Read the full memo from Feeney below. “As we look to the future, we believe that directly investing in our core businesses and capabilities will help us become a higher growth, more capital efficient company. After a careful review of our businesses and strategic initiatives, we have made the difficult decision to wind down our Assurance business. Assurance was acquired by Prudential in 2019 to expand the company’s direct-to-consumer access to the U.S. mass market. Since then, the team has made meaningful progress in realizing Assurance’s vision to help people improve and protect their personal and financial well-being, while navigating a challenging business environment for the broader insurtech industry. However, as we sharpen our focus as an enterprise on growth, it is critical that we prioritize core businesses and capabilities where we have a competitive advantage. Business decisions like this are never easy, and we are working with the Assurance leadership team to support our employees, customers, and partners throughout this process. I want to thank all of our employees and other partners at Assurance for their dedication over the past five years. And more broadly to our teams across the U.S., thank you for always keeping our customers, clients, and each other top of mind.” Story updated with comments from earnings call."
    },
    {
        "id": "rec38C9rEzWBR5fgd",
        "createdTime": "2024-04-25T16:07:08.000Z",
        "Company": "98point6",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "Date": "2024-04-23T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/98point6-hit-by-new-layoffs-in-latest-change-at-health-tech-startup/",
        "$ Raised (mm)": 299,
        "Stage": "Acquired",
        "Date Added": "2024-04-25T16:07:08.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based digital healthcare startup 98point6 has conducted a new round of layoffs, the company confirmed Tuesday. 98point6 did not provide details on the number of employees affected. A number of posts from affected workers began showing up on LinkedIn last week. One affected employee told GeekWire that a majority of staff was let go. Another worker who joined the company more than six years ago called her layoff an “unplanned departure.” The company has around 100 employees in the U.S., according to LinkedIn. In a statement to GeekWire, 98point6 called the workforce reduction “part of a larger action at the company” and said a number of employees transitioned to Transcarent as part of its partnership with the San Francisco-based startup. 98point6 said it will continue to have an appropriate level of staffing as it continues to license its software to other healthcare organizations. LAYOFF TRACKER: A regularly updated list of tech layoffs in the Pacific Northwest. The layoffs follow a tumultuous past several years for 98point6, founded in 2015 as a virtual primary care provider. The company saw huge growth during the pandemic and raised a $118 million Series E round in late 2020. But then the startup went through an abrupt leadership change in 2021 when co-founder and CEO Robbie Cape was pushed out by the board. In July 2022, the company laid off 10% of its workforce, saying that the cuts were made “to align with the future needs of the business.” In March of last year, 98point6 announced that it was selling its virtual care platform and primary care business to Transcarent for $100 million in cash and equity. 98point6 relaunched as a software-only company focused on licensing its tech to third-party healthcare providers. RELATED: Tech job market remains in flux as layoffs continue and experienced workers struggle to get hired A month later, in April 2023, 98point6 raised $30 million to support its transition to the new business model. The investment was intended to help the startup scale the software business and develop new innovations such as data modeling and artificial intelligence. In January, the company acquired the remaining assets of Bright.md, a Portland-based asynchronous telehealth provider. 98point6 currently has no open positions on its jobs board. Cape, a Seattle tech veteran, founded the company alongside Gordon Cohen, a professor at the University of Arizona, and Jeff Greenstein, a longtime Seattle business leader and philanthropist who is chairman of 98point6. Greenstein became CEO after Cape’s departure. The company is currently led by CEO Jay Burrell. The tech downturn in 2022 led to widespread layoffs that continued throughout last year, when more than 250,000 tech workers lost their jobs. The pace of layoffs has slowed but companies are still shedding jobs in 2024, with more than 74,000 jobs cut at more than 250 organizations, according to Layoffs.fyi. 98point6 is currently in the No. 46 spot on the GeekWire 200 ranked index of Pacific Northwest startups. The company won the GeekWire Award for Health Innovation of the Year in 2019. It has raised nearly $300 million."
    },
    {
        "id": "recU1BzSEONNOKEzs",
        "createdTime": "2024-04-03T15:01:49.000Z",
        "Company": "Amazon",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "Date": "2024-04-03T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/amazon-web-services-cuts-hundreds-of-jobs-in-sales-training-and-physical-stores-technology/",
        "$ Raised (mm)": 108,
        "Stage": "Post-IPO",
        "Date Added": "2024-04-03T15:01:49.000Z",
        "Country": "United States",
        "Extracted Article": "Amazon Web Services will cut several hundred jobs in its Sales, Marketing, and Global Services organization, and a few hundred jobs on its Physical Stores Technology team, executives in the tech giant’s cloud computing division informed employees Wednesday morning in internal emails. In the Sales, Marketing, and Global Services organization, most of the cuts are in training and certification, and sales operations. The company said it’s shifting its focus to self-serve digital training and training programs run by external partners. AWS also cited overlap in some program management and sales operations roles. “We do not take these decisions lightly, and I know change can be difficult,” wrote Matt Garman, AWS senior vice president. “We operate in an incredibly fast-moving industry, and it is important that we stay agile as an organization.” He added, “The changes we are making are preparing the organization for the future, aligning with our strategy and priorities, and reducing duplication and inefficiency. I recognize the effect this has on every individual impacted.” RELATED STORYTech job market remains in flux as layoffs continue and experienced workers struggle to get hired For the AWS team that develops technology for Amazon’s physical retail stores, the cuts follow reports Tuesday that Amazon is shifting away from its “Just Walk Out” technology in its larger Amazon Fresh grocery stores. The layoffs will impact a portion of the AWS identity and checkout teams within the Physical Stores Technology organization, wrote Dilip Kumar, vice president of AWS applications, in a separate message to employees. “We’ve learned a lot through the launch of identity and checkout technologies in our large format Amazon Fresh stores, and have good customer feedback to inform our plans going forward,” Kumar wrote. “We are also expanding our identity and checkout technologies in smaller-format 1P [first-party] stores, and growing our third-party locations.” AWS said it will continue to hire and grow in other parts of its business. The cloud giant currently has thousands of open jobs, and says it’s working to find internal opportunities for employees whose roles are being eliminated. In a statement, a spokesperson said AWS “identified a few targeted areas of the organization we need to streamline in order to continue focusing our efforts on the key strategic areas that we believe will deliver maximum impact.” The company is “committed to supporting the employees throughout their transition to new roles in and outside of Amazon,” the spokesperson said, adding that the decisions “are difficult but necessary as we continue to invest, hire, and optimize resources to deliver innovation for our customers.” The job cuts are expected to take place in regions around the world, although the heavy concentration of AWS roles in Amazon’s hometown means that the decision is likely to have a disproportionate impact on the company’s Seattle workforce. Employees in the U.S. will receive pay and benefits for at least 60 days, outplacement job search support, and access to transitional health benefits, the company said. They will also be eligible for a severance payments. Many large tech companies have been making job cuts periodically for more than a year, starting in late 2022 and early 2023, seeking to focus their businesses and reduce operating costs. AWS was among the Amazon divisions impacted by the company’s overall reduction of 27,000 jobs in two major waves of layoffs last year. After experiencing a decline in profitability from mid-2022 to mid-2023, AWS rebounded with 29% and 38% increases in year-over-year operating profits in the third and fourth quarters of 2023, respectively. AWS reported profits of $7.2 billion on revenue of $24.2 billion in the fourth quarter, contributing significantly to Amazon’s overall business growth. Amazon’s market share among cloud infrastructure providers dipped to 31% in the fourth quarter, according to Synergy Research Group, despite double-digit revenue growth rates. Microsoft Azure and Google Cloud both grew at a faster clip, and boosted their overall market share to 24% and 11%, respectively. Demand for AI services is boosting cloud spending overall by large companies, with total enterprise spending on cloud infrastructure services approaching $74 billion in the quarter, up $12 billion or 20%, according to the research firm."
    },
    {
        "id": "recDRH6k39hBqRZdk",
        "createdTime": "2024-03-15T23:30:56.000Z",
        "Company": "Textio",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Recruiting",
        "# Laid Off": 14,
        "%": 0.16,
        "Date": "2024-03-14T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/augmented-writing-startup-textio-lays-off-14-employees-or-16-of-staff/",
        "$ Raised (mm)": 42,
        "Stage": "Unknown",
        "Date Added": "2024-03-15T23:30:56.000Z",
        "Country": "United States",
        "Extracted Article": "Textio laid off 14 employees this week, or 16% of its workforce, as part of a restructuring. The company confirmed the cuts to GeekWire on Thursday. It now has 71 employees. Textio said it is shifting resources to support Textio Lift, a product it released last year which helps managers write feedback and avoid bias while providing reports to leadership. Founded in 2014, Textio uses artificial intelligence and machine learning to help remove bias from workplace language for hiring and performance feedback. Customers include Bloomberg, Cisco, Hulu, Oracle, Spotify, and Warner Music Group. The company went through a small round of layoffs a year ago. More than 200 tech companies have laid off more than 50,000 employees so far this year, according to Layoffs.fyi. Last year, nearly a quarter million tech workers were laid off amid a tightened venture capital market and increased interest rates. Textio has raised $42.5 million from investors including Industry Ventures; Operator Collective; Emergence Capital; Scale Venture Partners; Cowboy Ventures; Bloomberg Beta; and Upside Partnership. Textio co-founder Kieran Snyder stepped down as CEO in January. Jensen Harris, co-founder and previously chief experience officer — and Snyder’s husband — is now CEO. Snyder remains on the board and has a new role as chief scientist emeritus. “The Textio team has evolved over the years, as has my personal relationship to the company,” Snyder wrote on LinkedIn on Thursday.” But if you’ve been part of it, especially if you were part of it for a sustained period of time, you have me in your corner forever. This is on my mind right now as several people are moving on from Textio this week.”"
    },
    {
        "id": "rec2JEYa3JP2Ffo06",
        "createdTime": "2024-02-27T05:49:18.000Z",
        "Company": "Expedia",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Travel",
        "# Laid Off": 1500,
        "%": 0.08,
        "Date": "2024-02-26T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/expedia-group-cutbacks-will-impact-1500-roles-this-year-more-than-8-of-workforce/",
        "$ Raised (mm)": 3300,
        "Stage": "Post-IPO",
        "Date Added": "2024-02-27T05:49:18.000Z",
        "Country": "United States",
        "Extracted Article": "Expedia Group expects about 1,500 roles to be impacted, primarily in its Product &amp; Technology division, under an operational review announced in an internal memo to the online travel giant’s employees from CEO Peter Kern today. “With so much technical achievement over the last 12 months and so much tech debt behind us, we now are obliged to take a close look at roles, skills, teams, and locations to ensure that our resources are focused in the right areas,” Kern wrote in the memo, obtained by GeekWire. “While this review will result in us eliminating some roles, it will also allow us to continue to invest in core strategic areas.” Expedia Group announced Feb. 8 that Kern will be stepping down as CEO in May, replaced by Ariane Gorin, currently president of Expedia for Business. Kern will remain vice chairman and stay on the board. In a statement Monday, an Expedia Group spokesperson confirmed the key points of Kern’s memo, including the fact that the operational review “will result in approximately 1,500 roles being impacted across the globe” this year. Update: In a regulatory filing, Expedia Group said it will incur pre-tax charges of $80 million to $100 million related to the cutbacks. Update: A filing with the Washington Employment Security Department shows 208 employees in the state affected by the cutbacks. Julie Whalen, the Expedia Group chief financial officer, hinted at the possibility of cutbacks in the company’s fourth quarter earnings call on Feb. 8, saying at the time that the company was “taking a very close look at streamlining our cost structure to align with the next phase of our journey.” Expedia Group made widespread cutbacks as part of a restructuring just prior to the pandemic, after the ouster of its CEO and CFO in December 2019. Media mogul Barry Diller, Expedia Group’s chairman, and Kern, its vice chairman, took over day-to-day management at the time, prior to Kern’s appointment as CEO in April 2020. COVID-19 travel restrictions hit the company hard in the months that followed, along with the rest of the travel industry, but the company has since rebounded, with record annual revenue of $12.8 billion and profits of $797 million in 2023. After peaking at more than 25,000 employees in 2019, the company employed 14,800 people as of 2021. The company has made smaller cutbacks in recent years, including an unspecified number of jobs last year in its Traveler Products team, part of Product &amp; Technology division. However, its total employment still rose to 17,100 at the end of 2023, with about half of those positions in tech roles, according to Expedia’s annual 10-K filing. Expedia Group includes brands such as vrbo, Orbitz, Hotwire, Trivago, and Hotels.com in addition to the flagship Expedia.com. The company has unified the tech platform for its different brands in recent years, and last year launched a unified travel loyalty program called One Key for Expedia, Hotels.com and vrbo. Read the full memo from Kern below. Team, We’ve gone through a massive transformation and changed almost every aspect of our business, including how we’re structured, how our teams work together, and what we’re focused on to deliver the best experiences for our travelers and partners. Through this journey we have consistently had to evaluate how we allocate resources to the most important work to ensure we are as efficient as possible in driving our growth. With so much technical achievement over the last 12 months and so much tech debt behind us, we now are obliged to take a close look at roles, skills, teams, and locations to ensure that our resources are focused in the right areas. As a result, this year we will be reviewing our operations which we expect will result in approximately 1,500 roles being impacted across the globe, mainly in our Product &amp; Technology division. As always, we will be engaging in consultation with local employee representatives, where applicable, before making any final decisions. While this review will result in us eliminating some roles, it will also allow us to continue to invest in core strategic areas. Where we already have clarity on the proposed changes, we will be notifying employees as soon as possible. If your role is impacted or potentially affected, you can expect to hear details from either your leader, the People Team, or your local employee representative within the next week. I know my message may make some of you feel anxious, so I wanted you to hear this news directly from me. We are extremely grateful for every Expedian’s contributions, and I know we wouldn’t be where we are today without the contributions of every member of our team. While the needs of a company may evolve, this does not diminish the contributions you have made to our success now and in the future. It is never easy to say goodbye to colleagues. For those of you who do end up leaving us, a sincere thank you and we wish you every success in your future endeavors. We will be doing everything we can to support you, including providing severance packages, extended access to the Employee Assistance Program, and providing support for those who want to apply for another role internally. Thank you to everyone who has helped get us to this point in our transformation. Please treat each other with empathy and take advantage of our wellbeing resources if you need support. PK"
    },
    {
        "id": "recewKxZyt783E4WC",
        "createdTime": "2024-02-28T18:46:00.000Z",
        "Company": "Glowforge",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Manufacturing",
        "Date": "2024-02-06T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/glowforge-lays-off-more-employees-after-funding-round-falls-through-at-3d-laser-engraver-maker/",
        "$ Raised (mm)": 133,
        "Stage": "Series E",
        "Date Added": "2024-02-28T18:46:00.000Z",
        "Country": "United States",
        "Extracted Article": "Glowforge laid off more employees after an investment round fell through recently at the Seattle-based maker of 3D laser engravers, the company confirmed to GeekWire. Co-founder and CEO Dan Shapiro declined to share how many people were impacted. In mid-December, Glowforge laid off 30 employees, and Shapiro said at the time that the cuts were necessary to help the company “get ready for what’s next.” This week, Shapiro said the last few months at the 9-year-old startup have been “a rollercoaster,” despite what he called a successful launch of the new lower-priced Aura engraver, which was designed to bring home crafting to a wider audience of consumers. “We had a challenging December when a new investment round was delayed,” Shapiro said via email. “Then another setback when it was canceled a few weeks ago.” Shapiro said revenue from the Aura and Glowforge’s other machines — the Plus and Pro — is enough to keep the company going. LAYOFF TRACKER: GeekWire’s regularly updated list of tech job cuts in the Pacific Northwest. “Unfortunately, to be cashflow positive, we had to reduce the size of our company,” he said. Glowforge, ranked No. 24 on the GeekWire 200 index of Pacific Northwest startups, had 145 employees last summer, and still employs roughly 75 people, according to the company’s About Us page. “As a part of our restructuring, we’re moving from 5-day-a-week customer support to 7-day-a-week; we’re doing that by moving to a hybrid of U.S.-based and international support team members,” Shapiro said. He said Glowforge is consolidating teams with fewer executives who have greater spans of responsibility. And internal AI tools will be used to offload busywork and let teams focus on high-impact work. Shapiro founded Glowforge in 2015 with fellow startup veterans Mark Gosselin, the current CTO, and Tony Wright, who left the company in 2017. Shapiro previously sold the startup Sparkbuy to Google, and he created Robot Turtles, a coding board game for kids that was one of the most successful campaigns ever on Kickstarter. The company raised $20 million as part of an extended Series E funding round in May 2023, and has raised $135 million to date. The venture capital market has cooled considerably following a record 2021. More than 260,000 tech employees were laid off last year, and companies continue to make cuts in 2024. “It sucks to lose great people,” Shapiro said. “As the company’s CEO, I’m responsible for this outcome. The folks who are leaving are brilliant, creative, and a part of the reason for our success. It’s my decisions that lead to them departing the company.” Glowforge is providing support to those who were let go with visa assistance, outplacement help, severance, and a full year of medical insurance paid by the company."
    },
    {
        "id": "recYOxJnUd0XPfaP7",
        "createdTime": "2024-01-18T01:27:06.000Z",
        "Company": "First Mode",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Transportation",
        "# Laid Off": 48,
        "%": 0.2,
        "Date": "2024-01-16T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/first-mode-reduces-workforce-revises-hybrid-trucks/",
        "$ Raised (mm)": 9,
        "Stage": "Acquired",
        "Date Added": "2024-01-18T01:27:06.000Z",
        "Country": "United States",
        "Extracted Article": "Editor’s note: This story and GeekWire’s Layoff Tracker were updated to reflect that 42 U.S.-based employees were laid off. Seattle-based First Mode says it’s cutting back on its workforce as it adjusts to the market demand for heavy trucks that rely less on fossil fuels. The company is cutting around 20% of its U.S. workforce, or 42 employees. Most of the 240 employees currently working for First Mode in the United States are in Washington state — for example, at the company’s Seattle HQ and at its proving grounds in Centralia, Wash. Operations in Australia, Britain and South Africa “may also possibly experience redundancies,” while operations in Chile are “not currently impacted,” First Mode CEO Julian Soles said in an email sent to employees. Despite the cutbacks, First Mode is continuing with plans to retrofit mining trucks to reduce their carbon footprint and address the climate challenge. “This is the year that we deliver commercial products to our customer sites. It is also when we finalise our transformation from an engineering services firm to a global decarbonisation product company,” Soles wrote, using British spellings. Next month, First Mode will officially open a 40,000-square-foot factory in Seattle’s SoDo district to manufacture power systems and the associated ground infrastructure for its “Path to Zero” product line. When the Anglo American mining conglomerate acquired a majority share of First Mode a year ago, the business plan focused on converting heavy trucks to use First Mode’s zero-emission, hydrogen fuel-cell powertrain — starting with Anglo American’s fleet. Since then, however, First Mode has determined that potential customers prefer a step-by-step approach to decarbonization. As a result, the company is working on a broader product line that also includes a lower-cost diesel-battery system — more like a Toyota Prius hybrid than a hydrogen-fueled Toyota Mirai. The Hybrid EV Retrofit, or HEV, is currently being tested at First Mode’s Centralia proving grounds, with commercial deployment due by 2025. First Mode says the diesel-electric hybrid reduces fuel usage and carbon emissions by up to 25%, thanks to regenerative braking. The retrofit package is designed so that the diesel-electric version can be reconfigured later as a fuel-cell or battery-electric truck, putting customers further along the path to zero carbon emissions. The #FirstModePathToZero starts with our turnkey HEV Retrofit.Demonstrated to reduce carbon emissions by up to 25%, we’re scaling its production in 2024 for deployment in 2025.Visit https://t.co/w5wmymX4te to unlock decarbonization for your haulage fleet. pic.twitter.com/P9IW5EIhpX— First Mode (@FirstModeHQ) January 2, 2024 “With strong customer interest, HEV has a clear commercial path forward,” Soles wrote in his memo. “By comparison, the nascent global green hydrogen economy is not yet where our customers need it to be for us to justify most of our FCEV [fuel-cell electric vehicle] spend and scope in 2024.” The wider short-term outlook for the hydrogen economy isn’t quite as sunny as it was a year ago. Last September, the International Energy Agency reported that cost concerns were “putting projects at risk and reducing the impact of government support for employment.” The long-term outlook still holds promise, however: In October, the U.S. Department of Energy announced that the Pacific Northwest will be home to one of seven U.S. hydrogen hubs, with up to $1 billion available to fund hydrogen-related projects. First Mode is among the ventures proposing projects. Soles said First Mode will have a key role to play in spurring the market for hydrogen-powered heavy vehicles “by solving the challenge of fuel cell power density, plus liquid hydrogen storage and refuelling as the global ecosystem of green hydrogen continues to develop.” In addition to reflecting First Mode’s revised strategy, the cutbacks address areas where last year’s business combination with Anglo American resulted in redundancies. When the $1.5 billion combination deal was closed, the plan called for First Mode to shift its corporate headquarters to London, where Anglo American is based. But since then, First Mode has decided to keep its HQ in Seattle. Soles, who came to the company from Anglo American, is said to split his time between London and Seattle. First Mode started out in 2018 as an engineering venture formed by veterans of a Seattle-area asteroid mining venture called Planetary Resources. The company initially provided expertise for space projects such as NASA’s Perseverance rover mission and the Psyche mission to a metal-rich asteroid. In 2019, First Mode began building an increasingly close relationship with Anglo American and eventually shifted its focus exclusively to clean tech."
    },
    {
        "id": "recc7G1oe3aFS4cdq",
        "createdTime": "2024-01-08T23:25:38.000Z",
        "Company": "Flexe",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 99,
        "%": 0.38,
        "Date": "2024-01-08T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/warehousing-and-logistics-startup-flexe-cuts-38-of-workforce-in-latest-layoffs/",
        "$ Raised (mm)": 263,
        "Stage": "Series D",
        "Date Added": "2024-01-08T23:25:38.000Z",
        "Country": "United States",
        "Extracted Article": "Flexe is trimming its headcount again in another round of layoffs. The Seattle-based startup cut 38% of its workforce, CEO Karl Siebrecht confirmed Monday. Update: A new filing from the Washington state Worker Adjustment and Retraining Notification (WARN) system revealed 99 affected workers. “We remain committed to supporting our departing employees and to continuing to provide world class service to our customers,” Siebrecht told GeekWire. Flexe previously laid off staff in September, including 131 positions in Washington state. The company did not provide an updated headcount, but Flexe employed about 260 people before the latest cuts. A former Flexe employee posted about a Slack thread for impacted workers. The layoffs reflect how quickly times have changed for startups such as Flexe that raised gobs of venture capital but are now facing roadblocks on multiple fronts — both industry-specific hurdles and broader market challenges. Flexe, which helps online retailers with warehousing space and other shipping needs, is among a crop of logistics startups that have been forced to cut costs in recent months. Seattle-based digital trucking marketplace Convoy, which reached a $3.8 billion valuation in 2022, abruptly shut down late last year. Flexe was another so-called “unicorn,” reaching a $1 billion valuation in 2022 after it raised a $119 million Series D round. At the time, Flexe was coming off big growth, fueled by a pandemic-driven surge in online shopping and higher freight volumes. Layoff tracker: See all recent workforce cuts at our regularly updated list After the company raised its Series D round, Siebrecht told GeekWire that “we need to be really smart about how we manage that cash given the market uncertainty,” adding, “we have to make investments in scalable growth — not just growth itself.” Tech startups across various industries continue to lay off staff or shut down, as venture capitalists remain cautious about deploying money after years of skyrocketing valuations amid lower interest rates. GeekWire reported Monday about Seattle-based camper van startup Cabana closing up shop. Less than a year ago, Flexe won Next Tech Titan honors at the GeekWire Awards in May. The company’s former longtime CTO David Glick stepped down in January. Flexe investors include Activate Capital, Madrona Venture Group, Prologis Ventures, Redpoint Ventures, funds and accounts advised by T. Rowe Price Associates, Inc. and T. Rowe Price Investment Management, Inc., and Tiger Global. Funds and accounts managed by BlackRock invested in the Series D round."
    },
    {
        "id": "rec2Q3DFGGEgp9gAT",
        "createdTime": "2024-01-09T23:43:16.000Z",
        "Company": "NanoString Technologies",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 50,
        "%": 0.09,
        "Date": "2024-01-06T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2024/nanostring-technologies-to-cut-9-of-workforce-gets-delisting-warning-from-nasdaq/",
        "$ Raised (mm)": 826,
        "Stage": "Post-IPO",
        "Date Added": "2024-01-09T23:43:16.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based publicly traded biotech company NanoString Technologies said in a filing Friday that it plans to cut about 50 positions, or 9% of its workforce. The company also reported that it received a notice from Nasdaq about its stock price being below the $1/share minimum requirement for 30 consecutive business days. It has until July 2 to regain compliance. NanoString’s stock fell sharply in November following a loss in a patent infringement case against 10X Genomics. 10x Genomics accused NanoString of infringing on seven patents related to NanoString’s GeoMx Digital Spatial Profiler that analyzes RNA and protein. Founded in 2003, NanoString spun out of Institute for Systems Biology and went public in 2013. It previously announced layoffs in October, cutting about 110 positions. Shares of NanoString reached a record-high in 2021, trading at more than $80/share."
    },
    {
        "id": "recjCC4LA18iBBvMd",
        "createdTime": "2023-12-22T00:48:13.000Z",
        "Company": "Kaspien",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "%": 1,
        "Date": "2023-12-19T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/kaspien-a-e-commerce-company-previously-known-as-etailz-is-shutting-down/",
        "$ Raised (mm)": 52,
        "Stage": "Post-IPO",
        "Date Added": "2023-12-22T00:48:13.000Z",
        "Country": "United States",
        "Extracted Article": "Kaspien Holdings, a publicly traded company that helps online brands boost sales on Amazon and other e-commerce platforms, is closing up shop. The Spokane, Wash-based company said in a filing this week that it has initiated a plan to wind down operations and complete a shutdown by May 1 of next year, following an assessment of its cash and liquidity position and near-term debt maturities. Earlier this month the company said it planned to lay off its workforce with the exception of a “core group of employees” by the end of January. Kaspien has less than 100 employees, according to LinkedIn. Kaspien’s third quarter earnings report shows revenue of $26.4 million for the 13-week period ending Oct. 28, down 9.3% year-over-year, and a net loss of $1.8 million. The company reported a net loss of $5.1 million for the 39-week period ending Oct. 28. It previously reported negative cash flows from operations in fiscal 2022 and 2021. As of Oct. 28 the company had $400,000 in cash and cash equivalents. A number of other agencies that work with Amazon sellers have also faced recent struggles, including Benitago and Thrasio. Kaspien is led by CEO Brock Kowalchuk, who joined the company in 2018 after a 7-year stint with Goldman Sachs. He was previously CFO and became interim CEO in March 2022. The company traces its roots to a largely bootstrapped Spokane startup called Etailz that was acquired by Trans World Entertainment in 2016 for $75 million in cash and stock. Etailz rebranded to Kaspien in 2020, and Trans World also changed its name to Kaspien Holdings at the time. Trans World originally launched in 1972. Kunal Chopra, who led the company as CEO from 2019 to 2022, said on LinkedIn that he was “sad” to see Kaspien going out of business. “Companies that do not innovate are bound to fail,” he wrote in the post. “In a fast-paced, competitive world, getting outcompeted is just a matter of time.” Hannah Sandmeyer, director of sales and business development, commented on Chopra’s post, saying that the company “simply ran out of runway” and “now so many have lost their jobs right before the holidays and are scared.” “The business is a tough one, so many dark corners, margins so thin, and with such a big sail, it was hard one to pivot fast enough,” Sandmeyer wrote. Kaspien’s stock surged at the beginning of 2021, reaching a peak of $46 per share. But it has gone downhill from there, trading at around $0.05/share on Tuesday. The company said it expects the delisting of its common stock from the OTCQB to be effective on or around Jan. 8. Kaspien’s board of directors include W. Michael Reickert, managing member of Independent Family Office LLC; Jonathan Marcus, CEO of Alimco Re Ltd; Tom Simpson, an angel investor who helped start Etailz with Josh and Sarah Neblett in 2008; and Mark Holliday, president of Goshawk Capital Corp. We reached out to the company for comment and we’ll update this story if we hear back."
    },
    {
        "id": "recf7HchshQYD9ix8",
        "createdTime": "2024-02-28T18:45:36.000Z",
        "Company": "Glowforge",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Manufacturing",
        "# Laid Off": 30,
        "Date": "2023-12-15T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/glowforge-lays-off-30-employees-as-maker-of-3d-laser-engravers-gets-ready-for-whats-next/",
        "$ Raised (mm)": 133,
        "Stage": "Series E",
        "Date Added": "2024-02-28T18:45:36.000Z",
        "Country": "United States",
        "Extracted Article": "Glowforge, the Seattle-based maker of 3D laser engravers, has laid off 30 employees, co-founder and CEO Dan Shapiro confirmed to GeekWire on Friday. “We’ve had to make some tough calls about parting ways with amazing people,” Shapiro said in an emailed statement. “They’ve helped us accomplish incredible things. And as we prepare for the opportunities ahead, we realized we had to make these changes to get ready for what’s next.” Shapiro declined to get into specific reasons for the cuts or provide an updated headcount number. The startup employed 145 people as of July, when GeekWire got a preview of its latest product, a lower-priced machine called Aura, designed to bring home crafting to a wider audience of consumers. LAYOFF TRACKER: Our regularly updated list of layoffs in the Pacific Northwest. Shapiro said he’s “grateful and indebted” to the people who got Glowforge to where it is, as the company looks toward “big plans” in 2024. “As the CEO, I’m responsible for the impacts this has on our departing colleagues, and we are doing everything we can to help,” he said. “We’ve made sure the people affected have outplacement support, severance, visa assistance, and 12 months of paid medical coverage to support them.” Glowforge is also compiling an opt-in list of people affected and encouraging other employers to email great-people@glowforge.com for an introduction. Shapiro founded Glowforge in 2015 with fellow startup veterans Mark Gosselin, the current CTO, and Tony Wright, who left the company in 2017. Shapiro previously sold the startup Sparkbuy to Google, and he created Robot Turtles, a coding board game for kids that was one of the most successful campaigns ever on Kickstarter. The company raised $20 million as part of an extended Series E funding round in May, and has raised $135 million to date."
    },
    {
        "id": "rec58hU8pbmw5SYCT",
        "createdTime": "2023-12-18T18:38:03.000Z",
        "Company": "Flyhomes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "Date": "2023-12-14T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-real-estate-startup-flyhomes-conducts-more-layoffs-amid-worsening-industry-headwinds/",
        "$ Raised (mm)": 310,
        "Stage": "Series C",
        "Date Added": "2023-12-18T18:38:03.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle real estate startup Flyhomes has conducted another round of layoffs as the company faces what it calls “persistent and worsening industry headwinds.” Flyhomes shared the news in a post on LinkedIn on Thursday. The company did not specify how many employees were impacted, only writing that “many beloved teammates” had been let go. And a company spokesperson declined to share the company’s current headcount with GeekWire. The startup, which helps home-buyers secure purchases with all-cash offers, laid off an undisclosed number of employees in June. It cut 20% of its workforce in July 2022 and again reduced headcount in November 2022. LAYOFF TRACKER: Our regularly updated list of layoffs in the Pacific Northwest. More cuts appear to have taken place this fall, as Kyle Munson, a former VP of growth marketing at Flyhomes, posted on LinkedIn in November that he was “laid off a few weeks ago.” “This decision comes in the face of persistent and worsening industry headwinds which have prompted us to restructure our business to best meet the needs of our customers in a rapidly evolving real estate market,” the company’s post on LinkedIn said this week. “Each step we took these past few years was done with thoughtfulness and careful consideration to minimize these types of measures. Ultimately though, they simply were not enough, and for that we are sorry.” Real estate startups have been hit hard by higher mortgage interest rates and broader macroeconomic headwinds, and layoffs have been felt across the industry at companies including Redfin, Opendoor, Compass and others. Founded in 2016, Flyhomes is led by CEO and co-founder Tushar Garg. It has raised more than $200 million to date, including a $150 million Series C round raised in June 2021. The company offers a suite of mortgage and home-buying services. It provides a Buy Before You Sell program that helps sellers buy and move into their next home before selling their current property. In September, Flyhomes vacated office space near the Seattle waterfront to move to a 4,000 square-foot office at 500 Union St. Suite 325 in downtown. A company spokesperson said the downsizing of space was a result of shifting to a remote-first work policy, and an updated headcount was not provided. Flyhomes acquired the host-to-own startup Loftium in February. The company also acquired assets from Home Sale Assured, a Chicago-area company that helps homeowners move into a new home without needing to sell their current home. Flyhomes investors include Norwest Venture Partners, Battery Ventures, Fifth Wall, Camber Creek, Balyasny Asset Management, Andreessen Horowitz, Canvas Partners, and former Zillow Group CEO Spencer Rascoff."
    },
    {
        "id": "recpeHFZ9fsuuq7zb",
        "createdTime": "2023-12-08T18:06:12.000Z",
        "Company": "Zulily",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "# Laid Off": 839,
        "%": 1,
        "Date": "2023-12-08T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/zulilys-closure-of-ohio-fulfillment-center-will-impact-274-workers/",
        "$ Raised (mm)": 194,
        "Stage": "Acquired",
        "Date Added": "2023-12-08T18:06:12.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recojXYDi9WIOwDQV",
        "createdTime": "2023-11-17T16:24:43.000Z",
        "Company": "Amazon",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "Date": "2023-11-17T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/amazon-will-cut-several-hundred-more-jobs-on-alexa-team-as-it-discontinues-some-initiatives/",
        "$ Raised (mm)": 108,
        "Stage": "Post-IPO",
        "Date Added": "2023-11-17T16:24:43.000Z",
        "Country": "United States",
        "Extracted Article": "Amazon will eliminate several hundred roles in its Alexa division as part of a broader shift in priorities and a focus on developing new forms of artificial intelligence, according to an internal memo sent to employees Friday morning. “As we continue to invent, we’re shifting some of our efforts to better align with our business priorities, and what we know matters most to customers—which includes maximizing our resources and efforts focused on generative AI,” wrote Daniel Rausch, vice president of Alexa and Fire TV, in the memo, obtained by GeekWire. “These shifts are leading us to discontinue some initiatives, which is resulting in several hundred roles being eliminated.” Amazon did not provide further details on the initiatives being discontinued. It’s the latest restructuring to impact the Alexa team. Amazon conducted layoffs in its Devices &amp; Services division last year as part of company-wide cuts, amid reports that the unit was losing as much as $10 billion a year. The company is under pressure to keep pace in the rapidly advancing field of generative AI. OpenAI’s ChatGPT has been grabbing attention for its advanced natural language conversations, including a mobile feature released by the San Francisco-based company for interacting with ChatGPT via voice and audio. Amazon in September previewed a generative AI-based Alexa feature called “Let’s Chat” that will allow users to engage in longer conversations with the voice assistant while maintaining the context of the discussion. Dave Limp, the longtime executive in charge of the Devices &amp; Services division, announced in August that he would be leaving the company. Former Microsoft executive Panos Panay was named his successor in September. Amazon has made recent cuts in other departments including music and gaming. Here’s the full text of the email sent this morning. From: Daniel RauschSubject: An Important Update for our Alexa Team Team, We’re really encouraged by the progress we’re making with Alexa: customers are interacting with Alexa tens of millions of times every hour and there are more than half a billion Alexa devices in customers’ homes. Our investments in generative AI are also bringing our vision for an even more intuitive, intelligent, and useful Alexa closer than ever before. As we continue to invent, we’re shifting some of our efforts to better align with our business priorities, and what we know matters most to customers—which includes maximizing our resources and efforts focused on generative AI. These shifts are leading us to discontinue some initiatives, which is resulting in several hundred roles being eliminated. Today, we will reach out to colleagues in the U.S. and Canada who are impacted by these role reductions. Notification emails will be sent out shortly, and we expect all notifications in the U.S. and Canada to be completed this morning (Pacific time). We will communicate with impacted colleagues in India next week, and are following local processes in other regions, which may include time for consultation with employee representative bodies, and possibly resulting in longer timelines to communicate. To those of you impacted by these reductions, please know we did not make this decision lightly. I want to sincerely thank you for all your hard work and dedication to the organization, and to our customers. We are committed to supporting you, and are providing packages that include a separation payment, transitional health insurance benefits, external job placement support, and paid time to conduct your job search. While this was a hard decision to make, we remain very optimistic about the future of Alexa. I want to reiterate that Alexa remains an incredibly important part of our business. I’m proud of the innovation we’ve driven, and continue to drive. Incorporating a new large language model into a voice-forward, personal AI, has been and continues to be an enormous scientific and engineering challenge. I’m excited for our customers to soon experience the future of Alexa, and to hear their feedback, so that we can continue to invent and evolve the experience for them. As always, please don’t hesitate to reach out to me or anyone on the leadership team if you have any questions. -Daniel"
    },
    {
        "id": "recbw5drxkdD5Nimm",
        "createdTime": "2023-11-06T16:08:56.000Z",
        "Company": "F5",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Security",
        "# Laid Off": 120,
        "%": 0.02,
        "Date": "2023-11-03T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-cloud-giant-f5-lays-off-120-employees/",
        "Stage": "Post-IPO",
        "Date Added": "2023-11-06T16:08:56.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recIxMq8JtR0GbwgG",
        "createdTime": "2023-10-19T00:45:08.000Z",
        "Company": "Convoy",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 500,
        "%": 1,
        "Date": "2023-10-19T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/convoy-collapse-read-ceos-memo-detailing-sudden-shutdown-of-seattle-trucking-startup/",
        "$ Raised (mm)": 1100,
        "Stage": "Series E",
        "Date Added": "2023-10-19T00:45:08.000Z",
        "Country": "United States",
        "Extracted Article": "Convoy’s plan to transform the trucking industry has come to a screeching halt. The Seattle company is closing its core business and laying off a majority of its workforce. “We hoped this day would never come,” Convoy CEO Dan Lewis wrote in a memo sent to employees Thursday morning. The startup sent shockwaves through the Seattle tech ecosystem and broader trucking sector after abruptly shutting down operations on Wednesday. In the memo, Lewis said the company faced both an “unprecedented freight market collapse” and “dramatic monetary tightening.” “This combination ultimately crushed our progress at the same time that it was crushing our logical strategic acquirer — it was the perfect storm,” he wrote in the memo, which you can read in full below. Lewis said the company spent the past four months assessing all possible strategic options for the business. “However, none of the options ultimately materialized into anything sufficient to keep the company going in its then current form,” he wrote. FOLLOW-UP: ‘The markets crushed us’: In tearful farewell to employees, Convoy execs reflect on shutdown The memo noted “potential future strategic options” but did not mention an acquisition. Before this week, Convoy had around 500 employees, down from a peak of about 1,500 people. The company raised $260 million at a $3.8 billion valuation just 18 months ago. Laid-off employees reportedly did not receive severance. Convoy certainly faced huge macroeconomic challenges. Freight demand has dipped, revenue per truckload is down, and there’s an oversupply of trucking companies. Avery Vise, a trucking analyst with FTR Transportation Intelligence, said it’s a challenging time for freight brokers because truck capacity is plentiful. That means shippers can find attractive freight rates with large asset-based carriers — versus smaller trucking companies like the ones Convoy targeted. Tim Denoyer, vice president and senior analyst with ACT Research, said he’s seeing shippers moving freight loads to their privately-owned fleets, which hurts the brokerage market. At the same time, digital brokerages such as Convoy are facing a liquidity crunch, according to Craig Fuller, CEO at freight industry news site FreightWaves. “Convoy was a victim of a violent commoditized industry that is facing one of its deepest recessions in decades and a sudden change in investor appetite from risk to unit economics,” Fuller wrote on Wednesday. Convoy co-founders Dan Lewis and Grant Goodale inside the company’s Seattle headquarters. (GeekWire File Photo / Taylor Soper) Convoy developed an Uber-like system that matched truckers with shippers. The company, backed by investors such as Bill Gates and Jeff Bezos, bet that its technology would reduce costs and increase utilization compared to traditional brokerages. A former executive told GeekWire that Convoy didn’t build enough of a tech advantage. Other brokers either had similar apps or were “fast followers” and built new functionality. Another former employee cited a tension between leadership over how Convoy positioned itself — as a tech company or a logistics company. Speaking at a GeekWire event this summer, Lewis said Convoy leaned into tech more heavily as it started to trim expenses. “We became even more of a tech company in the last 12-to-18 months,” he said. RELATED: ‘Convoy Mafia’: Alumni from trucking marketplace company take the wheel at their own startups Convoy said in April 2022 that it expected to surpass $1 billion in annual revenue. Then the layoffs began. The company started trimming headcount in June of that year, just months after it raised the massive Series E funding round. Convoy went through another layoff in October 2022. Then this past February, Convoy cut staff and closed its Atlanta office, which opened in 2019. Another round of layoffs happened in June. Co-founder Grant Goodale announced that month that he would step down from his position as chief experience officer and transition to an advisory role. Other logistics startups such as Flexport and Flexe, which grew rapidly during the pandemic, have laid off staff amid the broader market slowdown and a lack of available venture capital dollars. Convoy competitors, ranging from traditional brokerages such as C.H. Robinson and newer players including Uber Freight, are also struggling amid the shaky trucking market. Reports emerged in August that Convoy was seeking a sale. But not many predicted that this week’s collapse was how the company would enter its next — or final — chapter. Read the full memo below: From: Dan Re: Business Update All, As you’re all aware, over the past few days we’ve been taking actions to minimize disruptions to shippers and carriers by ensuring that all in-transit shipments get to their proper destinations. Thank you to everyone who stayed focused and got it done. As usual, you guys do amazing work. With that action nearing completion, Convoy will be closing down its current core business operations. Some of our team will continue on to handle this windup transition and potential future strategic options (all whom have already been spoken with), today is your last day at the company. We hoped this day would never come. We spent over 4 months exhausting all viable strategic options for the business. However, none of the options ultimately materialized into anything sufficient to keep the company going in its then current form. So, what happened? In short, we are in the middle of a massive freight recession and a contraction in the capital markets. This combination ultimately crushed our progress at the same time that it was crushing our logical strategic acquirer – it was the perfect storm. Convoy’s tech centric approach to trucking created real benefits. It also created the conditions for a truly scalable technology platform and business model that would have yielded real financial gains when market conditions improve. But in the end, market forces were too strong for us to withstand on our own. We moved all business levers possible. But we were running up the down escalator…. and it kept speeding up. So despite your excellent work on our product and service innovation, extensive revenue driving efforts, and the painful and sweeping cost cuts you have had to endure, it was still not enough to get us into the financial position necessary to withstand the increasing pressures of the industry, without the need for outside funding. Alongside this unprecedented freight market collapse, the dramatic monetary tightening we’ve seen over the last 18 months has dramatically dampened investment appetite and shrunk flows into unprofitable late stage private companies. Add to that, amidst these freight and financial conditions, M&amp;A activity has shrunk substantially and most of logical strategic acquirers of Convoy are also suffering from the freight market collapse, making the deal doing that much harder. The perfect storm. Following an exhaustive process, spanning many, many months during which we explored all viable strategic options for the business, the result is where we are today. Convoy is closing the doors on its current core business operations and exploring and evaluating strategic options for what might come next. The work you’ve all done will leave its mark on the freight industry forever. This industry needs to modernize. Shippers want it, carriers want it, and the market wants it. We still believe that this will be the future for this industry. As I just shared on our call, I think the world of you. Over the past few months I experienced some of the highest highs and lowest lows in business, but throughout it I remained motivated because of the incredible people at Convoy who gave me inspiration every day. You guys rock. #TruckYeah, Dan"
    },
    {
        "id": "rec7h9tvP4AQjZ2gh",
        "createdTime": "2023-10-04T17:38:59.000Z",
        "Company": "Qualtrics",
        "Location HQ": [
            "Salt Lake City"
        ],
        "Industry": "Other",
        "# Laid Off": 780,
        "%": 0.14,
        "Date": "2023-10-04T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/qualtrics-cuts-780-jobs-about-14-of-workforce-citing-complexity-from-rapid-hiring/",
        "$ Raised (mm)": 400,
        "Stage": "Acquired",
        "Date Added": "2023-10-04T17:38:59.000Z",
        "Country": "United States",
        "Extracted Article": "Qualtrics is cutting about 14% of its workforce to reduce costs and restructure its organization, citing a need to address the internal complexity created by its past hiring and growth. The privately held experience-management software company, co-headquartered in Provo, Utah, and Seattle, will lay off 780 employees, according to an internal memo to employees Wednesday morning from Qualtrics CEO Zig Serafin. Its headcount was 5,500 before the cuts. Qualtrics employs about 900 people in Seattle. Its office in downtown Seattle will remain in operation after the layoffs, according to the company. “Rapid hiring was essential to enable our growth up to this point, but it also created complexity that does not support continued growth at our scale,” Serafin wrote in the memo. “Simply put, the organizational structures, work processes and the way we made decisions previously don’t work for the company we’ve become, or the company we aspire to be.” In addition to the layoffs, “several hundred roles are changing or moving locations over the next year,” he wrote in the memo provided by the company to GeekWire and later made public on its site. Serafin explained that the changes will “touch every team at the company,” adding that they follow “a deep review of every function in the company.” The changes are meant to improve collaboration, time to market, and the ease of doing business with customers and partners, he wrote. He thanked and apologized to departing employees, outlining plans for a minimum of 10 weeks of severance pay for U.S. employees, depending on tenure and level, in addition to other benefits and career services. Qualtrics laid off about 270 employees in January. Hundreds of tech companies have laid off staff over the past few years amid a broader industry downturn, which came after a pandemic-driven software boom. Founded in 2002, Qualtrics bills itself as the leader and creator of the “experience management” category. Its products help companies collect and analyze data, through surveys and other technologies, to make customer and employee decisions. More than 90% of the Fortune 100 are Qualtrics customers. SAP acquired Qualtrics for $8 billion in 2019. The company spun out of SAP two years later and raised $1.55 billion in an initial public offering. Earlier this year Qualtrics went private again, with Silver Lake buying the company in a $12.5 billion deal. In the first quarter — the last time Qualtrics publicly reported financials — Qualtrics reported $409.8 million in revenue, up 22% year-over-year. The company has 28 offices globally. Qualtrics’ downtown Seattle tower was renamed Qualtrics Tower in 2019 when the company leased 275,000 square feet across 13 stories in the building, then under development. Qualtrics is now using eight of those floors."
    },
    {
        "id": "recjm8dnZDJDxkbIy",
        "createdTime": "2023-09-27T02:37:30.000Z",
        "Company": "Flexe",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 131,
        "%": 0.33,
        "Date": "2023-09-26T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-warehousing-startup-flexe-lays-off-33-of-workforce-amid-freight-industry-slowdown/",
        "$ Raised (mm)": 263,
        "Stage": "Series D",
        "Date Added": "2023-09-27T02:37:30.000Z",
        "Country": "United States",
        "Extracted Article": "Flexe, a Seattle logistics startup that hit a $1 billion valuation last year, has laid off 33% of its staff. The company confirmed the cuts to GeekWire but did not provide specific headcount data. Flexe employs more than 400 people, according to LinkedIn. Update: A new filing with the Washington state Worker Adjustment and Retraining Notification (WARN) system shows 131 layoffs at Flexe. Founded in 2013, Flexe sells on-demand warehousing space for online retailers, as well as transportation and fulfillment services. The company raised a $119 million Series D round last year, becoming one of Seattle’s rare “unicorns,” or startups valued at $1 billion or more. The freight market slowdown is impacting various logistics startups, including freight forwarding giant Flexport, which laid off 20% of its workforce in January and is in cost-cutting mode. Seattle digital trucking marketplace Convoy, another unicorn, has laid off employees several times over the past year. It’s a different environment than 2021, when funding to logistics startups such as Flexe nearly doubled year-over-year amid a pandemic-driven surge in online shopping and higher freight volumes. Flexe is led by CEO and co-founder Karl Siebrecht, the former CEO of AdReady and former president of aQuantive’s Atlas technology division. After the company raised its Series D round last year, Siebrecht told GeekWire that “we need to be really smart about how we manage that cash given the market uncertainty,” adding, “we have to make investments in scalable growth — not just growth itself.” The broader tech downturn spurred thousands of layoffs across the tech sector, though cuts have slowed in recent months. Flexe won Next Tech Titan honors at the GeekWire Awards in May. The company’s former longtime CTO David Glick stepped down in January. Flexe investors include Activate Capital, Madrona Venture Group, Prologis Ventures, Redpoint Ventures, funds and accounts advised by T. Rowe Price Associates, Inc. and T. Rowe Price Investment Management, Inc., and Tiger Global. Funds and accounts managed by BlackRock invested in the Series D round."
    },
    {
        "id": "rectAlyvxHPjPLFdP",
        "createdTime": "2023-09-22T00:07:26.000Z",
        "Company": "Outreach",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "%": 0.12,
        "Date": "2023-09-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/more-layoffs-at-outreach-seattle-sales-software-startup-cuts-12-of-staff/",
        "$ Raised (mm)": 489,
        "Stage": "Series G",
        "Date Added": "2023-09-22T00:07:26.000Z",
        "Country": "United States",
        "Extracted Article": "Outreach laid off 12% of its staff this week, the latest round of layoffs at the Seattle-based startup. A company spokesperson confirmed the headcount reduction in response to a GeekWire inquiry Wednesday evening. Outreach cited shifting economic conditions that have pushed the sales tech startup to implement a wide array of cost-cutting measures. Outreach did not provide an updated headcount. It will offshore certain business functions to Mexico City and India. “This decision was not made lightly,” the spokesperson said. “The overall economic environment has changed significantly over the last year. In order to ensure Outreach’s long-term success, we are making several changes to keep our costs in-line with a company of our size and stage.” The layoffs come after Outreach had a 5% cut in August 2022 and a 7% workforce reduction in February. It most recently laid off 5% of its staff last month. The startup also said in February that it suspended merit increases and the expansion or relocation of offices. “Our balance sheet remains strong, and we’re confident that these changes, along with ones we’re making internally, will help us achieve our goal of reaching profitability next year,” the spokesperson added. Outreach, launched in 2014, has more than 6,000 customers including Zoom, Siemens, Okta, DocuSign, and McKesson. It became a so-called unicorn startup in 2019 when it raised $114 million and surpassed a $1 billion valuation. It raised two additional fundraising rounds in 2020 and 2021. Seattle unicorn startups including Rad Power Bikes, Highspot, Karat, Convoy, and others have made cuts this year. Outreach is backed by Sands Capital, Salesforce Ventures, Operator Collective, Lone Pine Capital, Spark Capital, Meritech Capital Partners, Trinity Ventures, Mayfield, and Sapphire Ventures. The startup is ranked No. 2 on the GeekWire 200, our list of the top privately held companies in the Pacific Northwest. Update: Outreach confirmed that Amritansh Raghav, executive vice president of engineering, resigned from the company on Sept. 21. “We’re grateful for Amritansh’s many contributions to building a great engineering team and appreciate his commitment to ensuring a successful transition to new engineering leadership,” the company said in a statement."
    },
    {
        "id": "recxGnujoAMEj0u5M",
        "createdTime": "2023-09-08T16:01:57.000Z",
        "Company": "Blue Origin",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Aerospace",
        "Date": "2023-09-06T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/rare-layoffs-blue-origin-hr/",
        "$ Raised (mm)": 167,
        "Stage": "Unknown",
        "Date Added": "2023-09-08T16:01:57.000Z",
        "Country": "United States",
        "Extracted Article": "Several employees at Kent, Wash.-based Blue Origin are reporting that they’ve been laid off, marking a rare turnabout in the rapid growth of Jeff Bezos’ space venture. The reduction in force appears to be focused in the areas of human resources and talent acquisition, based on employees’ postings to LinkedIn. TechCrunch’s Aria Alamalhodaei, who reported the layoff trend on X / Twitter, said it looked as if “some (but not all) folks were given the opportunity to find another role” within the privately held company. Micah Thornton, a production control specialist at Blue Origin, wrote on LinkedIn that “several people from the Blue Origin Space Human Resource/Talent Acquisition team have been let go due to downsizing.” Several other employees wrote that they were laid off on Tuesday and are seeking new roles elsewhere. We’ve reached out to Blue Origin and will be updating this story with anything further that we can pass along. Founded in 2000, Blue Origin’s employment profile has been trending sharply upward in recent years, due to projects that include the suborbital New Shepard program (currently grounded after a launch anomaly that occurred a year ago), the BE-4 rocket engine and the orbital-class New Glenn rocket, the Blue Moon lunar lander and the Orbital Reef space station. The company’s workforce tally was less than 1,000 as recently as 2018. Two years ago, that count was reported at nearly 4,000 employees, and the figure rose to 6,000 by July 2022. Blue Origin’s current number of employees — including workers in Kent as well as in Alabama, California, Florida, Texas, the Washington, D.C., area and other locales — is said to have hit nearly 11,000. Despite the newly reported layoffs, Blue Origin is continuing to hire employees for other types of jobs, primarily in technical fields. The company’s career website currently has more than 440 job listings, although some of those listings refer to the same job. Update for Nov. 30: I’ve updated the reference to job listings to provide additional context."
    },
    {
        "id": "rec64Ad7QhaByd6Jm",
        "createdTime": "2023-09-07T15:26:54.000Z",
        "Company": "Absci",
        "Location HQ": [
            "Portland"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 30,
        "%": 0.15,
        "Date": "2023-09-05T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/biotech-company-absci-lays-off-30-employees-about-15-of-staff/",
        "$ Raised (mm)": 238,
        "Stage": "Post-IPO",
        "Date Added": "2023-09-07T15:26:54.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recnElYWOtvf1rxld",
        "createdTime": "2023-09-04T23:11:11.000Z",
        "Company": "Expedia",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Travel",
        "Date": "2023-08-31T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/internal-email-expedia-group-lays-off-some-tech-workers-in-latest-move-to-reshape-its-workforce/",
        "$ Raised (mm)": 3300,
        "Stage": "Post-IPO",
        "Date Added": "2023-09-04T23:11:11.000Z",
        "Country": "United States",
        "Extracted Article": "Expedia Group informed an unspecified number of workers in its technology organization Thursday that it’s eliminating their positions, the latest in a series of moves by the Seattle-based travel giant to overhaul its workforce. Those impacted by the cutbacks include employees in Expedia Group’s Traveler Products team, which is part of Expedia Group Chief Technology Officer Rathi Murthy’s larger Product &amp; Technology organization. “As we have begun looking to 2024, it is important that we are ready to ‘Build the world’s most loved AI powered travel apps.’ These changes to our org will help us take the next steps to move quickly and stay tightly aligned while simplifying where we can,” said Tript Singh Lamba, an Expedia Group senior vice president, alluding to the layoffs in an internal message Thursday evening, obtained by GeekWire. The primary focus of the internal email was not the cutbacks among rank-and-file employees but a series of changes in executive leadership, including one departure and one new hire. Eric Toyofuku, VP of research and advocacy, is leaving Expedia Group to pursue other opportunities, according to the email. Jonathan Finch, former Global CTO for Amazon Insurance, is joining Expedia Group and will lead its InsurTech business. The company acknowledged that it made cuts but did not provide specifics, including the number of employees impacted by the layoffs, in response to questions from GeekWire on Thursday afternoon. “We are committed to delivering great travel experiences for our customers as demand remains high,” a spokesperson said. “As we align operations to our business transformation, this has resulted in the elimination of some roles. We remain confident in our strategy and value the contribution of all our employees.” The company has made targeted layoffs at various points this year. Expedia Group made more widespread cutbacks as part of a restructuring just before the pandemic, when the travel industry was rocked by COVID-19 restrictions. At the same time, Expedia Group has continued to hire for some technology roles, capitalizing in some instances on layoffs by major tech companies earlier this year. After peaking at more than 25,000 employees in 2019, the company employed 14,800 people at the end of 2021, nearly half of them in tech-related positions. That rose to 16,500 at the end of 2022, more than half in tech roles. Expedia Group said previously that a new employee count won’t be disclosed publicly until the end of the year. Due in part to its increased employment and compensation expenses, Expedia Group reported that overhead expenses rose 14% in the second quarter to $627 million. Still, with record revenue of $3.36 billion, up more than 5%, the company was able to post a $385 million profit in the quarter, from a $185 million loss a year earlier. Expedia Group includes brands such as vrbo, Orbitz, Hotwire, Trivago, and Hotels.com in addition to the flagship Expedia.com. The company has combined the tech platform beneath its different brands in recent years, and recently launched a unified travel loyalty program called One Key for Expedia, Hotels.com and vrbo. Updated to correct the timing of Expedia’s February 2020 cutbacks."
    },
    {
        "id": "recNFBRW22MVmmntJ",
        "createdTime": "2023-08-30T23:48:56.000Z",
        "Company": "SkyKick",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Other",
        "# Laid Off": 140,
        "Date": "2023-08-30T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/cloud-automation-startup-skykick-lays-off-181-employees-in-washington-state/",
        "$ Raised (mm)": 198,
        "Stage": "Unknown",
        "Date Added": "2023-08-30T23:48:56.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "rec10tdV5U3jaQeuY",
        "createdTime": "2023-08-01T20:58:34.000Z",
        "Company": "Outreach ",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "%": 0.05,
        "Date": "2023-08-01T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-sales-software-startup-outreach-lays-off-employees-again-as-it-aims-for-profitability/",
        "$ Raised (mm)": 489,
        "Stage": "Series G",
        "Date Added": "2023-08-01T20:58:34.000Z",
        "Country": "United States",
        "Extracted Article": "Outreach laid off 5% of its staff, the third round of cuts in the past year for the Seattle sales software startup as part of cost-cutting efforts. A company spokesperson confirmed the headcount reduction in response to a GeekWire inquiry. Outreach now has about 1,000 employees across offices in Prague, London, Atlanta, and Indianapolis, in addition to the Seattle headquarters. “Outreach continues to make operational and organizational adjustments to align with our strategic growth plan and path to profitability,” Outreach spokesperson Andrew Schmitt said in a statement. Outreach had a 5% cut in August 2022, then a 7% workforce reduction in February. The startup also said in February that it suspended merit increases and the expansion or relocation of offices. Outreach CEO Manny Medina told GeekWire in February that the company’s sales were affected by the widespread layoffs across tech, as it operates on a per-user basis. But, at the same time, the tighter spending climate drove sales reps to rely more heavily on the startup’s tools for buyer qualification, offsetting some of that loss in demand, he added. Outreach, launched in 2014, has more than 6,000 customers including Zoom, Siemens, Okta, DocuSign, and McKesson. It became a so-called unicorn startup in 2019 when it raised $114 million and surpassed a $1 billion valuation. It raised two additional fundraising rounds in 2020 and 2021. Seattle unicorn startups including Rad Power Bikes, Highspot, Karat, Convoy, and others have made cuts this year. Outreach is backed by Sands Capital, Salesforce Ventures, Operator Collective, Lone Pine Capital, Spark Capital, Meritech Capital Partners, Trinity Ventures, Mayfield, and Sapphire Ventures. The startup is ranked No. 2 on the GeekWire 200, our list of the top privately held companies in the Pacific Northwest."
    },
    {
        "id": "recnyTg1ufVnXyu2H",
        "createdTime": "2023-06-30T14:59:42.000Z",
        "Company": "Karat",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "HR",
        "# Laid Off": 47,
        "Date": "2023-06-28T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/technical-recruiting-startup-karat-lays-off-47-employees-for-the-second-time-this-year/",
        "$ Raised (mm)": 169,
        "Stage": "Unknown",
        "Date Added": "2023-06-30T14:59:42.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle technical recruiting startup Karat is laying off 47 employees for the second time this year, part of an effort to restructure various organizations within the company and make progress towards profitability. The startup confirmed the cuts to GeekWire on Wednesday. It did not provide an updated headcount, but according to LinkedIn, the company has 393 employees, down from 423 employees in January. “Karat has made significant progress against the investment areas we outlined at the start of the year — we are on track to double our number of global enterprise customers and have become the first end-to-end hiring solution,” a company spokesperson said via email Wednesday. “We also continue to advance equity across the tech industry, scaling up our Brilliant Black Minds community to over 4,000+ Black engineers and adding new corporate Partners of Brilliance to hire them.” The layoffs impacted various roles, including product, client service, and go-to-market organizations, the spokesperson said. This is the second round of cuts this year, including a workforce reduction that also impacted 47 employees in January. Companies of all sizes are being advised to cut costs and reduce spending amid the broader tightening of the economy and slowdown in venture capital spending. Large Seattle startups including Convoy, Highspot, Flyhomes, and others have announced layoffs this month. Founded in 2014, Karat is led by Mo Bhende, a former director for Xbox at Microsoft, and co-founder Jeff Spector, who previously was chief of staff to Melinda French Gates at the Bill &amp; Melinda Gates Foundation. The startup uses a network of vetted interviewers who run the interviews via video conference, using a question format and scoring rubric based on research and analysis done by Karat. Companies receive feedback on the top qualified applicants, based on Karat’s due diligence, as well as insights about their hiring process. The idea is to help companies screen more candidates while freeing up their own employees from interviewing responsibilities. Its software is used by tech companies such as Compass, Intuit, and Indeed, and others including Ford, American Express, and Bank of America that need help interviewing engineers. Karat became one of Seattle’s highest-valued privately held startups after it raised $110 million in a Series C round in 2021, which brought its total valuation to $1.1 billion. It currently ranks No. 25 on the GeekWire 200, our list of the top startups in the Pacific Northwest. Karat’s Brilliant Black Minds uses Karat’s Interviewing Cloud to deliver free interview practice, feedback, and coaching to help aspiring Black software engineers prepare to successfully enter the tech industry. Tennis star Serena Williams invested in the startup last April."
    },
    {
        "id": "recxMidcM7YPYHmGl",
        "createdTime": "2023-06-27T15:54:27.000Z",
        "Company": "Convoy",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 30,
        "%": 0.05,
        "Date": "2023-06-26T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/trucking-marketplace-convoy-makes-more-layoffs-citing-customer-service-efficiency-gains/",
        "$ Raised (mm)": 1100,
        "Stage": "Series E",
        "Date Added": "2023-06-27T15:54:27.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based trucking marketplace Convoy has conducted another round of layoffs, its fourth in the past year, the company confirmed to GeekWire on Monday. The cuts impact the company’s customer-experience operations team. Convoy did not disclose how many people lost their jobs and did not provide an updated overall headcount. LinkedIn lists more than 800 employees at the company. “Earlier this year, we staffed this team at levels necessary to ensure a smooth transition to our new dedicated service model and to be prepared for a potential freight market rebound,” a Convoy spokesperson said in a statement. “With our customer service model transition complete and demonstrating efficiency levels double that of 2022 in many cases, coupled with a delayed rebound in the overall freight market, we are now right sizing staffing levels accordingly.” Convoy said the adjustment is specific to, and does not extend beyond, the customer experience operations team. That team’s staffing model is designed to be flexible for changing seasonal and economic conditions. Convoy previously made layoffs in February and closed its Atlanta office, which it first opened in 2019. Last year, cuts were made in October and June. Co-founded in 2015 by Amazon vets Dan Lewis and Grant Goodale, Convoy aims to increase earnings for truck drivers while simultaneously reducing cost for shippers by removing inefficiencies in the existing supply chain. Truck drivers download Convoy’s free app to find work without going through brokers who typically use emails and phone calls. Goodale announced last week that he is stepping down from his position as chief experience officer and transitioning to an advisory role by the end of the month. Lewis discussed the state of the trucking industry and more during a GeekWire interview on June 15. Convoy has grown to become one of the highest-valued privately held startups in the Seattle region. It raised $260 million at a $3.8 billion valuation last year. Convoy is No. 5 on the GeekWire 200, our list of the top startups in the Pacific Northwest."
    },
    {
        "id": "recekwqNtunGbIG5B",
        "createdTime": "2023-06-17T04:50:21.000Z",
        "Company": "Zulily",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "Date": "2023-06-16T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/more-layoffs-at-zulily-e-commerce-company-trims-headcount-after-private-equity-acquisition/",
        "$ Raised (mm)": 194,
        "Stage": "Acquired",
        "Date Added": "2023-06-17T04:50:21.000Z",
        "Country": "United States",
        "Extracted Article": "Zulily is laying off workers again. Several employees of the Seattle-based e-commerce retailer were let go from the company this week. The latest cuts follow an ownership change last month. Qurate sold the company to Los Angeles-based private equity firm Regent for an undisclosed purchase price. “We announced to our team members some difficult choices that have required the elimination of positions within the Zulily corporate teams as we focus on transforming the business for the future,” a Zulily spokesperson said in a statement. The company declined to provide details about the number of employees let go. Affected employees told GeekWire that they did not receive severance. Zulily laid off employees in March to help cut costs, and had another round of layoffs a year ago. Zulily reported a 17% drop in revenue during the first quarter, to $192 million, and a $43 million operating loss. Qurate cited lower unit volume and a reduction in shipping revenue “largely driven by reduced traffic to the site.” Zulily revenue dropped 28% in the fourth quarter. Qurate said it divested Zulily to focus on its core assets, including QVC and HSN. It paid $2.4 billion to acquire Zulily in 2015. In a press release announcing its acquisition, Regent said it planned to grow Zulily’s business in new markets. Regent’s portfolio includes Club Monaco, Dim Paris, and Redline Bicycles. Founded in 2010, Zulily went public in 2013. The company got its start by offering daily deals on products for moms and kids, and later expanded its product selection. Zulily last year hired former Nordstrom exec Terry Boyle as president and CEO."
    },
    {
        "id": "recOsQffIjKWUPwZC",
        "createdTime": "2023-06-09T16:06:58.000Z",
        "Company": "Highspot",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "# Laid Off": 140,
        "%": 0.15,
        "Date": "2023-06-08T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/sales-software-startup-highspot-lays-off-15-of-workforce-its-second-cut-this-year/",
        "$ Raised (mm)": 644,
        "Stage": "Series F",
        "Date Added": "2023-06-09T16:06:58.000Z",
        "Country": "United States",
        "Extracted Article": "Highspot is trimming headcount again. The Seattle-based sales software company confirmed that it laid off 15% of its workforce. The latest layoffs, which affect around 140 employees, follow a separate 10% cut in February. In a statement, Highspot CEO Robert Wahbe said the cuts will accelerate the company’s path to profitability. “As we look ahead, sales enablement budgets are predicted to increase by at least 50% in the next two years and we are the technology leader in the category,” he said in a statement. “Today’s changes position us to invest in growth areas such as product and engineering including generative AI — and build a profitable company that delights our customers worldwide.” Thousands of tech companies have slashed headcount this year amid economic uncertainty, following a period of huge growth during the pandemic. Highspot raised $250 million last year at a $3.5 billion valuation. Its total funding to date is $650 million. Wahbe said the company is “well capitalized” and expects to be cash flow positive next year. The company ranks No. 6 on the GeekWire 200, our ranking of top Pacific Northwest startups. Wahbe founded the company in 2011 with former colleagues Oliver Sharp and David Wortendyke. It sells enterprise software to help make salespeople more efficient, equipping them with technology to improve how they have conversations with prospective buyers, among other features. Customers include giants such as DocuSign, Workday, Siemens, Adobe, and others. Highspot backers include B Capital Group; D1 Capital Partners; ICONIQ Growth; Madrona Venture Group; Salesforce Ventures; Sapphire Ventures; and Tiger Global Management."
    },
    {
        "id": "recYJi7no4fiFj2G0",
        "createdTime": "2023-06-05T20:51:21.000Z",
        "Company": "Flyhomes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "Date": "2023-06-05T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-startup-flyhomes-lays-off-employees-for-third-time-amid-real-estate-headwinds/",
        "$ Raised (mm)": 310,
        "Stage": "Series C",
        "Date Added": "2023-06-05T20:51:21.000Z",
        "Country": "United States",
        "Extracted Article": "Real estate startup Flyhomes is laying off employees for the third time in a year, citing an effort to focus on profitability amid the broader housing market downturn. The Seattle company confirmed the cuts to GeekWire on Monday. A spokesperson declined to provide details on the number of employees affected or an updated headcount. LinkedIn posts from recently laid off employees suggest the cuts impacted operations associates and underwriters. “I will confirm that this extremely difficult decision was necessary for the company to navigate the sustained, challenging real estate market conditions and drive our continued focus toward profitability,” Flyhomes spokesperson Justin O’Neill told GeekWire in an emailed statement. Flyhomes, which helps home-buyers secure purchases with all-cash offers, laid off 20% of its employees in July. The company reduced headcount again in November. It now has about 470 employees, down from about 700 in November, according to LinkedIn. Seattle real estate tech companies including Redfin, Zillow, Loftium, and Inspectify have also trimmed their workforces. U.S. home prices and sales continue to trend downward amid higher mortgage rates and a lack of supply. Pending home sales were down 17% in the four-week period ended May 28; median sale prices were down 1.9%; and new listings were down 23%, according to a recent Redfin report. Many venture-backed startups across various industries are being advised to reduce headcount and extend cash runways to withstand prolonged economic headwinds and slower funding. Venture capital allocated to Seattle-based startups hit a 6-year low in the first quarter. Founded in 2016, Flyhomes offers a suite of mortgage and home-buying services. It offers a Buy Before You Sell program that helps sellers buy and move into their next home before selling their current property. Flyhomes’ reduction comes after the company acquired the host-to-own startup Loftium in February, which included onboarding 11 new employees as part of the deal. The company is led by CEO and co-founder Tushar Garg. It has raised more than $200 million to date, including a $150 million Series C round raised in June 2021. Investors include Norwest Venture Partners, Battery Ventures, Fifth Wall, Camber Creek, Balyasny Asset Management, Andreessen Horowitz, Canvas Partners, and former Zillow Group CEO Spencer Rascoff."
    },
    {
        "id": "rec3GWrWVISODxHqT",
        "createdTime": "2023-05-11T00:12:03.000Z",
        "Company": "Microsoft",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Other",
        "# Laid Off": 158,
        "Date": "2023-05-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/microsoft-cutting-more-jobs-in-seattle-region-beyond-global-layoffs-announced-in-january/",
        "$ Raised (mm)": 1,
        "Stage": "Post-IPO",
        "Date Added": "2023-05-11T00:12:03.000Z",
        "Country": "United States",
        "Extracted Article": "Microsoft is making more cuts to its workforce. The company is slashing 158 jobs in Washington state, where it is headquartered, according to a new filing with the state Employment Security Department (ESD). The layoffs are not part of the 10,000 global layoffs announced by Microsoft on Jan. 18. “Organizational and workforce adjustments are a necessary and regular part of managing our business,” a Microsoft spokesperson said in a statement. “We will continue to prioritize and invest in strategic growth areas for our future and in support of our customers and partners.” The company declined to provide details about additional cuts beyond Washington state, or which areas of the company were affected. More than 2,700 Seattle-area workers were affected by the layoffs announced in January. The company said originally that those layoffs would be made between January and the end of March, the end of the company’s fiscal third quarter. Microsoft is one of numerous tech companies to make layoffs in recent months, including Facebook parent Meta, Amazon, and Salesforce, and many startups. Microsoft is navigating various macroeconomic headwinds, including a pullback in business technology budgets and more cautious customer spending for cloud services and software licenses that drive the bulk of its business. The company told employees Wednesday it is not raising salaries this year, citing a “dynamic economic environment.” Microsoft had 221,000 employees as of June 30 (when it last reported headcount), an increase of 40,000 people or 22% from the same point the prior year. It was the largest annual increase in employment in Microsoft’s history, based on data tracked by GeekWire. Microsoft last month reported revenue of $52.9 billion for its fiscal third quarter, a 7% increase from last year. The company beat analyst expectations of $51 billion. Profits came in at $18.3 billion, up 9%. The 7% revenue increase represents the second straight quarter of single-digit growth. It’s a far cry from 18 months ago, when Microsoft’s year-over-year revenue growth peaked at more than 20% as the company and broader tech economy emerged from the pandemic with a head of steam. Microsoft stock is up 29% this year, and up 15% over the past 12 months. The company ended its fiscal third quarter with $104.4 billion in cash, cash equivalents, and short-term investments."
    },
    {
        "id": "recbguEKozwJk4qbE",
        "createdTime": "2023-04-14T02:59:09.000Z",
        "Company": "Redfin",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "# Laid Off": 201,
        "%": 0.04,
        "Date": "2023-04-11T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/redfin-lays-off-201-employees-as-housing-market-continues-to-retrench/",
        "$ Raised (mm)": 320,
        "Stage": "Post-IPO",
        "Date Added": "2023-04-14T02:59:09.000Z",
        "Country": "United States",
        "Extracted Article": "Redfin laid off 201 employees, or about 4% of its workforce, on Tuesday as it continues to trim expenses in response to the housing downturn and ongoing economic uncertainty. A company spokesperson confirmed the cuts to GeekWire on Wednesday. This is the third time in less than a year the Seattle real estate company has conducted a workforce reduction. “While another layoff is painful, especially for those leaving the company, Redfin must continue to adapt to the current economic climate,” the spokesperson said in a statement. Redfin said last November that it would wind down its home-flipping program RedfinNow and eliminate 862 positions, or 13% of its workforce. That came after an 8% workforce reduction last June. Redfin revenue fell 25% in the fourth quarter after mortgage rates and a sluggish market kept many buyers and sellers on the sidelines. The company also reported a net loss of $61.9 million, compared to $27 million in the year-ago quarter. The layoffs come despite Redfin’s statement in January that the housing market had begun to recover. That report cited increases in the number of users requesting tours and contacting agents to start the home-buying process. The most recent round of cuts will mostly affect workers in the real estate support segment. Laid off employees will receive 10-15 weeks of severance depending on tenure and healthcare coverage for three months, according to the spokesperson. A number of real estate tech companies have laid off employees in Washington state over the last year in response to the market downturn including Zillow, Flyhomes, Compass, and others."
    },
    {
        "id": "reclk7N4CEKG6tIY8",
        "createdTime": "2023-05-31T22:48:16.000Z",
        "Company": "Nori",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Energy",
        "# Laid Off": 10,
        "%": 0.37,
        "Date": "2023-04-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/carbon-removal-startup-nori-lays-off-10-employees-citing-market-concerns/",
        "$ Raised (mm)": 13,
        "Stage": "Unknown",
        "Date Added": "2023-05-31T22:48:16.000Z",
        "Country": "United States",
        "Extracted Article": "Nori, a Seattle startup that sells carbon credits to individuals and businesses to offset carbon emissions, laid off 10 employees last week, co-founder and CEO Paul Gambill confirmed. The cuts represent 37% of Nori’s team, leaving the startup with 17 employees. “This was not done lightly, and, like many companies right now, was done solely for planning for changing market conditions,” Gambill told GeekWire. “I wish we could have kept everyone.” Gambill added that the company has seen it become “more difficult for startups of all types to raise new money over the last few quarters.” But from what he can tell, “the climate industry is holding on the strongest of any of the new major tech industries.” Layoffs have been impacting tech companies large and small for months. Amazon, Microsoft, Meta, Outreach, Convoy, Leafly and numerous other companies in the Seattle region have reduced headcount amid the broader tech industry downturn and ongoing economic uncertainty. Founded in 2017, Nori’s blockchain-based model pays farmers to use verifiable, sustainable practices that store carbon dioxide. Its current focus is selling carbon sequestered in soils via its partnership with Bayer and individual growers. Nori recently launched its Web3 integration by moving the entire marketplace on-chain. Gambill said that makes it simple for any decentralized application “to automatically incorporate carbon removal and give their users the ability to make a difference in reversing climate change.” A Techstars Sustainability Accelerator graduate, Nori raised $7 million in February 2022 in a Series A round led by M13. Toyota Ventures, the VC arm of Toyota, also invested. Previously: As funding and demand align, Nori CEO Paul Gambill is ready to grow his carbon removal startup"
    },
    {
        "id": "recCIVfB5gaA5bAqr",
        "createdTime": "2023-04-04T09:39:11.000Z",
        "Company": "Textio",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Recruiting",
        "# Laid Off": 15,
        "%": 0.12,
        "Date": "2023-04-03T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2020/textio-lays-off-30-amid-covid-19-seattle-startup-hopes-ai-writing-tech-will-aid-job-seekers/",
        "$ Raised (mm)": 42,
        "Stage": "Unknown",
        "Date Added": "2023-04-04T09:39:11.000Z",
        "Country": "United States",
        "Extracted Article": "Textio, the Seattle startup whose augmented writing platform helps companies use language that attracts the right job candidates, laid off 30 employees on Friday, or 20 percent of its team. Co-founder and CEO Kieran Snyder told GeekWire that the reduction was a result of the uncertainty that lies ahead in the wake of the coronavirus pandemic. The cuts leave the company with about 120 employees. Coronavirus Live Updates: The latest COVID-19 developments in Seattle and the world of tech “As we think about what the year ahead looks like, I think there’s a broad shift for us,” Snyder said. “Obviously we make software that helps organizations hire and I’d say that hiring in many places is very, very active and in several other places is slowing down, just in response to the COVID-19.” Snyder referenced the record 3.3 million Americans who filed for unemployment last week and said that part of the 6-year-old startup’s ability to wrap its head around the entire situation will be understanding what it can do to help talented people find jobs. “We’re in a position where we see that we have some technology that can help with the other side of the equation. We’ve been supporting employers for such a long time, there’s some opportunity to support job seekers in this environment,” Snyder said of the desire to quickly implement new features in Textio’s AI-powered natural language processing technology. Job seekers using Textio would be encouraged to better understand how language they use best represents them, their skills and their interests in the job market. It’s about making an effective case personally, in a way that Snyder said companies have had to do for the last five years. Snyder elaborated more in a string of Tweets on Friday: 1 Today we are saying farewell to several incredible people from our @textio team. If you hire them, you’ll be lucky. I’d like to share their stories with you, and will, in their own words, on this thread. &gt;&gt; — Kieran Snyder (@KieranSnyder) March 27, 2020 The desire to act fast, not just to help her own team members, is the right thing to do, Snyder said. But it doesn’t lessen the pain of what she was dealing with on Friday as a company leader. CEO Kieran Snyder and some of the Textio team on stage at the 2019 GeekWire Awards in Seattle. (GeekWire Photo / Kevin Lisota) “It’s painful. How could it be anything other than painful?” she said. “You build a group of people who are passionate about language and culture and impact and improving the state of the world. And those relationships aren’t just about work, people joined Textio because they believed in what Textio was creating. “I think for a lot of people on the team, it isn’t just a job and for me as a leader, they’re not just people on the team,” she added. Snyder and co-founder Jensen Harris launched Textio in 2014 after working on productivity tools at Microsoft. The company raised a $20 million Series B investment round in 2017 and SEC filing from earlier this month noted that the company was raising new funding. Textio was among the startups featured in a recent GeekWire story about how Seattle companies are adjusting to remote work amid the COVID-19 outbreak. And this week they released new features aimed at addressing language bias related to ageism and ableism."
    },
    {
        "id": "rec5VfDIKWc8pmrx7",
        "createdTime": "2023-03-22T23:59:38.000Z",
        "Company": "Expedia",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Travel",
        "Date": "2023-03-21T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/expedia-group-lays-off-workers-as-part-of-strategic-actions/",
        "$ Raised (mm)": 3300,
        "Stage": "Post-IPO",
        "Date Added": "2023-03-22T23:59:38.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recuIKdaSJCARp3S7",
        "createdTime": "2023-03-17T00:24:16.000Z",
        "Company": "Leafly",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "# Laid Off": 40,
        "%": 0.21,
        "Date": "2023-03-16T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/leafly-reportedly-lays-off-employees-for-second-time-in-a-year/",
        "$ Raised (mm)": 71,
        "Stage": "Post-IPO",
        "Date Added": "2023-03-17T00:24:16.000Z",
        "Country": "United States",
        "Extracted Article": "Editor’s note: This story was updated with information from Leafly’s fourth quarter earnings report and an internal email sent from the company’s CEO. Leafly is laying off 40 employees, about 21% of its workforce, as it looks to conserve cash and reach profitability amid various headwinds affecting the cannabis company’s business. The company revealed the news as part of its fourth quarter earnings report. GeekWire reported the cuts earlier Thursday, citing posts from several employees — including a creative lead and vice president of retail sales — who said they were laid off. Leafly previously cut 56 positions, or 21% of its workforce at the time, in October. In an email to employees obtained by GeekWire, Leafly CEO Yoko Miyashita cited reduced advertising spend and “a slower start to 2023 than anticipated.” “Our customers are in belt-tightening mode and that necessarily impacts their spend on Leafly,” she wrote in the memo, which you can read in full below. The company went public last year in a SPAC deal and its stock has lost nearly all of its value since then. Leafly received a letter Oct. 28 from the Nasdaq notifying the company that it did not comply with the $50 million market value minimum required to be listed on the exchange. Nasdaq said Leafly’s market value must be $50 million or more for a minimum of 10 consecutive business days at any time before April 26. The company has a market capitalization of around $20 million and is among Nasdaq’s list of noncompliant companies. “Rationalizing our cost structure, preserving cash, and ensuring sustainability of Leafly as a public company by focusing on improving our path to profitability,” Miyashita wrote in the memo, as part of the company’s current priorities. Leafly’s revenue in Q4 stayed flat year-over-year at $12.1 million, and losses grew slightly to $5.8 million. It ended the quarter with about $25 million in cash. The company’s average monthly users; ending retail accounts; and retailer average revenue per account all fell year-over-year in 2022. Average monthly users came in at 7.96 million for 2022, down 22% from the year prior. Founded in 2010, Leafly’s online marketplace lets customers shop and select cannabis products from licensed retailers. The startup also serves as an educational resource. Its revenue primarily comes from a monthly subscription fee paid by cannabis retailers to be listed on the platform and to access e-commerce tools. Leafly is facing headwinds in the form of decelerating digital ad spend, part of a broader shift by companies to cut costs amid higher interest rates and the tech downturn. Cannabis sales in some regions are declining following a pandemic-driven boost. Sales in Washington state slowed year-over-year in 2022 for the first time since cannabis was legalized. Retail and wholesale prices are also down. Leafly’s average revenue per account in Q4 was $566, down $70 from the year-ago period. The company is reorganizing its sales and content/creative teams to focus on “high-value customers” and create content that drives shopping behavior. Read Miyashita’s full memo below. Dear Team Leafly, We are experiencing times of significant change and uncertainty in the cannabis industry. Over the past several months, we’ve seen our revenue come under additional pressure with a weaker holiday season and a slower start to 2023 than anticipated, as clients reduced their advertising spend. Our customers are in belt-tightening mode and that necessarily impacts their spend on Leafly. This is the broad context under which I share the difficult news that we have decided to make additional headcount reductions that will impact 41 positions – or roughly 21 percent of our current workforce. Those impacted have already received meeting invites to speak with leadership and HR later today – if you have not received a meeting invite by 10:30am PT/1:30pm ET today, your role is not impacted. Transitions like this are very difficult as the impact is felt by our teammates, colleagues, and friends. People we have come to know and partnered with through the ups and downs at Leafly. I fully acknowledge that and I am deeply sorry for the circumstances that have led to this outcome. Leafly is, and will remain, a prominent player in the cannabis space, but to navigate current realities, we must operate differently and become intently grounded in three priorities: Aligning our resources around one common theme: building a stronger marketplace – one that delivers against the need to help consumers identify what to try and buy, then delivers them to the virtual and physical doorsteps of our retail and brand partners; Focusing on the areas of our business that deliver the most near-term revenue; and Rationalizing our cost structure, preserving cash, and ensuring sustainability of Leafly as a public company by focusing on improving our path to profitability. These priorities mean significant changes to certain areas of our business, including to sales and to our content and creative teams. On the sales side, we need to get closer to our most high-value customers, requiring a shift from a broad-based, high-touch model to most clients, to a model that is hyper-focused on deepening relationships and growing spend from our emerging and highest-value clients. As part of this shift, we must align our customer account management, services, and support to be more cost-efficient and in-line with a client’s revenue contribution. These priorities also mean changes to our content and creative teams. Over the past 10+ years, we built from scratch one of the most recognized news and learn sections in the industry, and we now have a rich catalog of thousands of pieces of useful and sought-after cannabis information. At the same time, we are now competing against some of the biggest names in journalism. Under this new reality, we are making an explicit shift to anchor our content strategy directly to the revenue generating aspects of our cannabis marketplace to include more content that drives shopping behavior and creates value for our retailers and brands in the form of more bottom-of-the-funnel sessions and orders. To those who are leaving us: Thank you. Thank you for working so hard to bring the magic of cannabis to countless people and for your contributions to Leafly. We are grateful for you. For those who are continuing forward, we are competing in a tough environment. By making the necessary changes to how we operate, and sustaining this business and one another through a difficult period, I am confident about the opportunity for Leafly ahead. Our partners tell us there is tremendous value in working with Leafly and we should all be proud of the work we have accomplished together and our commitment to serving those partners for many years to come. Yoko"
    },
    {
        "id": "recx7hJp5C7ErkU2n",
        "createdTime": "2023-03-13T20:11:21.000Z",
        "Company": "Neoleukin Therapeutics",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "%": 0.7,
        "Date": "2023-03-09T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/shares-of-neoleukin-therapeutics-spike-after-announcing-layoffs-and-potential-sale-or-merger/",
        "$ Raised (mm)": 157,
        "Stage": "Post-IPO",
        "Date Added": "2023-03-13T20:11:21.000Z",
        "Country": "United States",
        "Extracted Article": "Neoleukin Therapeutics is slashing its workforce by about 70% as it seeks “strategic alternatives” for its future, according to a company statement Wednesday. The publicly traded Seattle biotech company hired investment bank SVB Securities to review potential alternatives including a sale, merger, asset divestiture or licensing. “It was a difficult decision to restructure our workforce as we conduct this review of strategic alternatives; however, we believe it was a prudent decision that will maximize shareholder value,” said board chairman Todd Simpson in the statement. Neoleukin’s stock was up more than 30% in Thursday trading. The company said CEO Jonathan Drachman will also step down after a short transition. Drachman, a former executive at Seagen, led Neoleukin since it spun out of the University of Washington in 2019. The job cuts are expected to be completed by the end of June. The cuts are the second round of layoffs for the company, which announced a 40% workforce reduction in November. Neoleukin currently has 46 employees, according to a spokesperson, down from 77 in September. The November layoffs coincided with a decision by Neoleukin to discontinue development of a computationally designed protein therapeutic being tested in a phase 1 trial. The protein was designed to mimic the powerful immune molecules Interleukin-15 and Interleukin-2 (IL-2). IL-2 can quell cancer but it can also have toxic effects, which Neoleukin’s protein aimed to to minimize. The trial was the first to test a synthesized protein engineered “de novo” from scratch, according to the company. The program was shuttered “based on a review of the preliminary data, the expected benefit to risk ratio for patients, and recent developments in the field of IL-2 therapeutics,” according to a November company statement. Neoleukin shifted its focus to developing other protein therapeutics. In Wednesday’s statement, Simpson cited “challenging capital markets” and the time and investment needed to further develop Neoleukin’s technology as barriers. Multiple other companies are testing IL-2 therapies in the clinic, including Cue Biopharma, Anaveon and Aulos Bioscience. Seattle biotech company Good Therapeutics sold its IL-2 program to Roche for $250 million in September and later rebranded as Bonum Therapeutics. Neoleukin was incubated at the UW’s Institute for Protein Design and merged with another biotech company to go public in August 2019, raising more than $40 million. Neoleukin later raised $86.2 million in a public offering. As of September 30, the company had $106.9 million in cash, cash equivalents and short-term investments. The layoffs are the latest to hit biopharma in Washington state, which has seen workforce cuts at Absci, Zymeworks, TwinStrand Biosciences, NanoString Technologies, Sana Biotechnology, Eliem Therapeutics and others. Last week Novo Nordisk announced it was laying off 86 workers and shutting a lab site in Seattle. More than 40 biotech companies have laid off employees this year, adding to 119 last year, according to Fierce Biotech’s layoff tracker. Novartis and other big pharma companies have also seen workforce cuts."
    },
    {
        "id": "reciaAQLVAw480fr7",
        "createdTime": "2023-03-10T05:22:32.000Z",
        "Company": "Zulily",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "Date": "2023-03-07T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/zulily-lays-off-employees-for-the-second-time-in-a-year-amid-revenue-declines/",
        "$ Raised (mm)": 194,
        "Stage": "Acquired",
        "Date Added": "2023-03-10T05:22:32.000Z",
        "Country": "United States",
        "Extracted Article": "Zulily laid off an undisclosed amount of corporate employees as the Seattle-based online retailer and its parent company Qurate navigate declining revenue. A company spokesperson confirmed the layoffs but declined to provide details on how many positions were impacted or current headcount. “Yesterday, we announced to our team members some hard choices we have made for our organization to bring our operating expenses in line with our revenue and position our business for future growth,” the company said in a statement Tuesday. Laid off workers will receive severance, continuation of some benefits, and outplacement assistance, the spokesperson said. Zulily previously laid off employees in May. The company employs more than 800 people in the Seattle region and nearly 2,000 total, according to LinkedIn. Zulily’s revenue dropped 28% to $254 million in the fourth quarter due to lower unit volume, reduced shipping rates, and lower site traffic, according to the company’s earnings report. Revenue dropped 38% for the full year. Its parent company Qurate Retail Group, which acquired Zulily in 2015, reported a 13% year-over-year revenue decline for the fourth quarter. Qurate last week said it was laying off 12% of its workforce, or 400 people. Those cuts did not impact Zulily. Last year Zulily closed a fulfillment center in Pennsylvania, resulting in more than 500 layoffs. Many e-commerce companies are dealing with slowing growth following online shopping surges during the pandemic. Qurate CEO David Rawlinson called 2022 a “challenging year for the company” and cited “macro pressure that impacted consumer demand.” “We have taken action to strengthen the balance sheet, improve execution and aggressively cut costs, including meaningfully reducing excess inventory and undergoing a structural reorganization,” Rawlinson said in a statement last week, as part of the company’s earnings report. Zulily last year hired former Nordstrom exec Terry Boyle as president and CEO. Boyle replaced Jeff Yurcisin, the former Amazon executive and Shopbop CEO who took over in May 2018 for longtime CEO and co-founder Darrell Cavens. Zulily went public in 2013 and was acquired by Qurate for $2.4 billion in August 2015."
    },
    {
        "id": "rec81Or1SlJbRg6dy",
        "createdTime": "2023-02-28T18:44:40.000Z",
        "Company": "Outreach",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "# Laid Off": 70,
        "%": 0.07,
        "Date": "2023-02-27T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/sales-startup-outreach-to-lay-off-70-employees-7-of-workforce-and-slow-office-expansion/",
        "$ Raised (mm)": 489,
        "Stage": "Series G",
        "Date Added": "2023-02-28T18:44:40.000Z",
        "Country": "United States",
        "Extracted Article": "Outreach is laying off 70 workers, about 7% of its workforce, marking the second round of cuts the Seattle sales software startup has made in the past six months. A company spokesperson confirmed the headcount reduction to GeekWire Monday evening. “Outreach regularly identifies the need to make operational and organizational adjustments to align with our strategic growth plan and path to profitability,” the spokesperson said. In an email to staff, Outreach CEO Manny Medina said the company failed to meet annual recurring revenue targets for its most recent fiscal year. “Even given the reduction in projected spending, we must find other savings in efficiencies and cut deeper,” he said in the email obtained by GeekWire. “In a software company, headcount is one of our greatest costs and, unfortunately, that means more layoffs within our Outreach team.” Outreach will suspend merit increases and the expansion or relocation of offices, Medina wrote in the email. The company laid off 5% of its staff in August. It has about 1,000 employees and offices in Prague, London, Atlanta, and Indianapolis, in addition to the Seattle headquarters. The announcement comes amid a tech slowdown that has affected enterprise sales teams and slowed demand for sales software. Many startups are being advised to lay off employees in an effort to reduce costs and extend cash runways. Outreach is the latest Seattle unicorn to slash positions; others including Karat, Icertis, Rad Power Bikes, Convoy, Qumulo, and Highspot have also conducted layoffs. Medina told GeekWire earlier this month that Outreach sales have taken a hit due to the tech layoffs, as it operates on a per-user basis. However, the tighter spending climate has driven sales reps to rely more heavily on the startup’s tools for buyer qualification, offsetting some of that loss in demand, he added. Outreach, launched in 2014, has more than 5,500 clients including Tableau, Okta and DocuSign. It became a so-called unicorn startup in 2019 when it raised $114 million. It raised two additional fundraising rounds in 2020 and 2021. Outreach recently announced it is testing a new feature called Smart Email Assist, an AI tool powered by OpenAI’s GPT-3 model that spits out a draft email to a potential customer based on prior exchanges between the buyer and seller. The startup is backed by Sands Capital, Salesforce Ventures, Operator Collective, Lone Pine Capital, Spark Capital, Meritech Capital Partners, Trinity Ventures, Mayfield, and Sapphire Ventures. Outreach, ranked No. 3 on the GeekWire 200, has been gearing up for a public offering."
    },
    {
        "id": "rec9Q92ObTJQCvWA3",
        "createdTime": "2023-02-03T03:19:58.000Z",
        "Company": "Highspot",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Sales",
        "# Laid Off": 100,
        "%": 0.1,
        "Date": "2023-02-02T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/sales-software-company-highspot-lays-off-100-employees/",
        "$ Raised (mm)": 644,
        "Stage": "Series F",
        "Date Added": "2023-02-03T03:19:58.000Z",
        "Country": "United States",
        "Extracted Article": "Highspot is laying off about 100 employees, or 10% of its workforce, becoming the latest well-funded Seattle company to cut employees in response to economic uncertainity. “We must confront the economic reality and reduce headcount to steward our company to operate more efficiently while continuing to invest in strategic areas, such as artificial intelligence, product innovation, and global expansion,” Highspot CEO Robert Wahbe said in a statement. A Highspot spokesperson said the cuts will impact all departments. The company now has 950 employees. Many startups are being advised to lay off employees in an effort to reduce costs and extend their cash runways. Highspot is the latest Seattle unicorn to slash positions, joining Karat, Icertis, Rad Power Bikes, Convoy, Qumulo, and others. In one of the largest funding deals in the Pacific Northwest last year, Highspot raised $250 million, pushing its valuation to $3.5 billion. Its total funding to date is $650 million. RELATED: A list of the latest layoffs in the Pacific Northwest The company ranks No. 6 on the GeekWire 200, our ranking of top Pacific Northwest startups. The spokesperson said the reduction in force will help Highspot make new investments, such as its expansion in Canada. The startup has five offices outside the U.S., in addition to its Seattle HQ. Wahbe founded the company in 2011 with former colleagues Oliver Sharp and David Wortendyke. It sells enterprise software to help make salespeople more efficient, equipping them with technology to improve how they have conversations with prospective buyers, among other features. Customers include giants such as DocuSign, Workday, Siemens, Adobe, and others. Highspot backers include B Capital Group; D1 Capital Partners; ICONIQ Growth; Madrona Venture Group; Salesforce Ventures; Sapphire Ventures; and Tiger Global Management."
    },
    {
        "id": "recvHuMA6HGizSIze",
        "createdTime": "2023-02-22T02:54:40.000Z",
        "Company": "Picnic",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Food",
        "Date": "2023-02-01T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/picnic-a-food-automation-startup-that-sells-a-pizza-making-robot-lays-off-employees/",
        "$ Raised (mm)": 52,
        "Stage": "Unknown",
        "Date Added": "2023-02-22T02:54:40.000Z",
        "Country": "United States",
        "Extracted Article": "Food automation startup Picnic is laying off employees, becoming the latest tech company to trim staff amid the tech downturn. Picnic CEO Clayton Wood. (Picnic Photo) A company spokesperson confirmed the cuts to GeekWire Wednesday. The Seattle startup did not provide an updated headcount, or information on which positions are being affected. It has around 100 employees, according to LinkedIn. “Due to the current economic environment, we have had to make the difficult decision to reduce our company size and say goodbye to some colleagues,” Picnic CEO Clayton Wood wrote in a LinkedIn post Wednesday. Startups are being advised to reduce headcount in an effort to lower costs and extend cash runways. There have been thousands of layoffs at tech companies in the Pacific Northwest over the past two months. Picnic, founded in 2016, has raised more than $20 million to sell food assembly robots to restaurants and hospitality companies around the world. The food-automation company sells a pizza-making robot called the Picnic Pizza Station. The machine can help a single employee churn out up to 100 12-inch customized pizzas per hour. Picnic announced a partnership with pizza giant Dominos in September. It also works with Ole Miss, The Ohio State University, and a number of regional pizza restaurants and automation partners across the country. Wood said the layoffs will not affect these partnerships and that the company has installations planned across the U.S. and Canada. “Until the economic situation improves, we’re slimming down and running as efficiently as possible without impacting our mission or our core business,” he wrote."
    },
    {
        "id": "rec18DBRSpZVLpqjY",
        "createdTime": "2023-01-21T22:39:15.000Z",
        "Company": "Karat",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "HR",
        "# Laid Off": 47,
        "Date": "2023-01-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/seattle-technical-interviewing-startup-karat-cuts-47-employees-citing-need-to-invest-in-growth/",
        "$ Raised (mm)": 169,
        "Stage": "Unknown",
        "Date Added": "2023-01-21T22:39:15.000Z",
        "Country": "United States",
        "Extracted Article": "Karat, the Seattle-based startup that helps companies conduct technical interviews, has laid off 47 employees, citing the need to sharpen its business focus as it continues to grow. “We are very intentionally focused on expanding our enterprise customer base, growing our footprint in India, scaling Brilliant Black Minds, and building new products,” a Karat spokesperson said via email on Friday. “We are self-funding these areas of investment, and doing so required us to restructure several teams.” Karat employed close to 200 people in October 2021 when the startup raised a $110 million Series C round and reached “unicorn” status with a $1.1 billion valuation. A LinkedIn search on Friday listed 423 employees, but Karat declined to say how many people remain at the company. RELATED COMMENTARY: Washington state’s tech industry will continue to grow, despite layoffs “These teammates were integral to growing Karat into the successful company it is today, and we are incredibly grateful to them,” the spokesperson added. “We have provided them with comprehensive exit packages, and we will do all we can to support their transitions.” Founded in 2014, Karat is led by Mo Bhende, a former director for Xbox at Microsoft, and co-founder Jeff Spector, who previously was chief of staff to Melinda French Gates at the Bill &amp; Melinda Gates Foundation. The startup uses a network of vetted interviewers who run the interviews via video conference, using a question format and scoring rubric based on research and analysis done by Karat. Companies receive feedback on the top qualified applicants, based on Karat’s diligence, as well as insights about their hiring process. The idea is to help companies screen more candidates while freeing up their own employees from interviewing responsibilities. Its software is used by tech companies such as Compass, Intuit, and Indeed, and others including Ford, American Express, and Bank of America that need help interviewing engineers. Karat’s Brilliant Black Minds uses Karat’s Interviewing Cloud to deliver free interview practice, feedback, and coaching to help aspiring Black software engineers prepare to successfully enter the tech industry. Tennis star Serena Williams invested in the startup last April."
    },
    {
        "id": "recJkrhtqF1Wdnys3",
        "createdTime": "2023-01-21T22:40:13.000Z",
        "Company": "Edifecs",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 30,
        "Date": "2023-01-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/edifecs-lays-off-30-employees-in-the-u-s/",
        "$ Raised (mm)": 1,
        "Stage": "Unknown",
        "Date Added": "2023-01-21T22:40:13.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recRUmx3UBV6Ot6lN",
        "createdTime": "2023-01-21T22:38:30.000Z",
        "Company": "Avalara",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Finance",
        "Date": "2023-01-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/tax-software-giant-avalara-reportedly-lays-off-workers/",
        "$ Raised (mm)": 341,
        "Stage": "Acquired",
        "Date Added": "2023-01-21T22:38:30.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "rec6eNBWhesS50IyP",
        "createdTime": "2023-01-12T15:16:36.000Z",
        "Company": "Limeade",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "HR",
        "%": 0.15,
        "Date": "2023-01-11T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/employee-experience-company-limeade-laying-off-15-of-workforce-cfo-to-resign/",
        "$ Raised (mm)": 33,
        "Stage": "Series C",
        "Date Added": "2023-01-12T15:16:36.000Z",
        "Country": "United States",
        "Extracted Article": "Content not found."
    },
    {
        "id": "recZd0fPxRx3sEqlC",
        "createdTime": "2023-01-12T15:06:42.000Z",
        "Company": "Esper",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Other",
        "%": 0.21,
        "Date": "2023-01-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2023/esper-lays-off-21-of-workforce-due-to-unpredictable-business-environment-in-2023/",
        "$ Raised (mm)": 10,
        "Stage": "Series A",
        "Date Added": "2023-01-12T15:06:42.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle startup Esper laid off employees for the second time in seven months, cutting 21% of its workforce in the latest round of layoffs. The cuts are part of a “company restructuring,” according to a statement shared with GeekWire. “Despite strong customer and revenue growth in 2022, we felt it necessary to optimize the efficiency of the company’s operating costs, given the unpredictable business environment in 2023,” the company said in its statement. Esper laid off 12% of its staff in June. The startup operates a DevOps platform for customers that manage fleets of company-owned Android devices. Esper has around 260 employees, according to LinkedIn, and employed 150 people when it raised a $60 million Series C round in October 2021. Layoffs continue to hit the tech industry amid an uncertain economic environment. Amazon confirmed this month that it’s slashing 18,000 corporate and tech employees; Salesforce is cutting 10% of its workforce, impacting Seattle-based Tableau; while Seattle startups such as Rad Power Bikes, OfferUp, Flyhomes, and others have also reduced headcount. Founded in 2018 by Microsoft vets Yadhu Gopalan and Shiv Sundar, Esper helps companies with development, deployment, and maintenance of devices used across industries such as healthcare, education, retail, restaurants, and more. The idea is to beef up traditional mobile device management (MDM) software with modern DevOps capabilities. Insight Partners led Esper’s Series C round, which came shortly after the company raised a $30 million Series B round in May 2021. Other backers include Scale Ventures, Madrona Venture Group, and Root Ventures. Total funding to date is $100 million."
    },
    {
        "id": "rec198FXLlgb2Hpcd",
        "createdTime": "2022-11-17T00:19:49.000Z",
        "Company": "OfferUp",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "%": 0.19,
        "Date": "2022-11-15T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/more-tech-layoffs-hit-seattle-region-as-mobile-marketplace-offerup-cuts-19-of-workforce/",
        "$ Raised (mm)": 381,
        "Stage": "Unknown",
        "Date Added": "2022-11-17T00:19:49.000Z",
        "Country": "United States",
        "Extracted Article": "Bellevue, Wash.-based mobile marketplace operator OfferUp is laying off about 19% of its staff, joining a growing list of tech companies slashing costs amid a shaky economy. “We grew headcount rapidly over the past few years — at a rate that outpaced revenue growth,” OfferUp CEO Todd Dunlap wrote in an email to employees Tuesday. OfferUp did not provide details on total headcount. The company has just shy of 500 employees listed on LinkedIn. Nearly 800 tech companies have laid off workers in 2022, including many with a presence in the Pacific Northwest. Amazon is reportedly laying off 10,000 corporate and tech jobs; Seattle-area startups such as Convoy and Flyhomes also recently announced cuts. OfferUp still had “multiple years of runway” before deciding to cut staff, Dunlap wrote in the memo. But OfferUp is not hitting its revenue growth projections for 2022 and leadership concluded that “our current cost structure is preventing us from achieving our goals.” Dunlap, a former leader at Microsoft and Booking.com, took the CEO reins at OfferUp last year. He replaced founder Nick Huzar, who remains at the company as a board director. Founded in 2011, OfferUp competes against Craigslist, eBay, Facebook and other marketplaces where users buy and sell goods. The company has 56 million buyers and sellers on its platform and is currently ranked No. 6 on the GeekWire 200, our index of Pacific Northwest startups. OfferUp raised $120 million in March 2020 and acquired rival Letgo. The company is among an elite group of Seattle-area unicorns with a valuation of more than $1 billion. Earlier this year OfferUp added job listings with the launch of OfferUp Jobs in the company’s mobile app. Read Dunlap’s full memo below: OfferUp Team: Today is a difficult day for OfferUp and its employees, as I just met with some of our friends and colleagues to let them know that they are leaving OfferUp. This was a tough decision and it will have significant impacts on the people who are leaving, those who are staying, and the Company, so I wanted to take a few minutes to share with you the reasons for the decision and why I think it is necessary for OfferUp’s long-term success. Before I talk about the future, I want to acknowledge our colleagues who are leaving. They are valued contributors to OfferUp who had the misfortune to be in roles that are not required for our 2023 plans. We will miss them and I encourage you to reach out to them. I want you to know that we are doing everything we can to ease this transition. For those who are leaving today, we are offering: Severance – We wanted our colleagues to have pay through the holidays and into the new year, so all departing employees will receive at least 8 weeks of pay. Healthcare – To lessen the burden of healthcare costs, we will cover the employee portion of COBRA through January 2023. Outplacement Services – To help our departing colleagues transition into new roles, all of them will have access to career services through a company that specializes in career transition and job placement services. Stock Options – To give everyone a better opportunity to share in our future success, we are asking the Board to approve an extension of the expiration of departing employees’ vested stock options from the standard 3 months to 12 months. Laptops – In an effort to empower people to find their next job, we are allowing everyone to keep their OfferUp-issued computers at no cost. We wish our colleagues well and we hope to cross paths with them again in the future. Please join me in thanking them for their contributions to OfferUp. Now I’d like to talk about how we came to this decision. Many other companies at our stage are currently laying off employees and cutting costs because they face the possibility of going out of business if they don’t. Fortunately, we are not in that position and had multiple years of runway before the changes today. Having a stronger financial position is a benefit, but it can also allow leadership to avoid hard choices that are necessary. We grew headcount rapidly over the past few years – at a rate that outpaced revenue growth. I had hoped that our 2022 operating plan would generate enough revenue growth to allow us to grow into our current cost structure. However, by mid-year, it became clear that we would miss our revenue growth projections. The management team and the Board had a number of strategic discussions, both internally and with advisors, about how to proceed. These conversations always ended with the same conclusion – our current cost structure is preventing us from achieving our goals. We have built a large and active marketplace that serves tens of millions of users every month, but we’re not yet at a revenue scale that allows us to thrive without continued growth. At our stage, we need to demonstrate at least 2 or 3 of the following factors: Significant user growth, Significant revenue growth, Profitability, and Expansion of our market opportunity that will allow us to sustain growth and profitability well into the future. Our cost structure has not allowed us to make as much progress on these factors as we should have. As one example, to save expenses, we’ve mostly relied on organic growth in recent years. We spent a fraction of what other marketplaces spend on marketing, missing the opportunity to further raise awareness of OfferUp. Successful marketing tests earlier this year and increasing revenue per user give us some signal that we can spend more to bring users onto our platform in a manner that will be sustainable and profitable. However, that investment was not possible with our cost structure. There are other ways that we hope to do more by shifting our spending that I will share as we discuss more over the coming weeks. I am enthusiastic about the 2023 plan we just previewed with the Board, and I look forward to sharing details with all of you in the coming weeks. This is a plan that is both attainable and exciting, and it is only possible because of the additional capital available as a result of today’s decision. With a leaner, nimbler Company in 2023, we intend to: Develop features for our advertising products that will allow us to better monetize our marketplace activity – ideally in a way that improves the experience for both advertisers and users. Continue to expand our offerings into adjacent spaces – most notably by building on the early success of the jobs marketplace we launched this year. We’ve seen really strong signals in this effort and we think it can be a big part of the future of OfferUp and open the door to additional expansion opportunities. Significantly increase our user growth marketing investment to drive additional users, revenue, and profit. Offer additional tools and services to help the numerous sellers on our platform who are already successfully using OfferUp to enable their own business – whether they be a local merchant, a regional retail chain, or an individual making extra cash as a “side hustle”. Continue investment in the trust and safety initiatives that have made OfferUp the safest, most trusted local marketplace. Become EBITDA profitable by Q4 2023. Our 2023 plan is very focused on our best opportunities. If we achieve these plans, we will have many more options than we have today. It’s important that everyone who continues with OfferUp has the opportunity to benefit from those increased options, so I’ll be sharing some plans we have to share Company success with each of you. The leadership team will host a town hall discussion and listening session this Friday. More details on where to submit your questions for the town hall will come later today. I want to close by thanking you for your continued support of OfferUp and assuring you that I will do all I can to make sure that support is appropriately rewarded. For those of you who don’t have any urgent tasks today, please feel free to take the rest of the day to process today’s news. Todd Lost a job? Need help finding work? GeekWire’s new recruiting service, GeekWork, can help. Reach out to GeekWork managing director Jason Greer to learn more on how we connect technical talent to amazing job opportunities. Contact: jason@geekwire.com."
    },
    {
        "id": "recq1NWC1gTJWqbas",
        "createdTime": "2022-11-10T00:52:16.000Z",
        "Company": "Flyhomes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "# Laid Off": 300,
        "%": 0.4,
        "Date": "2022-11-09T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/flyhomes-does-another-round-of-layoffs-as-housing-market-hurts-real-estate-tech-companies/",
        "$ Raised (mm)": 310,
        "Stage": "Series C",
        "Date Added": "2022-11-10T00:52:16.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle real estate startup Flyhomes is laying off employees for the second time in five months. “Building the world’s best home buying and selling experience can only happen if we continue to adapt to the rapidly shifting market conditions, and take the necessary, albeit painful steps, to preserve capital through uncertain economic conditions to ensure the long term trajectory of the company,” the company wrote on LinkedIn. “The reality is, the housing sector is now in a recession, and the latest reports show that the market is expected to continue cooling for longer than anyone initially predicted.” A spokesperson declined to provide details on the number of cuts or total headcount. Update: Tracy Adamo, a director at the company who was laid off, wrote on LinkedIn that nearly 40% of the workforce was cut. The company laid off approximately 20% of its staff in July. It has around 700 employees, according to LinkedIn. Real estate tech companies are looking to cut costs amid a slowing housing market and rising interest rates, as well as broader economic uncertainty. Redfin announced it was laying off 13% of its workforce Wednesday. Redfin CEO Glenn Kelman said the market in 2023 “is likely to be 30% smaller than it was in 2021.” Founded in 2016, Flyhomes helps people buy homes using a cash offer program which presents customers as the equivalent of cash buyers. The startup also offers mortgage services and has a Buy Before You Sell program that helps sellers buy and move into their next home before selling their current property. Flyhomes has helped customers buy more than $3 billion worth of homes. The company is led by CEO and co-founder Tushar Garg. It has raised more than $200 million to date, including a $150 million Series C round raised in June 2021. Investors include Norwest Venture Partners, Battery Ventures, Fifth Wall, Camber Creek, Balyasny Asset Management, Andreessen Horowitz, Canvas Partners, and former Zillow Group CEO Spencer Rascoff. Lost a job? Need help finding work? GeekWire’s new recruiting service, GeekWork, can help. Reach out to GeekWork managing director Jason Greer to learn more on how we connect technical talent to amazing job opportunities. Contact: jason@geekwire.com."
    },
    {
        "id": "rec4SuNt4cJ65gj4l",
        "createdTime": "2023-01-11T01:02:40.000Z",
        "Company": "Amazon",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "# Laid Off": 150,
        "Date": "2022-10-28T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/amazon-makes-staff-cuts-at-amp-the-app-it-launched-this-year-to-reimagine-radio/",
        "$ Raised (mm)": 108,
        "Stage": "Post-IPO",
        "Date Added": "2023-01-11T01:02:40.000Z",
        "Country": "United States",
        "Extracted Article": "Amazon’s plan to “reimagine radio” has run into a bit of static as the company is making staff cuts at Amp, the app it launched earlier this year. Business Insider first reported the news on Friday and said “roughly 150 people,” or half of the division, were let go. Amazon would not comment on any figures when contacted by GeekWire. “At Amazon we think big, experiment, and invest in new ideas to delight customers,” an Amazon spokesperson said in an emailed statement. “We also continually evaluate the progress and potential of our products and services to deliver customer value, and we regularly make adjustments based on those assessments. Following a recent review, we’ve made the decision to consolidate a few teams so we can focus on the growth and scaling of Amp.” Amazon is working with affected employees to identify other internal job opportunities. The company first revealed the new iOS app in beta in March, touting Amp as a way to give DJs their own live radio shows complete with a catalog of millions of licensed songs and the ability to engage with callers. “A person with their own unique music taste doesn’t have to land a job at a radio station to reach an audience,” Amp VP John Ciancutti said in March. “They just need to launch a show from their phone on Amp and reach anyone.” Fast forward seven months, where Thursday the tech giant saw its shares get hammered after it issued lower-than-expected guidance for the holiday quarter. Amazon is joining other tech companies taking steps to counter macroeconomic headwinds. The company has already slowed its hiring pace. During a third quarter earnings call on Thursday, CFO Brian Olsavsky said Amazon is preparing for “what could be a slower growth period” due to increased foreign currency headwinds, global inflation, heightened fuel prices, and rising energy costs. To help mitigate slowing sales, Olsavsky said Amazon is “taking actions to tighten our belt,” including pausing hiring in certain businesses and shutting down products and services. “We’re going to be very careful on our hiring,” he said."
    },
    {
        "id": "rechHdoh4aXzJTSb9",
        "createdTime": "2022-10-31T15:28:43.000Z",
        "Company": "Advata",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 32,
        "%": 0.21,
        "Date": "2022-10-28T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-area-health-data-analytics-company-advata-lays-off-employees/",
        "Date Added": "2022-10-31T15:28:43.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-area health data analytics provider Advata, recently formed from the merger of six companies, is the latest tech company in Seattle to lay off employees. Advata laid off 32 workers yesterday, according to a statement from the company provided to GeekWire. Advata employed about 150 people in June, when it launched from the merger of six companies owned by Renton, Wash.-based healthcare giant Providence. “We are sincerely grateful for everyone’s contributions and extremely sad to see any of our team members depart from the Company,” said CEO Julie Rezek in an email to employees, a portion of which was provided to GeekWire. Several Seattle-area startups have laid off employees this year amid the broader economic slowdown and the decline in venture capital funding. Amazon, Microsoft, and other tech giants which grew headcount rapidly during the pandemic, are also cutting staff or slowing hiring. Advata was formed from Kensci, Colburn Hill Group, Alphalytics, Lumedic, Quiviq, and MultiScale by Providence. Software from each company integrated into Advata, which sells products for revenue cycle management, as well as population health tools. These tools, bolstered by artificial intelligence, aim to improve patient experiences, workflows, and accuracy of diagnoses. The independently operated company’s customers include Providence and other healthcare providers, as well as insurance and medical device companies. In September, Advata introduced a new revenue cycle management tool for healthcare providers that automates processing and advises staff on recommended actions. The company said the tool can enable teams to increase cash collections by as much as 1%. Lost a job? Need help finding work? GeekWire’s new recruiting service, GeekWork, can help. Reach out to GeekWork managing director Jason Greer to learn more on how we connect technical talent to amazing job opportunities. Contact: jason@geekwire.com."
    },
    {
        "id": "recWuq2J3N6DieJlf",
        "createdTime": "2022-10-25T15:13:12.000Z",
        "Company": "Convoy",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "Date": "2022-10-25T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/convoy-lays-off-more-employees-as-part-of-reorganization-at-seattle-trucking-startup/",
        "$ Raised (mm)": 1100,
        "Stage": "Series E",
        "Date Added": "2022-10-25T15:13:12.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based trucking marketplace startup Convoy is doing another round of layoffs. It’s the latest tech company to trim headcount amid ongoing economic uncertainty and the possibility of a recession. In an email to staff, Convoy CEO Dan Lewis described a “reorganization and resource realignment.” He said Convoy’s customers are facing external pressures including supply chain shortages and inflation. “In an environment like this, companies that embrace change as the new normal and build resilience will be the winners in the years to come,” Lewis wrote. “Just as we need to embrace change and stay ever resilient, our customers are looking for partners to help them do so as well.” A Convoy spokesperson declined to provide details about the number of employees laid off. Several workers based in Seattle and Atlanta posted on LinkedIn on Monday, reporting that they were let go. Earlier this summer, Convoy cut 7% of its workforce. The company said it employed 1,300 people in April, when it raised a $260 million investment round at a $3.8 billion valuation, so those layoffs affected around 90 employees. Founded in 2015 and backed by the likes of Bill Gates and Jeff Bezos, Convoy’s software automates transactions between trucking companies and shippers. Its network has more than 400,000 trucks and a roster of shippers including Home Depot, Procter &amp; Gamble, Unilever, and Anheuser-Busch. The company, ranked No. 4 on the GeekWire 200 list of top Pacific Northwest startups, said in April it expected to surpass $1 billion in revenue this year. Convoy competes with a number of similar digital-focused shipping companies including Uber Freight, in addition to traditional brokers investing in their own technology. They are battling for a share of a $800 billion U.S. trucking industry. Convoy Chief Growth Officer Ryan Gavin. (Convoy Photo) In his email to staff, Lewis said the company is reorganizing its shipper-facing business function into a single organization led by Ryan Gavin, chief growth officer, who joined in 2019 after stints with Amazon and Microsoft. The company’s chief revenue officer, Melissa McCann-Tilton, will transition to advisor to the president and CEO and then depart Convoy at the end of this year. Lewis and Grant Goodale both worked at Amazon before launching Convoy. Goodale transitioned from the CTO role to chief experience officer last year. Convoy hired former Expedia CEO Mark Okerstrom as president and COO in 2020. A number of tech companies are laying off workers. Microsoft confirmed it was making cuts last week, as did application security and delivery giant F5, which cut about 100 jobs. Tech giants including Snap and Oracle have cut staff and others such as Meta and Apple are slowing or freezing hiring. Other Seattle-area companies including T-Mobile, Compass, Leafly and DreamBox Learning have recently been impacted by layoffs. Lost a job? Need help finding work? GeekWire’s new recruiting service, GeekWork, can help. Reach out to GeekWork managing director Jason Greer to learn more on how we connect technical talent to amazing job opportunities. Contact: jason@geekwire.com."
    },
    {
        "id": "rec7811bKOEpEY5HK",
        "createdTime": "2022-11-17T04:21:12.000Z",
        "Company": "F5",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Security",
        "# Laid Off": 100,
        "%": 0.01,
        "Date": "2022-10-21T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/f5-cutting-fewer-than-100-jobs-due-to-current-macroeconomic-environment/",
        "Stage": "Post-IPO",
        "Date Added": "2022-11-17T04:21:12.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based application security and delivery giant F5 is the latest tech company to lay off employees. The company confirmed Friday that it’s cutting about 100 roles, or about 1% of its global workforce. F5 has approximately 6,900 employees. “We are continuously evaluating how to focus our resources to best meet the needs of our customers, while also being disciplined about our investment priorities,” an F5 spokesperson said in an email to GeekWire. “Given the current macroeconomic environment, this week we announced changes internally that resulted in the elimination of a number of positions across the company.” The company said it will continue to hire in targeted areas. The layoffs come amid an economic downturn that is impacting a number of tech companies. Microsoft confirmed it was making cuts this week. Tech giants including Snap and Oracle have cut staff and others such as Meta and Apple are slowing or freezing hiring. Others including T-Mobile, Compass, Leafly and DreamBox Learning have recently been impacted by layoffs. F5 beat expectations for its third fiscal quarter in July, reporting $674 million in revenue, up 4% year-over-year, and non-GAAP earnings per share of $2.57, slightly down from the year-ago period. The company will report its fourth quarter and fiscal year 2022 financial results next Tuesday. F5 has expanded further into software and services in recent years with the acquisition of companies including Nginx for $670 million; Shape Security for $1 billion; Volterra for $500 million; and Threat Stack for $68 million. Lost a job? Need help finding work? GeekWire’s new recruiting service, GeekWork, can help. Reach out to GeekWork managing director Jason Greer to learn more on how we connect technical talent to amazing job opportunities. Contact: jason@geekwire.com."
    },
    {
        "id": "recNRatUrx6xr6LQ0",
        "createdTime": "2022-09-21T04:05:36.000Z",
        "Company": "Compass",
        "Location HQ": [
            "New York City"
        ],
        "Industry": "Real Estate",
        "# Laid Off": 271,
        "Date": "2022-09-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/real-estate-giant-compass-lays-off-84-workers-in-washington-state-as-it-targets-tech-team-for-cuts/",
        "$ Raised (mm)": 1600,
        "Stage": "Post-IPO",
        "Date Added": "2022-09-21T04:05:36.000Z",
        "Country": "United States",
        "Extracted Article": "New York-based real estate brokerage Compass has laid off 84 employees based in Washington state as part of a reduction that largely targets the company’s technology workforce. In a filing with the U.S. Securities and Exchange Commission on Tuesday, Compass said a significant portion of its cuts in headcount would come from the company’s product and engineering team. A Worker Adjustment and Retraining Notification from the Washington state Employment Security Department on Wednesday put the number at 271 workers, with 84 “local” and 187 “virtual.” A Compass spokesperson said “virtual” employees were remote or spread across the country, but have to be assigned a location, so the Compass system considers them Washington employees. Amid a cooling U.S. housing market driven by increased mortgage rates, Compass previously stated in an Aug. 15 earnings call that it would be cutting costs in order to achieve profitability in 2023. Seattle-based Redfin also made cuts this summer, laying off 8% of its workforce to address to the housing downturn. LAYOFF TRACKER: A regularly updated list of layoffs in Seattle and the Pacific Northwest in 2022. In an email to Compass agents on Tuesday, founder and CEO Robert Reffkin said the company was fortunate to be able to reduce costs while still investing more than any other company in the real estate industry. “For example, the biggest reduction came from the technology team, however, our technology team is still over 700 people strong and likely larger than every traditional brokerage company’s tech team combined,” Reffkin wrote. Founded in 2012, heavily funded Compass made a splash in 2019 when it cut the ribbon on a West Coast engineering hub in Seattle, right in Amazon’s backyard. Reffkin said at the time that big companies like Amazon, Microsoft and the engineering hubs of Facebook and Google that are set up in Seattle drew Compass to the city. “A lot of big companies have enough people that want to be part of transforming a new industry,” Reffkin said. In March 2020, Compass laid off about 375 employees due to the onset of the COVID-19 pandemic. Seven months later, Compass acquired Modus, a Seattle startup that automated the title and escrow phase of closing on a home. After raising more than $1.5 billion from investors, Compass raised another $450 million when it went public in April 2021. The company posted a loss of $494 million that year. This past June, it shut down Modus, as it began its cost-cutting moves. The company laid off 450 workers, or 10% of its total workforce."
    },
    {
        "id": "recNiouMCOy10SGkN",
        "createdTime": "2022-09-09T23:47:42.000Z",
        "Company": "DreamBox Learning",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Education",
        "Date": "2022-09-09T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/dreambox-learning-hit-by-layoffs-but-promises-strategy-to-take-on-troubling-trends-in-education/",
        "$ Raised (mm)": 175,
        "Stage": "Acquired",
        "Date Added": "2022-09-09T23:47:42.000Z",
        "Country": "United States",
        "Extracted Article": "DreamBox Learning laid off an undisclosed number of employees this week, citing the need for a “realignment” at the Seattle-area education technology company. Founded in 2006, DreamBox sells software to K-12 schools. The company’s technology adapts to individual students based on their answers and how they solve problems. Teachers and administrators get access to analytics and reporting. DreamBox says its products support 6 million students and 400,000 educators.s DreamBox employed 400 people as of last November, but the company would not say how many employees were impacted by layoffs or provide a current workforce total. Posts on LinkedIn by some former employees referenced a “large” and “unexpected” reduction in force. The layoffs come almost a year after the company sold a majority stake to Evergreen Coast Capital Corp., a tech-focused Silicon Valley affiliate of private equity firm Elliott Investment Management. “The recent realignment requires important strategic choices now that impact some employees,” DreamBox said in a statement provided to GeekWire. “Our leadership and investors agree that these changes effectively position DreamBox for long-term growth and sustainability, which enables us to continue to pursue a future in which all students have equal opportunity to achieve their highest potential in learning and in life.” DreamBox, led by President and CEO Jessie Woolley-Wilson, is one of many ed-tech startups that attracted attention during the pandemic and the shift to remote learning. But the layoffs reflect a tumultuous time in education. A survey earlier this year by National Education Association found that 55 percent of educators are thinking about leaving the profession earlier than they had planned. In August, The New York Times reported on staffing shortages affecting public schools across the country and inequities worsened by the pandemic. In DreamBox’s own backyard, a strike delayed the start of the new school year as Seattle Public Schools teachers and staff walked out over issues including pay and staff-to-student ratios for special education and multilingual students. Furthermore, troubling numbers have emerged from the pandemic, showing the worst drop in math and reading scores in decades for students in fourth grade. The Wall Street Journal reported that the “test scores indicate a learning deficit that could resonate for years and weigh on economic output.” LAYOFF TRACKER: A regularly updated list of layoffs in Seattle and the Pacific Northwest in 2022. DreamBox referenced the turmoil in its statement to GeekWire, saying that the solutions that it provides are needed now more than ever to reverse “troubling trends in learning.” “As district strategies are reshaped by unprecedented forces of change, DreamBox will continue to adapt how it partners with administrators to support all students and educators and intentionally evolve its own growth strategy and priorities,” the company said. TPG’s The Rise Fund, a social impact VC, invested $130 million in DreamBox three years ago. The company previously raised $14.5 million in 2013 and raised a $10 million Series B round in 2015. DreamBox was targeting 40% growth and annual revenue of more than $100 million last year."
    },
    {
        "id": "rec3IHe8QkaZiaMNy",
        "createdTime": "2022-08-22T15:19:19.000Z",
        "Company": "Amperity",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Marketing",
        "# Laid Off": 13,
        "%": 0.03,
        "Date": "2022-08-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-customer-intelligence-startup-amperity-lays-off-recruiting-staff/",
        "$ Raised (mm)": 187,
        "Stage": "Series D",
        "Date Added": "2022-08-22T15:19:19.000Z",
        "Country": "United States",
        "Extracted Article": "Amperity this week joined a growing list of Seattle startups that are trimming headcount. The customer intelligence company laid off 13 employees, or about 3% of its staff, a spokesperson confirmed to GeekWire. The company employs 375 people and plans to hire an additional 25 across the organization. “At Amperity, we are constantly monitoring our business to ensure there is alignment across the organization to support our strategic growth plans,” Amperity CEO Barry Padgett said in a statement Friday. “Today, we made the very difficult decision to eliminate thirteen roles primarily on our talent acquisition team. We are, however, continuing to hire and invest in specific areas of the business to help us execute on our growth strategy.” Tech companies have been laying off employees and slowing hiring in an effort to cut expenses amid uncertain economic conditions. Other Seattle-area tech startups including Flyhomes, Shelf Engine, Convoy, Outreach, Qumulo, and Esper have laid off employees in recent months. Founded in 2016, Amperity’s software lets companies fine-tune their targeted marketing campaigns by connecting fragmented data sources about individual customer habits via emails, purchase history, mobile app usage, website traffic, physical store visits, etc. The idea is to give marketers a holistic understanding of a given user and increase sales while driving brand loyalty. Amperity earned “unicorn” status in July 2021, reaching a $1 billion valuation after raising $100 million. The company’s co-founder Kabir Shahani stepped down as CEO and a board member earlier this year, with no public explanation. Padgett, who was previously president and COO, has been CEO since February of this year. He is a veteran of Concur Technologies and former chief revenue officer at Stripe. Derek Slager, who co-founded Amperity with Shahani, remains at the company as CTO. Shahani and Slager previously co-founded Appature, a health marketing startup that sold to IMS Health in 2013. Amperity’s backers include HighSage Ventures, Tiger Global Management, Declaration Partners, Madrona Venture Group and Madera Technology Partners. Its board includes Madrona Managing Director Matt McIlwain; Accolade CEO Raj Singh; former Starbucks CEO Kevin Johnson; and singer-songwriter Ciara."
    },
    {
        "id": "recjIqZcPqpoYdrDB",
        "createdTime": "2022-08-05T19:28:04.000Z",
        "Company": "iRobot",
        "Location HQ": [
            "Boston"
        ],
        "Industry": "Consumer",
        "# Laid Off": 140,
        "%": 0.1,
        "Date": "2022-08-05T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/amazon-to-acquire-roomba-maker-irobot-for-1-7-billion/",
        "$ Raised (mm)": 30,
        "Stage": "Acquired",
        "Date Added": "2022-08-05T19:28:04.000Z",
        "Country": "United States",
        "Extracted Article": "Amazon is set to make another major acquisition. The Seattle tech giant said Friday it will scoop up iRobot, the Boston-area company known for its Roomba vacuum, in a $1.7 billion deal. The news comes just two weeks after Amazon announced it will acquire primary care company One Medical for $3.9 billion. This would be Amazon’s fourth-largest acquisition ever, behind its $13.7 billion purchase of Whole Foods, the $8.45 billion deal to buy MGM, and the One Medical acquisition. The iRobot deal signals Amazon’s large appetite for acquisitions amid the economic downturn and despite increasing U.S. antitrust scrutiny. Amazon will acquire iRobot for $61 per share, about a 22% premium from the company’s stock price at market close Thursday. Shares of iRobot were up nearly 20% in pre-market trading Friday. RELATED: As Amazon vacuums up iRobot, critics call on regulators to pull the plug on Big Tech deals The deal marks Amazon’s latest investment in the smart home. The company is working on its own home robot, Astro, which debuted in September, and has an array of smart home technology products such as Ring cameras and Alexa-enabled devices. Amazon acquired Ring in 2018 for $1 billion, and bought mesh WiFi startup eero in 2019. There are existing connections between Amazon and iRobot: Alexa can control Roomba devices already, and iRobot uses Amazon Web Services. In addition to consumer robotics, Amazon is also developing robots for the company’s warehouses. Amazon earlier this year invested in Agility Robotics, maker of a bipedal warehouse robot called Digit. It acquired warehouse robot developer Kiva for $775 million in 2012. Ken Washington, who leads the Astro team as Amazon’s vice president of consumer robotics, made it clear that the company would be expanding its family of home robots, speaking in an interview with GeekWire at the company’s re:MARS conference in Las Vegas. However, it wasn’t apparent until now that the company would do that in part through a major acquisition. “Astro is our first consumer home robot,” Washington said at the time. “It’s not going to be our last.” With Astro, the company has embraced a vision for a multi-purpose home robot, able to conduct security patrols, dance, or deliver items to specific people around the house. iRobot has taken a different approach with Roomba as a single-purpose device. Founded in 1990 by researchers from MIT Artificial Intelligence Lab, iRobot unveiled the Roomba in 2002. The company also sells robotic mops, air purifiers, and more. iRobot shares have fallen more than 40% this year. The company’s second quarter revenue, reported Friday, fell to $255.4 million, down from $365.6 million in the year-ago period. It blamed declining revenue on unanticipated order reductions, delays and cancellations from retailers, lower-than-anticipated direct-to-consumer sales, and the impact of changes in foreign exchange rates. The company’s GAAP operating loss grew to $63.9 million in the quarter, up from a $3 million loss last year. iRobot said it plans to lay off 140 people, about 10% of its workforce, as part of a restructuring. iRobot has 15.7 million customers (those who have opted-in to its digital communications), up 35% from the second quarter of 2021. The company’s CEO and chairman, Colin Angle, will continue leading iRobot following the acquisition. Perhaps there were earlier signs of Amazon’s interest in iRobot — CNBC reporter Jordan Novet recalled this Instagram post from Amazon founder Jeff Bezos back in 2018. View this post on Instagram A post shared by Jeff Bezos (@jeffbezos)"
    },
    {
        "id": "recgR8jTj9LHo8KHw",
        "createdTime": "2022-07-30T23:27:23.000Z",
        "Company": "Shelf Engine",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Food",
        "# Laid Off": 43,
        "Date": "2022-07-29T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-startup-shelf-engine-lays-off-43-employees-due-to-challenging-economic-conditions/",
        "$ Raised (mm)": 58,
        "Stage": "Series B",
        "Date Added": "2022-07-30T23:27:23.000Z",
        "Country": "United States",
        "Extracted Article": "Shelf Engine is the latest Seattle startup to cut its workforce. The company, which helps grocers manage food orders, confirmed to GeekWire that it laid off 43 employees due to “challenging economic conditions.” It didn’t provide an updated headcount; the startup employed 200 people in September when it raised cash from a group of celebrities. According to LinkedIn, the company currently has around 150 employees. “Due to the current challenging economic conditions, Shelf Engine made the very difficult decision to reduce the number of positions at the company,” CEO and co-founder Stefan Kalb wrote in an email to GeekWire. “We are moving forward aligned in pursuit of our mission to reduce food waste through automation.” Amid the broader economic downturn, many companies are being advised to reduce costs and extend cash runways, which often means laying off employees. Seattle startups such as Convoy, Flyhomes, Rad Power Bikes, 98point6, and Esper all had rounds of layoffs this year. Founded in 2016, Shelf uses machine learning to streamline the ordering process for grocers stocking their produce sections, aiming to trim costs and reduce waste in the process. The company reported in September that retailers who use the platform can reduce food waste by as much as 32% while increasing profits. Shelf Engine makes money by marking up products it buys from vendors that it sells to retailers. In September, the startup said that it was being used in at least 3,500 U.S. stores, with large retailers such as Kroger, Target and Whole Foods, as well as the food service company Compass Group named as clients. It also opened a second office in Denver. Shelf Engine co-founders Bede Jordan (left) and Stefan Kalb. (Shelf Engine Photo) Kalb got the idea for the company through another startup he co-founded, Molly’s, which provides healthy food to hospitals, grocery stores, coffee shops, gyms and offices. Kalb noticed the difficulty of building efficient fresh food orders and decided to build software that helped Molly’s purchase the right amount of bulk food to fulfill customer requests. Kalb co-founded Shelf Engine in 2016 with Bede Jordan, a Microsoft veteran who was the principal software engineering lead for the company’s HoloLens team. The leadership team also includes Deborah Alexander, chief operating officer and head of finance. The company has raised around $60 million to date, including a $41 million round in March 2021 and a $2 million round in September led by celebrities including Ellen DeGeneres, Portia de Rossi, Shaun White and Shawn Mendes. Other investors include General Catalyst, GGV Capital, Foundational Capital, 1984 Ventures, Correlation Ventures, Founders’ Co-op, Soma Capital, Firebolt Ventures, and Initialized Capital. Shelf’s post-money valuation in September was about $180 million, according to PitchBook."
    },
    {
        "id": "recv69McYkFbMbROe",
        "createdTime": "2022-07-21T19:56:20.000Z",
        "Company": "Rad Power Bikes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Transportation",
        "# Laid Off": 63,
        "%": 0.1,
        "Date": "2022-07-21T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/rad-power-bikes-cuts-about-10-of-staff-citing-economic-uncertainty-and-rising-operating-costs/",
        "$ Raised (mm)": 329,
        "Stage": "Series D",
        "Date Added": "2022-07-21T19:56:20.000Z",
        "Country": "United States",
        "Extracted Article": "Rad Power Bikes is laying off 63 employees, citing an effort to be a more “self-sustaining business” amid the broader economic downturn. The Seattle-based e-bike company confirmed the cuts to GeekWire on Thursday. It did not provide an updated headcount, or information on which positions are being affected, but sent the following statement. “Over the last few months the global economic outlook has become increasingly uncertain and our operating costs have significantly increased,” the company said. “To weather this challenging time we are shifting our focus to become a self-sustaining business. This has resulted in a team reduction which was something we worked hard to avoid, but was necessary to ensure the long term sustainability of Rad Power Bikes.” LAYOFF TRACKER 2022: A regularly updated list of layoffs in Seattle and the Pacific Northwest. Rad slashed 100 positions in April in what it called a “restructuring” effort at the time. Many startups are being advised to lay off employees in an effort to reduce costs and extend their cash runways. Rad was founded in 2007 and continues to be led by CEO Mike Radenbaugh, a former director of product development at GolfBoard. The company’s co-founder Ty Collins stepped down last year. The startup raised a total of $304 million last year, part of two separate cash infusions to fuel its capital-intensive business. The high flying company was valued at around $1.65 billion when it last received capital, making it one of Seattle’s 16 “unicorn” startups at the beginning of the year. Rad’s investors include Fidelity Management &amp; Research Company; Counterpoint Global (Morgan Stanley); Vulcan Capital; Durable Capital Partners LP; The Rise Fund (TPG’s multi-sector global impact investing strategy); and funds and accounts advised by T. Rowe Price Associates. Blue Nile and Zulily co-founders Darrell Cavens and Mark Vadon also invested in 2019."
    },
    {
        "id": "recy375xRdBwPrbeB",
        "createdTime": "2022-07-21T19:57:00.000Z",
        "Company": "RealSelf",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 11,
        "%": 0.05,
        "Date": "2022-07-21T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/cosmetic-treatment-review-platform-realself-lays-off-11-employees/",
        "$ Raised (mm)": 42,
        "Stage": "Series B",
        "Date Added": "2022-07-21T19:57:00.000Z",
        "Country": "United States",
        "Extracted Article": "RealSelf, the Seattle-based cosmetic treatment review platform, laid off 11 employees, or about 4.7% of its workforce this week. Chief Marketing Officer Hailey Sullivan told GeekWire that the company restructured its marketing and brands organization. “These changes will continue to support RealSelf’s strategy to deliver innovative value to our providers/specialists and industry brand partners, to expand geographically, and to evolve our platform to better serve our consumers,” Sullivan said in an emailed statement. “These decisions are always difficult and never taken lightly. We are grateful to our past employees and for their dedication to RealSelf’s brand purpose to empower every person to realize their most confident self.” LAYOFF TRACKER 2022: A regularly updated list of layoffs in Seattle and the Pacific Northwest. The startup cut 13% of its workforce, or about 40 employees, at the beginning of the year. Newly appointed CEO Jeff Kizilbash said in a statement at the time that to continue to achieve its growth objectives, RealSelf was “aligning resources and investments across our new global footprint.” Tech firms across various industries are laying off employees or freezing hiring as a way to curb expenses amid the current downturn. Seattle-area tech startups including Redfin, Convoy, Qumulo, Flyhomes and Esper have laid off employees in recent months. RealSelf operates a Yelp-like marketplace business that helps people learn more about cosmetic procedures including botox, Invisalign, breast augmentation, liposuction and more. Founded in 2006, the company has information, patient reviews and photos, treatment costs and ratings, and thousands of verified doctors on its platform. RealSelf saw its business impacted early in the pandemic but bounced back later in 2020. The company acquired two international cosmetic resource platforms last year: Your New Self and Tajmeeli."
    },
    {
        "id": "recky5rbd9LuIUV7I",
        "createdTime": "2022-07-22T23:48:59.000Z",
        "Company": "98point6",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "%": 0.1,
        "Date": "2022-07-21T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/health-care-startup-98point6-lays-off-10-of-workforce-but-says-its-still-in-growth-mode/",
        "$ Raised (mm)": 247,
        "Stage": "Series E",
        "Date Added": "2022-07-22T23:48:59.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based 98point6 recently laid off 10% of its workforce, but the telemedicine startup remains in “growth mode,” according to a human resources executive at the company. The company confirmed the cuts to GeekWire on Thursday, but did not provide any specifics on how many people were let go, which positions were affected, or what prompted the layoffs. “On July 6th, 98point6 executed a reduction in force to align with the future needs of the business,” Cami Blumenthal, vice president of people, said in an emailed statement. “While we’re disappointed to say farewell to members of our team, we remain in growth mode and are hiring for roles across our medical and technology groups. “We continue to express gratitude to all the employees impacted by this decision and thank them for their contributions in helping us to achieve our mission of delivering equitable access to primary care,” Blumenthal added. The startup employs 343 people, according to LinkedIn. A former employee who was part of the recent round of layoffs said on LinkedIn that the entire creative team was slashed. Another former employee said many members of the marketing team were also let go. LAYOFF TRACKER 2022: A regularly updated list of layoffs in Seattle and the Pacific Northwest. Many startups are cutting staff in order to reduce costs and extend runway amid the broader economic downturn. Seattle startups such as Convoy, Flyhomes, Qumulo and Rad Power Bikes have all had rounds of layoffs this year. Founded in 2015, 98point6 launched to make connecting with a physician as “simple as sending a text or doing an online search.” In 2020, its membership base skyrocketed by 274%, fueled by demand during the pandemic. The company provides primary care in all 50 states, connecting users in real-time to its doctors alongside an AI-powered chatbot, texts, and digital images. Its customers include giant corporations such as Boeing, as well as many health plans and health systems. It also goes direct-to-consumer. The startup is led by Jeff Greenstein, who became the company’s permanent CEO after taking over interim leadership duties following the departure of former CEO and co-founder Robbie Cape in August. 98point6 ranks 28th on the GeekWire 200, our list of the top tech startups in the Pacific Northwest. In October 2020, 98point6 raised more than $118 million in a Series E round led by private equity giant L Catterton and late-stage investment firm Activant Capital. Goldman Sachs, an existing investor, also participated. The raise put the company at a $518 million post-money valuation at the time, according to PitchBook. 98point6 has raised more than $250 million to-date."
    },
    {
        "id": "rec2RZsOwhLTAnw4W",
        "createdTime": "2022-07-20T20:08:14.000Z",
        "Company": "Flyhomes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "# Laid Off": 200,
        "%": 0.2,
        "Date": "2022-07-20T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-real-estate-startup-flyhomes-cuts-20-of-staff-citing-uncertain-economic-conditions/",
        "$ Raised (mm)": 310,
        "Stage": "Series C",
        "Date Added": "2022-07-20T20:08:14.000Z",
        "Country": "United States",
        "Extracted Article": "Flyhomes is the latest tech startup to cut jobs. The Seattle real estate company laid off approximately 20% of its staff, a spokesperson confirmed to GeekWire. The company did not provide an updated headcount. It has 763 employees, according to LinkedIn. One employee said 200 workers were let go. Tech firms across various industries are laying off employees or freezing hiring as a way to curb expenses amid the current downturn. Rising interest rates are affecting U.S. home sales, which has forced real estate companies such as Flyhomes and others to trim headcount. Layoff Tracker 2022: A regularly updated list of layoffs in Seattle and the Pacific Northwest. Flyhomes cited the impact of interest rate increases on demand for housing in a statement about its layoffs. “To build the world’s best home buying and selling experience, we must operate in a manner that is both fiscally prudent and sustainable in the face of uncertain economic conditions,” the company said. Redfin, another Seattle real estate company, laid off 8% of its workforce last month. Compass also cut jobs and shut down its Seattle-based title business. Other Seattle-area tech startups including Convoy, Qumulo, and Esper have laid off employees in recent months. Google is freezing hiring for two weeks, The Information reported Wednesday. Founded in 2016, Flyhomes helps people buy homes using a cash offer program which presents customers as the equivalent of cash buyers. A majority of the company’s revenue comes from agent commissions. The startup also offers mortgage services and has a Buy Before You Sell program that helps sellers buy and move into their next home before selling their current property. Flyhomes has helped customers buy nearly $3 billion worth of homes. The company is led by CEO and co-founder Tushar Garg. It has raised more than $200 million to date, including a $150 million Series C round raised in June 2021. Investors include Norwest Venture Partners, Battery Ventures, Fifth Wall, Camber Creek, Balyasny Asset Management, Andreessen Horowitz, Canvas Partners, and former Zillow Group CEO Spencer Rascoff."
    },
    {
        "id": "rectU2wtZJOLc5xI6",
        "createdTime": "2022-06-30T02:47:04.000Z",
        "Company": "Qumulo",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Data",
        "# Laid Off": 80,
        "%": 0.19,
        "Date": "2022-06-29T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-startup-qumulo-lays-off-80-employees-ceo-cites-economic-conditions-and-reaching-profitability/",
        "$ Raised (mm)": 347,
        "Stage": "Series E",
        "Date Added": "2022-06-30T02:47:04.000Z",
        "Country": "United States",
        "Extracted Article": "Seattle-based data storage provider Qumulo laid off about 80 employees Wednesday, or roughly 19% of its staff, in the latest round of job cuts affecting tech companies. In a memo sent to employees and obtained by GeekWire, Qumulo CEO Bill Richter cited economic conditions and getting the company to profitability as reasons for the cuts. Hundreds of tech companies are slashing staff amid inflation and the possibility of a recession. Venture capitalists are advising startups to cut expenses and extend their cash runways. Other Seattle startups including Esper, Convoy, and Keepe have laid off employees in recent months, in addition to larger companies such as Redfin and SAP. In an interview with GeekWire on Wednesday, Richter said Qumulo is not seeing a slowdown in demand from customers. But the company is now operating in a different macroeconomic environment, he said. “The two most important things are growth and profitability — not one or the other,” Richter said. Qumulo last raised capital in 2020 when it reeled in a $125 million Series E round at a $1.2 billion valuation, making it one of a handful of Seattle “unicorns” to eclipse the $1 billion valuation mark. Qumulo CEO Bill Richter. (Qumulo Photo / Andy Rogers) The cloud file storage and management company helps companies manage unstructured data. There are now more than 200 billion files handled by Qumulo for customers such as Telus, University of Florida, and others. The acceleration of cloud technologies during the pandemic contributed to record growth in its business, Richter told us on the GeekWire Podcast last fall. Qumulo had about 300 employees at the start of 2020, and then ramped up hiring, reaching a peak of 450 people. But some growth expectations “did not sufficiently materialize,” Richter wrote in the memo, and excess headcount “added organizational complexity.” “We must operate a lean organization, invest where there are clear and repeatable returns, and be honest about what’s not paying off or sustainable,” Richter wrote in the memo. There are now about 350 employees at the company following the job cuts, Richter said. RELATED: GeekWire’s 2022 layoff tracker Qumulo investors include BlackRock, which led the Series E round; Highland Capital Partners; Madrona Venture Group; Kleiner Perkins; and Amity Ventures. Total funding to date is $351 million. Richter, also a venture partner at Madrona, joined Qumulo in 2016. He previously was an executive at Isilon Systems, a data storage company that sold to EMC for $2.25 billion in 2010. Former Isilon employees Peter Godman, Neal Fachan, and Aaron Passey founded Qumulo a decade ago. Godman stepped down as CEO when Richter was hired, and left the company in 2018. Passey left in 2016 and was a principal engineer at Dropbox from 2017 to 2021. Fachan left Qumulo in April but remains on the board. Qumulo in May hired Kiran Bhageshpur as chief technology officer. Bhageshpur was CEO and founder of Igneous, which sold to Rubrik in 2020, and also previously worked at Isilon. Editor’s note: This story was updated to reflect that Neal Fachan left the company April 1."
    },
    {
        "id": "recN9GstHqhgMiv0j",
        "createdTime": "2022-06-23T18:45:10.000Z",
        "Company": "Esper",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Other",
        "%": 0.12,
        "Date": "2022-06-23T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-startup-esper-cuts-12-of-staff-citing-current-economic-climate-as-tech-layoffs-continue/",
        "$ Raised (mm)": 10,
        "Stage": "Series A",
        "Date Added": "2022-06-23T18:45:10.000Z",
        "Country": "United States",
        "Extracted Article": "Esper, a Seattle-based startup that operates a DevOps platform for customers that manage fleets of company-owned Android devices, has laid off 12% of its staff. The company confirmed the cuts to GeekWire. It did not provide a number for total employees affected, or total headcount after the layoffs. Esper has more than 260 employees, according to LinkedIn, and employed 150 people when it raised a $60 million Series C round in October. “Today, as part of a company restructuring, Esper has reduced its workforce by 12%,” a company spokesperson said in a statement. “Based on the current economic climate and projections for future access to venture capital, we made the tough decision to eliminate roles and reduce expenditures. It’s rooted in changing our plan so that Esper can operate with the funding that we currently have and achieve revenue targets that will sustain us beyond the next two years.” An affected employee who said he was promoted three weeks ago wrote on LinkedIn that the layoffs were made without email or call notification — “just locked out of my devices.” Update: An Esper spokesperson said “every affected employee was personally contacted to share this unfortunate news before system changes were made.” RELATED: GeekWire’s 2022 layoff tracker Esper is the latest tech company to slash staff amid an uncertain economy affected by inflation and other factors. Venture capitalists are advising startups to cut expenses and extend their cash runways. Founded in 2018 by Microsoft vets Yadhu Gopalan and Shiv Sundar, Esper helps companies with development, deployment, and maintenance of devices used across industries such as healthcare, education, retail, restaurants, and more. The idea is to beef up traditional mobile device management (MDM) software with modern DevOps capabilities. Insight Partners led the Series C round, which came shortly after the company raised a $30 million Series B round in May 2021. Other backers include Scale Ventures, Madrona Venture Group, and Root Ventures. Total funding to date is $100 million. Esper hired a new CFO, David Barclay, in April. The company was a finalist for Deal of the Year at the GeekWire Awards 2022."
    },
    {
        "id": "rec9NEPPyBRtZ23nC",
        "createdTime": "2022-08-02T03:47:02.000Z",
        "Company": "JetClosing",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "%": 1,
        "Date": "2022-06-15T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/seattle-startup-jetclosing-which-launched-in-2016-to-digitize-home-closing-process-is-shutting-down/",
        "$ Raised (mm)": 44,
        "Stage": "Series B",
        "Date Added": "2022-08-02T03:47:02.000Z",
        "Country": "United States",
        "Extracted Article": "JetClosing, a 6-year-old Seattle startup that digitizes the home closing process for buyers, sellers, and realtors, is shutting down, GeekWire has learned. The company is closing June 15, according to an email viewed by GeekWire that was sent from a JetClosing employee to a customer. In the email, the customer was encouraged to take their business to another title company. GeekWire called JetClosing’s corporate phone number and reached a receptionist, who wasn’t able to provide comment when asked about the company’s shutdown. GeekWire has reached out to others at the company, and its investors, and will update when we hear back. The company, founded in 2016, was one of the first spinouts of Seattle startup studio Pioneer Square Labs and was part of a growing trend in real estate to shift the homebuying experience online. JetClosing used machine learning, cloud computing, and other technology to digitize the title and escrow process and eliminate loads of paperwork. Its competitors — incumbent title and escrow services — could do the same job, but JetClosing sold itself on being able to do it faster, cheaper, on mobile, and with more transparency. The company charged a flat escrow fee to both sides for each transaction and made additional revenue on issuing owners and lenders title insurance policies. It also helped homeowners refinance. The startup benefited from a strong U.S. real estate market as well as habits ushered in during the COVID-19 pandemic, where people relied more on digital tools to skip in-person meetings and complete home transactions from anywhere in the world. However, JetClosing was also battling larger incumbent competitors and a recent cooling housing market affected by rising mortgage rates. Some high-tech mortgage startups such as Better and Blend have laid off staff this year. JetClosing CEO Anna Collins. (JetClosing Photo) Economic uncertainty is also causing tech startups across various industries to trim expenses and slow hiring. JetClosing is led by President and CEO Anna Collins, who took over for original co-founder and CEO Daniel Greenshields last year. Collins previously led Bulletproof, the lifestyle company with a brain-boosting coffee product, as president and COO. She spent about six years at Amazon, including as GM of Worldwide Prime Membership, and also held leadership roles at PhotoRocket, Microsoft, drugstore.com, and aQuantive. Greenshields previously spent nearly 15 years helping run ShareBuilder, a company sold to Capital One (which later sold it to Etrade) that digitized and sped up the process of buying stocks, bonds, mutual funds, 401(K) plans, and more. “It’s a very consumer friendly product. We specialize in drama-free closing,” Greenshields said about JetClosing during an episode of the “GeekWire Elevator Pitch” in 2018. He envisioned a “massive expansion opportunity” at the time. JetClosing is licensed to operate in Arizona, Colorado, Nevada, Florida, Pennsylvania, Texas, and Washington. The company has offices in Seattle, Las Vegas, Phoenix, Austin and San Antonio, Texas. The company raised $20 million in a Series A round in 2018 and was nominated for Startup of the Year at the GeekWire Awards that year. It closed an $11 million Series B round in March 2021 and had raised $44 million to date at that time. The company’s investors included PSL Ventures, T. Rowe Price, Imagen Capital Partners, Trilogy Equity Partners, and Maveron. A year ago, JetClosing employed about 80 people. The company now has 65 employees according to LinkedIn. GeekWire Managing Editor Taylor Soper contributed to this report."
    },
    {
        "id": "recis9dAQJEJ610Ut",
        "createdTime": "2022-06-11T03:57:40.000Z",
        "Company": "Keepe",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Real Estate",
        "Date": "2022-06-10T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/home-repair-service-keepe-lays-off-staff-as-economic-uncertainty-spooks-startups/",
        "$ Raised (mm)": 6,
        "Stage": "Unknown",
        "Date Added": "2022-06-11T03:57:40.000Z",
        "Country": "United States",
        "Extracted Article": "Over the past year, home repair marketplace startup Keepe tripled its enterprise customer base and grew work order volume by 200%. Yet the Seattle company recently laid off employees as rising inflation and other macroeconomic factors are causing tech startups to cut expenses. Keepe CEO Rishi Mathew confirmed the cuts to GeekWire but declined to provide specific numbers. The company has 36 employees, according to LinkedIn. Keepe is the latest startup to slash headcount. Tech companies cut more than 15,000 positions last month. This week GeekWire reported on layoffs at trucking marketplace startup Convoy and cannabis retail software provider Dutchie. Venture capitalists are advising tech companies to cut expenses and extend their cash runways. “While we had to make some difficult personnel changes a couple weeks back, it has allowed us to ensure that Keepe is well positioned to navigate the increasing uncertainty in the global markets,” Mathew told GeekWire. Mathew co-founded Keepe with his RealNetworks colleagues in 2016. The startup matches home repair technicians with property managers and other real estate companies that look after homes and apartments. It has raised $8 million to date, including a $5 million round last year. “We remain convinced that the B2B home services industry is ripe for disruption with the kind of value-added machine learning/automation-driven service that Keepe provides,” Mathew said. “The momentum we’ve experienced over the last 12 months is proof of that.”"
    },
    {
        "id": "recEe6oIOkXBjKW3n",
        "createdTime": "2022-06-10T04:13:41.000Z",
        "Company": "Convoy",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Logistics",
        "# Laid Off": 90,
        "%": 0.07,
        "Date": "2022-06-09T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/convoy-which-just-raised-260m-lays-off-7-of-workforce-in-latest-tech-startup-cuts/",
        "$ Raised (mm)": 1100,
        "Stage": "Series E",
        "Date Added": "2022-06-10T04:13:41.000Z",
        "Country": "United States",
        "Extracted Article": "Convoy laid off 7% of its staff Thursday, becoming the latest tech company to slash headcount amid an uncertain economic environment. A spokesperson for the Seattle trucking marketplace startup confirmed the layoffs to GeekWire. Convoy said it employed 1,300 people in April, when it raised a $260 million investment round at a $3.8 billion valuation, so the cuts affected around 90 employees. “We have made a number of organizational and other operating expense related changes to ensure we are in the strongest financial position possible ahead of the potential for worsening economic conditions,” the spokesperson said in a statement (read in full below). A bevy of tech startups have laid off employees and larger giants are slowing or halting hiring altogether, with a number of macroeconomic conditions including rising inflation causing concern for companies across sectors. Venture capitalists are advising tech companies to cut expenses and extend their cash runways. Stitch Fix and Bird are among those that also announced layoffs this week. Even unicorn startups — those valued at above $1 billion — are not immune to market forces, including companies that just raised huge swaths of cash such as Convoy. Here’s the full statement from the Convoy spokesperson: “We have made a number of organizational and other operating expense related changes to ensure we are in the strongest financial position possible ahead of the potential for worsening economic conditions. As a result of these changes, we were sad to have to say goodbye to approximately 7% of Convoy’s workforce today. This decision was not easy, nor taken lightly. With our recent fundraise behind us and the continued intrinsic strength of our business we look forward to continuing to disrupt the freight industry for the betterment of truck drivers, shippers and the planet, whatever market conditions we encounter along the way. We will be opening up our networks to support departing staff in their efforts to secure new roles.” Founded in 2015 and backed by the likes of Bill Gates and Jeff Bezos, Convoy’s software automates transactions between trucking companies and shippers. Its network has more than 400,000 trucks and a roster of shippers including Home Depot, Procter &amp; Gamble, Unilever, and Anheuser-Busch. The company, ranked No. 4 on the GeekWire 200 list of top Pacific Northwest startups, said in April it expected to surpass $1 billion in revenue this year. Its revenue for the first quarter was up 51% year-over-year. It was just ranked No. 6 on CNBC’s annual Disruptor 50 list. Convoy is one of many fast-growing logistics tech startups — including several in the Seattle region — that have raised billions of dollars in recent years amid supply chain chaos caused by the pandemic as shippers dealt with market unpredictability and are turning to tech for help. RELATED: Q&amp;A: Seattle startups may be insulated from the downturn, and other insights from VC Chris DeVore Convoy competes with a number of similar digital-focused shipping companies including Uber Freight, in addition to traditional brokers investing in their own technology. They are battling for a share of a $800 billion U.S. trucking industry. Convoy is led by co-founders who previously worked at Amazon: CEO Dan Lewis and Chief Experience Officer Grant Goodale. They started the company by hanging out at truck stops and getting kicked out of warehouses as they did market research when Convoy was just a kernel of an idea. Former Expedia CEO Mark Okerstrom joined the company in August 2020 as president and COO. Former Cars.com CFO Sonia Jain just joined Convoy as its CFO earlier this year. In addition to its fresh venture funding, Convoy also landed a $150 million line of credit in April. Other investors include Baillie Gifford; accounts advised by T. Rowe Price Associates, Inc.; Expedia Chairman Barry Diller; Salesforce CEO Marc Benioff; Code.org founders Hadi and Ali Partovi; former Starbucks president Howard Behar; U2’s Bono and The Edge; among others."
    },
    {
        "id": "recbGoszkv6UGHNOl",
        "createdTime": "2022-06-07T00:40:23.000Z",
        "Company": "Dutchie",
        "Location HQ": [
            "Bend"
        ],
        "Industry": "Other",
        "# Laid Off": 50,
        "%": 0.07,
        "Date": "2022-06-06T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/dutchie-lays-off-7-of-workforce-citing-dramatic-market-shift-in-latest-cannabis-tech-company-cuts/",
        "$ Raised (mm)": 603,
        "Stage": "Series D",
        "Date Added": "2022-06-07T00:40:23.000Z",
        "Country": "United States",
        "Extracted Article": "Dutchie, a Bend, Ore.-based software startup that serves cannabis retailers, has laid off 8% of its workforce. GeekWire confirmed the cuts with a Dutchie spokesperson. The company employs more than 700 people. The cuts affected roles across product and recruiting teams, according to LinkedIn posts written by laid off employees. “I am saddened, frustrated, and genuinely blindsided by this decision,” one laid off employee wrote. “Beyond my frustration, confusion, and disappointment, I’m heartbroken,” another said. Dutchie is the latest tech company to lay off workers in response to the broader ongoing economic uncertainty. Several cannabis software companies have slashed staff in recent weeks, including Eaze and Akerna. Dutchie was valued at $3.75 billion when it raised a $350 million Series D round in October, which came just seven months after the startup raised $200 million. Dutchie also acquired Greenbits and LeafLogix earlier this year. The company serves more than 5,000 dispensaries across the U.S. with e-commerce, point of sale and payment products. It’s among a group of tech companies riding the wave of support for marijuana legalization in the U.S., including the passage of legislation across multiple states. Legal cannabis sales grew 40% to $25 billion in 2021. Dutchie’s backers include D1 Capital Partners, which led the Series D round, and others such as Tiger Global, which was featured by the Wall Street Journal on Monday in a story that described how the recent downturn “vaporized years of its gains.” Other backers include Dragoneer, DFJ Growth, Thrive Capital, Gron Ventures, Casa Verde Capital, Willoughby Capital, Glynn Capital, and Park West Asset Management. A Dutchie spokesperson provided this statement from Dutchie CEO and co-founder Ross Lipson, who started the company in 2017 with his brother Zach. “Like many other companies watching the dramatic market shift over the last few months, we took time as a team to carefully think through our business plans to ensure we are set up to fulfill our mission. Fortunately, the cannabis industry is still growing at a rapid pace and is positioned well to be resilient in the case of a broader recession. Last week, we gathered our entire team together to communicate an important and difficult decision to restructure a few areas of the business. This decision impacts approximately 8% of the company’s overall workforce. We are forever grateful for everyone’s contributions to Dutchie and the cannabis industry that were impacted.Dutchie is in a strong position and we are focused on continued growth. We will continue to hire top talent and pursue growth opportunities that map to our business objectives in order to advance our mission to provide safe and easy access to cannabis while helping to drive the cannabis industry forward.” Editor’s note: The story and headline were updated to reflect the percentage of employees laid off."
    },
    {
        "id": "rechiDlZmHi21p9qV",
        "createdTime": "2022-05-17T14:17:49.000Z",
        "Company": "Zulily",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Retail",
        "Date": "2022-05-16T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/online-retailer-zulily-lays-off-corporate-workers-as-parent-qurate-aims-to-cut-expenses/",
        "$ Raised (mm)": 194,
        "Stage": "Acquired",
        "Date Added": "2022-05-17T14:17:49.000Z",
        "Country": "United States",
        "Extracted Article": "Online retailer Zulily laid off corporate employees last week as its parent company looks to cut costs amid broader industry concerns related to e-commerce growth. Fewer than 100 positions were impacted, or less than 10% of the company’s corporate workforce. A spokesperson for Qurate Retail Group, which acquired Seattle-based Zulily in 2015, confirmed the cuts but did not provide specific numbers on jobs affected. “Last week, we announced to our team members some hard choices we have made for our organization to bring our operating expenses in line with our revenue and position our business for future growth,” the spokesperson said in a statement. Zulily employs more than 900 people in Seattle, according to LinkedIn. Zulily’s revenue decreased 38% in the first quarter to $232 million, Qurate reported earlier this month. Operating losses grew to $38 million, from $18 million in the year-ago quarter. “Zulily revenue decreased primarily reflecting product scarcity largely driven by supply chain constraints and marketing inefficiencies due to cost inflation and privacy changes on certain social media platforms, which caused Zulily to reduce marketing spend, affecting its customer acquisition and retention,” Qurate said in its earnings report. Zulily also took a $2 million restructuring charge in the quarter mostly related to its “regional office space strategy” and closure of a Pennsylvania facility later this year, which will result in 504 job cuts. The company also took a $396 million operating loss in Q4 due to a $363 million “non-cash impairment charge related to its tradename and goodwill.” We’ve followed up with Zulily to get details on the charge. Other e-commerce companies including Amazon are seeing growth slow following two years of online shopping surges during the pandemic. Inflation and supply chain woes are also impacting online retailers. UPS last month projected e-commerce delivery growth to cool. Zulily in March hired former Nordstrom exec Terry Boyle as president and CEO. Boyle replaced Jeff Yurcisin, the former Amazon executive and Shopbop CEO who took over in May 2018 for longtime CEO and co-founder Darrell Cavens. Zulily went public in 2013 and was acquired by Qurate for $2.4 billion in August 2015."
    },
    {
        "id": "recATynZC8YhttQMB",
        "createdTime": "2022-05-05T23:38:15.000Z",
        "Company": "Rad Power Bikes",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Transportation",
        "# Laid Off": 100,
        "%": 0.14,
        "Date": "2022-04-12T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/rad-power-bikes-lays-off-100-employees-about-14-of-staff-after-raising-304m-last-year/",
        "$ Raised (mm)": 329,
        "Stage": "Series D",
        "Date Added": "2022-05-05T23:38:15.000Z",
        "Country": "United States",
        "Extracted Article": "Rad Power Bikes is slashing 100 jobs from its 725-person workforce as part of what the Seattle e-bike business describes as a restructuring. The cuts affect employees who helped power the company’s mobile services arm, which is shutting down, including those on the ground and at the Seattle headquarters. Rad offered customers repairs at their doorstep via mobile services; it will now partner with third-party providers Velofix and Beeline Connect to continue offering mobile support. Rad sent a statement to GeekWire after we received a tip about the layoffs earlier Tuesday morning. “Rad Power Bikes is restructuring to bring more focus to our online and retail stores and expanding our footprint with additional retail locations this year,” a company spokesperson said in the statement. “We will be closing the majority of our mobile services business as part of our growth strategy moving forward. As we build future stores, we will expand into the areas covered by our mobile business and beyond. With this adjustment, we will be able to continue offering the best ebikes at the best price, in-store and also online.” Following the layoffs, Rad plans to hire 125 people this year to staff five new retail locations, adding to its existing stores in Seattle, Vancouver, B.C., San Diego, Berkeley, and Utrecht, Netherlands. It has also hired a new president and COO, Phil Molyneux, former president at Sony Electronics and Dyson America. He was most recently CEO at Wrethink. Rad continues to be led by CEO Mike Radenbaugh, a former director of product development at GolfBoard. The company’s co-founder Ty Collins stepped down last year. Rad raised $304 million last year as part of two separate cash infusions to fuel its capital-intensive business. It was valued at $1.65 billion in October, according to PitchBook, making it one of a handful of “unicorn” startups in the Seattle region. The RadCity 5 Plus. (Rad Power Bikes Photo) Rad saw big demand amid the pandemic as more people bought e-bikes. The company is also riding tailwinds from climate-related trends as people and companies look to lower their carbon footprint. But like many other businesses, Rad has been dealing with supply chain issues. To help reduce delivery time, last year Rad bought 64 containers and worked closely with a logistics partner to charter its cargo into the Port of Everett near Seattle. Rad declined to share new revenue metrics. The company said it surpassed $100 million in revenue in 2019. The startup has more than 400,000 riders worldwide. It sells to commercial customers such as national pizza chains and food delivery companies, in addition to its consumer business. The global e-bike market is expected to reach $118.6 billion by 2030, according to Allied Market Research. E-bikes are now a larger category than road bikes based on sales revenue, according to NPD Group. Rad’s bikes top out at 20 MPH and range from $1,199 to $1,999, across nine models. Other competitors including VanMoof have also raised capital in recent years to support demand. The company’s investors include Fidelity Management &amp; Research Company; Counterpoint Global (Morgan Stanley); Vulcan Capital; Durable Capital Partners LP; The Rise Fund (TPG’s multi-sector global impact investing strategy); and funds and accounts advised by T. Rowe Price Associates. Blue Nile and Zulily co-founders Darrell Cavens and Mark Vadon also invested in 2019."
    },
    {
        "id": "rec1F9zqn6nNePPqV",
        "createdTime": "2022-05-29T17:59:11.000Z",
        "Company": "Adaptive Biotechnologies",
        "Location HQ": [
            "Seattle"
        ],
        "Industry": "Healthcare",
        "# Laid Off": 100,
        "%": 0.12,
        "Date": "2022-03-08T00:00:00.000Z",
        "Source": "https://www.geekwire.com/2022/adaptive-biotechnologies-lays-off-about-100-people-12-of-headcount-to-streamline-our-workforce/",
        "$ Raised (mm)": 406,
        "Stage": "Post-IPO",
        "Date Added": "2022-05-29T17:59:11.000Z",
        "Country": "United States",
        "Extracted Article": "Adaptive Biotechnologies is laying off 12% of its workforce, or about 100 employees, GeekWire has learned. “We have made the hard decision to streamline our workforce,” a spokesperson told GeekWire. “Given current market conditions affecting Adaptive and the biotech industry more broadly, we needed to ensure we had enough flexibility to meet our medium- to long-terms goals.” The company had 858 full-time employees at the end of 2021, according to its annual filing with the SEC. Adaptive, which develops technology to assess the immune response, grew fast during the pandemic. The company doubled its workforce and signed up new partnerships with vaccine companies to help analyze and develop COVID-19 vaccines. Adaptive also rapidly developed and marketed a T-cell based COVID-19 test, increased sales of its kits to detect “minimal residual disease” in blood cancers, and has built up other biopharma partnerships. The layoffs also come less than six months after Adaptive cut the ribbon on a new headquarters in Seattle. But the company’s shares have declined about 80% from a peak in January 2021. Adaptive’s layoffs come as a hot biotech IPO market during 2021 cools down and biotech stock values decline. One key biotech index fund, the SPDR S&amp;P Biotech ETF (XBI), is down about 50% from February 2021. Some other biotech companies have also been trimming staff, including Roche’s Genentech and Vancouver, B.C. and Seattle-area Zymeworks, which is laying off 25% of its workforce. Adaptive is undergoing a reorganization to focus on two key business areas, “minimal residual disease (MRD) and immune medicine,” according to the spokesperson. “As part of this process, we are deprioritizing projects and programs that are no longer aligned with the goals of the two business areas,” she added. The company’s revenue for 2021 was $154.3 million, a 57% increase from 2020, according to its most recent earnings report. Net loss came in at $207.3 million, up from $146.2 million in 2020. Fourth quarter revenue was $37.9 million, up 26% from the year-ago period. Net loss last quarter was $61.4 million, up from $44.6 million. At the end of last year, the company had $570.2 million available in cash, cash equivalents and marketable securities. CEO Chad Robins launched the company in 2009 with his brother, chief scientific officer Harlan Robins, and they took the company public in 2019. The company was spun out of Fred Hutchinson Cancer Research Center, where Chad previously served as head of computational biology. Update: On Tuesday afternoon, Adaptive released a message that Chad Robins had sent to employees earlier in the day. “Ensuring we have the capital and the resources to fuel our growth while navigating turbulent market conditions has resulted in the need to make hard choices,” said Robins. After a comprehensive review, “it became clear that we had to cut operating expenses, deprioritize certain projects and programs, and make significant adjustments to expenditures on capital projects.” Adaptive’s long-time CFO Chad Cohen stepped down in January. The company will be making an announcement Wednesday morning about a replacement, “a significant part of our realignment,” said the spokesperson. “We are sad to being parting ways with our team members but believe these changes will set us up for success and growth,” the spokesperson added. “Our team is doing everything possible to support their transition, including a comprehensive exit package. The Seattle biotech market is intimate and our executives and remaining employees will be doing everything they can to help our departing colleagues network.”"
    }
]